$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.1',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '7.3.0',
          'Headers' => {
                         'in.h' => 1,
                         'includes.h' => 1,
                         'netdb.h' => 1,
                         'options.h' => 1,
                         'radcli.h' => 1,
                         'sockaddr.h' => 1,
                         'socket.h' => 1,
                         'stddef.h' => 1,
                         'stdint-uintn.h' => 1,
                         'types.h' => 1,
                         'util.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libradcli.so.4.1.3',
          'LibraryVersion' => undef,
          'MissedOffsets' => '1',
          'MissedRegs' => '1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libgnutls.so.30' => 1,
                        'libnettle.so.6' => 1
                      },
          'Sources' => {
                         'aaa_ctx.c' => 1,
                         'avpair.c' => 1,
                         'buildreq.c' => 1,
                         'config.c' => 1,
                         'dict.c' => 1,
                         'ip_util.c' => 1,
                         'log.c' => 1,
                         'sendserver.c' => 1,
                         'tls.c' => 1,

                                                   'rc_avpair_new@@RADCLI_4' => 1,
                                                   'rc_avpair_next@@RADCLI_4' => 1,
                                                   'rc_avpair_parse@@RADCLI_4' => 1,
                                                   'rc_avpair_remove@@RADCLI_4' => 1,
                                                   'rc_avpair_tostr@@RADCLI_4' => 1,
                                                   'rc_buildreq@@RADCLI_4' => 1,
                                                   'rc_check@@RADCLI_4' => 1,
                                                   'rc_check_tls@@RADCLI_4' => 1,
                                                   'rc_conf_int@@RADCLI_4' => 1,
                                                   'rc_conf_srv@@RADCLI_4' => 1,
                                                   'rc_conf_str@@RADCLI_4' => 1,
                                                   'rc_config_free@@RADCLI_4' => 1,
                                                   'rc_config_init@@RADCLI_4' => 1,
                                                   'rc_destroy@@RADCLI_4' => 1,
                                                   'rc_dict_findattr@@RADCLI_4' => 1,
                                                   'rc_dict_findval@@RADCLI_4' => 1,
                                                   'rc_dict_findvend@@RADCLI_4' => 1,
                                                   'rc_dict_free@@RADCLI_4' => 1,
                                                   'rc_dict_getattr@@RADCLI_4' => 1,
                                                   'rc_dict_getval@@RADCLI_4' => 1,
                                                   'rc_dict_getvend@@RADCLI_4' => 1,
                                                   'rc_find_server_addr@@RADCLI_4' => 1,
                                                   'rc_get_socket_type@@RADCLI_4' => 1,
                                                   'rc_get_srcaddr@@RADCLI_4' => 1,
                                                   'rc_getport@@RADCLI_4' => 1,
                                                   'rc_mksid@@RADCLI_4' => 1,
                                                   'rc_new@@RADCLI_4' => 1,
                                                   'rc_openlog@@RADCLI_4' => 1,
                                                   'rc_own_hostname@@RADCLI_4' => 1,
                                                   'rc_read_config@@RADCLI_4' => 1,
                                                   'rc_read_dictionary@@RADCLI_4' => 1,
                                                   'rc_send_server@@RADCLI_4' => 1,
                                                   'rc_setdebug@@RADCLI_4' => 1,
                                                   'rc_test_config@@RADCLI_4' => 1,
                                                   'rc_tls_fd@@RADCLI_4' => 1
                                                 }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1013' => {
                                      'Header' => 'socket.h',
                                      'Line' => '188',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ss_family',
                                                           'offset' => '0',
                                                           'type' => '944'
                                                         },
                                                  '1' => {
                                                           'name' => '__ss_padding',
                                                           'offset' => '2',
                                                           'type' => '1062'
                                                         },
                                                  '2' => {
                                                           'name' => '__ss_align',
                                                           'offset' => '120',
                                                           'type' => '66'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_storage',
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '1062' => {
                                      'BaseType' => '186',
                                      'Name' => 'char[118]',
                                      'Size' => '118',
                                      'Type' => 'Array'
                                    },
                          '1078' => {
                                      'Header' => 'in.h',
                                      'Line' => '213',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__u6_addr8',
                                                           'offset' => '0',
                                                           'type' => '1120'
                                                         },
                                                  '1' => {
                                                           'name' => '__u6_addr16',
                                                           'offset' => '0',
                                                           'type' => '1136'
                                                         },
                                                  '2' => {
                                                           'name' => '__u6_addr32',
                                                           'offset' => '0',
                                                           'type' => '1152'
                                                         }
                                                },
                                      'Name' => 'anon-union-in.h-213',
                                      'Size' => '16',
                                      'Type' => 'Union'
                                    },
                          '109' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1120' => {
                                      'BaseType' => '900',
                                      'Name' => 'uint8_t[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '1136' => {
                                      'BaseType' => '911',
                                      'Name' => 'uint16_t[8]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '1152' => {
                                      'BaseType' => '922',
                                      'Name' => 'uint32_t[4]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '116' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '41',
                                     'Name' => '__uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1168' => {
                                      'Header' => 'in.h',
                                      'Line' => '211',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__in6_u',
                                                           'offset' => '0',
                                                           'type' => '1078'
                                                         }
                                                },
                                      'Name' => 'struct in6_addr',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '1220' => {
                                      'BaseType' => '180',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1226' => {
                                      'BaseType' => '955',
                                      'Name' => 'struct sockaddr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1232' => {
                                      'BaseType' => '1238',
                                      'Name' => 'void const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1238' => {
                                      'BaseType' => '1',
                                      'Name' => 'void const',
                                      'Type' => 'Const'
                                    },
                          '127' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '12796' => {
                                       'BaseType' => '6603',
                                       'Name' => 'unsigned char const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1295' => {
                                      'Name' => 'void(*)(int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '109'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1487' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '63',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'AUTH',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'ACCT',
                                                           'value' => '1'
                                                         }
                                                },
                                      'Name' => 'enum rc_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1517' => {
                                      'BaseType' => '1487',
                                      'Header' => 'radcli.h',
                                      'Line' => '66',
                                      'Name' => 'rc_type',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1528' => {
                                      'BaseType' => '1544',
                                      'Header' => 'radcli.h',
                                      'Line' => '78',
                                      'Name' => 'rc_handle',
                                      'Size' => '384',
                                      'Type' => 'Typedef'
                                    },
                          '1539' => {
                                      'BaseType' => '1528',
                                      'Name' => 'rc_handle const',
                                      'Size' => '384',
                                      'Type' => 'Const'
                                    },
                          '1544' => {
                                      'Header' => 'includes.h',
                                      'Line' => '188',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'config_options',
                                                           'offset' => '0',
                                                           'type' => '3739'
                                                         },
                                                  '1' => {
                                                           'name' => 'nas_addr',
                                                           'offset' => '8',
                                                           'type' => '1013'
                                                         },
                                                  '10' => {
                                                            'name' => 'so_type',
                                                            'offset' => '376',
                                                            'type' => '59'
                                                          },
                                                  '2' => {
                                                           'name' => 'nas_addr_set',
                                                           'offset' => '136',
                                                           'type' => '59'
                                                         },
                                                  '3' => {
                                                           'name' => 'own_bind_addr',
                                                           'offset' => '144',
                                                           'type' => '1013'
                                                         },
                                                  '4' => {
                                                           'name' => 'own_bind_addr_set',
                                                           'offset' => '272',
                                                           'type' => '59'
                                                         },
                                                  '5' => {
                                                           'name' => 'first_dict_read',
                                                           'offset' => '280',
                                                           'type' => '180'
                                                         },
                                                  '6' => {
                                                           'name' => 'dictionary_attributes',
                                                           'offset' => '288',
                                                           'type' => '2930'
                                                         },
                                                  '7' => {
                                                           'name' => 'dictionary_values',
                                                           'offset' => '296',
                                                           'type' => '3002'
                                                         },
                                                  '8' => {
                                                           'name' => 'dictionary_vendors',
                                                           'offset' => '304',
                                                           'type' => '3061'
                                                         },
                                                  '9' => {
                                                           'name' => 'so',
                                                           'offset' => '312',
                                                           'type' => '3723'
                                                         }
                                                },
                                      'Name' => 'struct rc_conf',
                                      'Size' => '384',
                                      'Type' => 'Struct'
                                    },
                          '167' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '169' => {
                                     'BaseType' => '127',
                                     'Header' => 'types.h',
                                     'Line' => '181',
                                     'Name' => '__ssize_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1696' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '83',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'max',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '8',
                                                           'type' => '1769'
                                                         },
                                                  '2' => {
                                                           'name' => 'port',
                                                           'offset' => '72',
                                                           'type' => '1136'
                                                         },
                                                  '3' => {
                                                           'name' => 'secret',
                                                           'offset' => '88',
                                                           'type' => '1769'
                                                         },
                                                  '4' => {
                                                           'name' => 'deadtime_ends',
                                                           'offset' => '152',
                                                           'type' => '1785'
                                                         }
                                                },
                                      'Name' => 'struct server',
                                      'Size' => '216',
                                      'Type' => 'Struct'
                                    },
                          '1769' => {
                                      'BaseType' => '180',
                                      'Name' => 'char*[8]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '1785' => {
                                      'BaseType' => '1801',
                                      'Name' => 'double[8]',
                                      'Size' => '64',
                                      'Type' => 'Array'
                                    },
                          '180' => {
                                     'BaseType' => '186',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1801' => {
                                      'Name' => 'double',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '1808' => {
                                      'BaseType' => '1696',
                                      'Header' => 'radcli.h',
                                      'Line' => '89',
                                      'Name' => 'SERVER',
                                      'Size' => '216',
                                      'Type' => 'Typedef'
                                    },
                          '1819' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '93',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'RC_SOCKET_UDP',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'RC_SOCKET_TLS',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'RC_SOCKET_DTLS',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'RC_SOCKET_TCP',
                                                           'value' => '3'
                                                         }
                                                },
                                      'Name' => 'enum rc_socket_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '186' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1861' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '108',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'PW_TYPE_STRING',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'PW_TYPE_INTEGER',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'PW_TYPE_IPADDR',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'PW_TYPE_DATE',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'PW_TYPE_IPV6ADDR',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'PW_TYPE_IPV6PREFIX',
                                                           'value' => '5'
                                                         }
                                                },
                                      'Name' => 'enum rc_attr_type',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '1915' => {
                                      'BaseType' => '1861',
                                      'Header' => 'radcli.h',
                                      'Line' => '115',
                                      'Name' => 'rc_attr_type',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1926' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '119',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'PW_ACCESS_REQUEST',
                                                           'value' => '1'
                                                         },
                                                  '1' => {
                                                           'name' => 'PW_ACCESS_ACCEPT',
                                                           'value' => '2'
                                                         },
                                                  '10' => {
                                                            'name' => 'PW_ACCESS_CHALLENGE',
                                                            'value' => '11'
                                                          },
                                                  '11' => {
                                                            'name' => 'PW_STATUS_SERVER',
                                                            'value' => '12'
                                                          },
                                                  '12' => {
                                                            'name' => 'PW_STATUS_CLIENT',
                                                            'value' => '13'
                                                          },
                                                  '2' => {
                                                           'name' => 'PW_ACCESS_REJECT',
                                                           'value' => '3'
                                                         },
                                                  '3' => {
                                                           'name' => 'PW_ACCOUNTING_REQUEST',
                                                           'value' => '4'
                                                         },
                                                  '4' => {
                                                           'name' => 'PW_ACCOUNTING_RESPONSE',
                                                           'value' => '5'
                                                         },
                                                  '5' => {
                                                           'name' => 'PW_ACCOUNTING_STATUS',
                                                           'value' => '6'
                                                         },
                                                  '6' => {
                                                           'name' => 'PW_PASSWORD_REQUEST',
                                                           'value' => '7'
                                                         },
                                                  '7' => {
                                                           'name' => 'PW_PASSWORD_ACK',
                                                           'value' => '8'
                                                         },
                                                  '8' => {
                                                           'name' => 'PW_PASSWORD_REJECT',
                                                           'value' => '9'
                                                         },
                                                  '9' => {
                                                           'name' => 'PW_ACCOUNTING_MESSAGE',
                                                           'value' => '10'
                                                         }
                                                },
                                      'Name' => 'enum rc_standard_codes',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '193' => {
                                     'BaseType' => '186',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '198' => {
                                     'BaseType' => '59',
                                     'Header' => 'types.h',
                                     'Line' => '197',
                                     'Name' => '__socklen_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2022' => {
                                      'BaseType' => '1926',
                                      'Header' => 'radcli.h',
                                      'Line' => '133',
                                      'Name' => 'rc_standard_codes',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '209' => {
                                     'BaseType' => '169',
                                     'Header' => 'types.h',
                                     'Line' => '109',
                                     'Name' => 'ssize_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '21994' => {
                                       'BaseType' => '2848',
                                       'Header' => 'radcli.h',
                                       'Line' => '431',
                                       'Name' => 'DICT_ATTR',
                                       'Size' => '56',
                                       'Type' => 'Typedef'
                                     },
                          '22078' => {
                                       'BaseType' => '2936',
                                       'Header' => 'radcli.h',
                                       'Line' => '439',
                                       'Name' => 'DICT_VALUE',
                                       'Size' => '80',
                                       'Type' => 'Typedef'
                                     },
                          '22656' => {
                                       'BaseType' => '59',
                                       'Name' => 'unsigned int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22847' => {
                                       'BaseType' => '1168',
                                       'Name' => 'struct in6_addr*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '22915' => {
                                       'BaseType' => '922',
                                       'Name' => 'uint32_t*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '231' => {
                                     'BaseType' => '66',
                                     'Header' => 'stddef.h',
                                     'Line' => '216',
                                     'Name' => 'size_t',
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '24105' => {
                                       'BaseType' => '22078',
                                       'Name' => 'DICT_VALUE*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '25321' => {
                                       'BaseType' => '186',
                                       'Name' => 'char[64]',
                                       'Size' => '64',
                                       'Type' => 'Array'
                                     },
                          '25337' => {
                                       'BaseType' => '21994',
                                       'Name' => 'DICT_ATTR*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '256' => {
                                     'BaseType' => '186',
                                     'Name' => 'char[32]',
                                     'Size' => '32',
                                     'Type' => 'Array'
                                   },
                          '272' => {
                                     'BaseType' => '193',
                                     'Name' => 'char const*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2848' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '425',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '2914'
                                                         },
                                                  '1' => {
                                                           'name' => 'value',
                                                           'offset' => '36',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '40',
                                                           'type' => '1915'
                                                         },
                                                  '3' => {
                                                           'name' => 'next',
                                                           'offset' => '48',
                                                           'type' => '2930'
                                                         }
                                                },
                                      'Name' => 'struct dict_attr',
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '2914' => {
                                      'BaseType' => '186',
                                      'Name' => 'char[33]',
                                      'Size' => '33',
                                      'Type' => 'Array'
                                    },
                          '2930' => {
                                      'BaseType' => '2848',
                                      'Name' => 'struct dict_attr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2936' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '433',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'attrname',
                                                           'offset' => '0',
                                                           'type' => '2914'
                                                         },
                                                  '1' => {
                                                           'name' => 'name',
                                                           'offset' => '33',
                                                           'type' => '2914'
                                                         },
                                                  '2' => {
                                                           'name' => 'value',
                                                           'offset' => '68',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'next',
                                                           'offset' => '72',
                                                           'type' => '3002'
                                                         }
                                                },
                                      'Name' => 'struct dict_value',
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '3002' => {
                                      'BaseType' => '2936',
                                      'Name' => 'struct dict_value*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3008' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '441',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'vendorname',
                                                           'offset' => '0',
                                                           'type' => '2914'
                                                         },
                                                  '1' => {
                                                           'name' => 'vendorpec',
                                                           'offset' => '36',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'next',
                                                           'offset' => '40',
                                                           'type' => '3061'
                                                         }
                                                },
                                      'Name' => 'struct dict_vendor',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '3061' => {
                                      'BaseType' => '3008',
                                      'Name' => 'struct dict_vendor*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3128' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '468',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '2914'
                                                         },
                                                  '1' => {
                                                           'name' => 'attribute',
                                                           'offset' => '36',
                                                           'type' => '59'
                                                         },
                                                  '2' => {
                                                           'name' => 'type',
                                                           'offset' => '40',
                                                           'type' => '1915'
                                                         },
                                                  '3' => {
                                                           'name' => 'lvalue',
                                                           'offset' => '44',
                                                           'type' => '922'
                                                         },
                                                  '4' => {
                                                           'name' => 'strvalue',
                                                           'offset' => '48',
                                                           'type' => '3236'
                                                         },
                                                  '5' => {
                                                           'name' => 'next',
                                                           'offset' => '304',
                                                           'type' => '3252'
                                                         },
                                                  '6' => {
                                                           'name' => 'pad',
                                                           'offset' => '312',
                                                           'type' => '256'
                                                         }
                                                },
                                      'Name' => 'struct rc_value_pair',
                                      'Size' => '344',
                                      'Type' => 'Struct'
                                    },
                          '31499' => {
                                       'BaseType' => '1819',
                                       'Header' => 'radcli.h',
                                       'Line' => '98',
                                       'Name' => 'rc_socket_type',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '3236' => {
                                      'BaseType' => '186',
                                      'Name' => 'char[254]',
                                      'Size' => '254',
                                      'Type' => 'Array'
                                    },
                          '3252' => {
                                      'BaseType' => '3128',
                                      'Name' => 'struct rc_value_pair*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3258' => {
                                      'BaseType' => '3128',
                                      'Header' => 'radcli.h',
                                      'Line' => '477',
                                      'Name' => 'VALUE_PAIR',
                                      'Size' => '344',
                                      'Type' => 'Typedef'
                                    },
                          '3270' => {
                                      'Header' => 'radcli.h',
                                      'Line' => '479',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'code',
                                                           'offset' => '0',
                                                           'type' => '900'
                                                         },
                                                  '1' => {
                                                           'name' => 'seq_nbr',
                                                           'offset' => '1',
                                                           'type' => '900'
                                                         },
                                                  '2' => {
                                                           'name' => 'server',
                                                           'offset' => '8',
                                                           'type' => '180'
                                                         },
                                                  '3' => {
                                                           'name' => 'svc_port',
                                                           'offset' => '16',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'secret',
                                                           'offset' => '24',
                                                           'type' => '180'
                                                         },
                                                  '5' => {
                                                           'name' => 'timeout',
                                                           'offset' => '32',
                                                           'type' => '109'
                                                         },
                                                  '6' => {
                                                           'name' => 'retries',
                                                           'offset' => '36',
                                                           'type' => '109'
                                                         },
                                                  '7' => {
                                                           'name' => 'send_pairs',
                                                           'offset' => '40',
                                                           'type' => '3401'
                                                         },
                                                  '8' => {
                                                           'name' => 'receive_pairs',
                                                           'offset' => '48',
                                                           'type' => '3401'
                                                         }
                                                },
                                      'Name' => 'struct send_data',
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '3401' => {
                                      'BaseType' => '3258',
                                      'Name' => 'VALUE_PAIR*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3407' => {
                                      'BaseType' => '3270',
                                      'Header' => 'radcli.h',
                                      'Line' => '490',
                                      'Name' => 'SEND_DATA',
                                      'Size' => '56',
                                      'Type' => 'Typedef'
                                    },
                          '3419' => {
                                      'BaseType' => '3431',
                                      'Header' => 'radcli.h',
                                      'Line' => '495',
                                      'Name' => 'RC_AAA_CTX',
                                      'Size' => '113',
                                      'Type' => 'Typedef'
                                    },
                          '3431' => {
                                      'Header' => 'includes.h',
                                      'Line' => '210',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'secret',
                                                           'offset' => '0',
                                                           'type' => '3745'
                                                         },
                                                  '1' => {
                                                           'name' => 'request_vector',
                                                           'offset' => '97',
                                                           'type' => '1120'
                                                         }
                                                },
                                      'Name' => 'struct rc_aaa_ctx_st',
                                      'Size' => '113',
                                      'Type' => 'Struct'
                                    },
                          '3468' => {
                                      'Header' => 'includes.h',
                                      'Line' => '175',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ptr',
                                                           'offset' => '0',
                                                           'type' => '167'
                                                         },
                                                  '1' => {
                                                           'name' => 'static_secret',
                                                           'offset' => '8',
                                                           'type' => '272'
                                                         },
                                                  '2' => {
                                                           'name' => 'get_fd',
                                                           'offset' => '16',
                                                           'type' => '3597'
                                                         },
                                                  '3' => {
                                                           'name' => 'close_fd',
                                                           'offset' => '24',
                                                           'type' => '1295'
                                                         },
                                                  '4' => {
                                                           'name' => 'sendto',
                                                           'offset' => '32',
                                                           'type' => '3654'
                                                         },
                                                  '5' => {
                                                           'name' => 'recvfrom',
                                                           'offset' => '40',
                                                           'type' => '3711'
                                                         },
                                                  '6' => {
                                                           'name' => 'lock',
                                                           'offset' => '48',
                                                           'type' => '3717'
                                                         },
                                                  '7' => {
                                                           'name' => 'unlock',
                                                           'offset' => '56',
                                                           'type' => '3717'
                                                         }
                                                },
                                      'Name' => 'struct rc_sockets_override',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '34922' => {
                                       'BaseType' => '8087',
                                       'Name' => 'struct addrinfo**',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '3597' => {
                                      'Name' => 'int(*)(void*, struct sockaddr*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '167'
                                                          },
                                                   '1' => {
                                                            'type' => '1226'
                                                          }
                                                 },
                                      'Return' => '109',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3648' => {
                                      'BaseType' => '992',
                                      'Name' => 'struct sockaddr const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3654' => {
                                      'Name' => 'ssize_t(*)(void*, int, void const*, size_t, int, struct sockaddr const*, socklen_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '167'
                                                          },
                                                   '1' => {
                                                            'type' => '109'
                                                          },
                                                   '2' => {
                                                            'type' => '1232'
                                                          },
                                                   '3' => {
                                                            'type' => '231'
                                                          },
                                                   '4' => {
                                                            'type' => '109'
                                                          },
                                                   '5' => {
                                                            'type' => '3648'
                                                          },
                                                   '6' => {
                                                            'type' => '933'
                                                          }
                                                 },
                                      'Return' => '209',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3705' => {
                                      'BaseType' => '933',
                                      'Name' => 'socklen_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3711' => {
                                      'Name' => 'ssize_t(*)(void*, int, void*, size_t, int, struct sockaddr*, socklen_t*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '167'
                                                          },
                                                   '1' => {
                                                            'type' => '109'
                                                          },
                                                   '2' => {
                                                            'type' => '167'
                                                          },
                                                   '3' => {
                                                            'type' => '231'
                                                          },
                                                   '4' => {
                                                            'type' => '109'
                                                          },
                                                   '5' => {
                                                            'type' => '1226'
                                                          },
                                                   '6' => {
                                                            'type' => '3705'
                                                          }
                                                 },
                                      'Return' => '209',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3717' => {
                                      'Name' => 'int(*)(void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '167'
                                                          }
                                                 },
                                      'Return' => '109',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '3723' => {
                                      'BaseType' => '3468',
                                      'Header' => 'includes.h',
                                      'Line' => '186',
                                      'Name' => 'rc_sockets_override',
                                      'Size' => '64',
                                      'Type' => 'Typedef'
                                    },
                          '3734' => {
                                      'Header' => 'options.h',
                                      'Line' => '23',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'name',
                                                           'offset' => '0',
                                                           'type' => '25321'
                                                         },
                                                  '1' => {
                                                           'name' => 'type',
                                                           'offset' => '64',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'status',
                                                           'offset' => '68',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'val',
                                                           'offset' => '72',
                                                           'type' => '167'
                                                         }
                                                },
                                      'Name' => 'struct _option',
                                      'Size' => '80',
                                      'Type' => 'Struct'
                                    },
                          '3739' => {
                                      'BaseType' => '3734',
                                      'Name' => 'struct _option*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '3745' => {
                                      'BaseType' => '186',
                                      'Name' => 'char[97]',
                                      'Size' => '97',
                                      'Type' => 'Array'
                                    },
                          '4228' => {
                                      'BaseType' => '1528',
                                      'Name' => 'rc_handle*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '45' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '4630' => {
                                      'BaseType' => '3401',
                                      'Name' => 'VALUE_PAIR**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '47202' => {
                                       'BaseType' => '3008',
                                       'Header' => 'radcli.h',
                                       'Line' => '446',
                                       'Name' => 'DICT_VENDOR',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '47701' => {
                                       'BaseType' => '47202',
                                       'Name' => 'DICT_VENDOR*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '52' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '5873' => {
                                      'BaseType' => '5879',
                                      'Name' => 'RC_AAA_CTX**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5879' => {
                                      'BaseType' => '3419',
                                      'Name' => 'RC_AAA_CTX*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '5885' => {
                                      'BaseType' => '1808',
                                      'Name' => 'SERVER*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '59' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '6383' => {
                                      'BaseType' => '1539',
                                      'Name' => 'rc_handle const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6389' => {
                                      'BaseType' => '3407',
                                      'Name' => 'SEND_DATA*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '66' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '6603' => {
                                      'BaseType' => '45',
                                      'Name' => 'unsigned char const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '7963' => {
                                      'Header' => 'netdb.h',
                                      'Line' => '565',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'ai_flags',
                                                           'offset' => '0',
                                                           'type' => '109'
                                                         },
                                                  '1' => {
                                                           'name' => 'ai_family',
                                                           'offset' => '4',
                                                           'type' => '109'
                                                         },
                                                  '2' => {
                                                           'name' => 'ai_socktype',
                                                           'offset' => '8',
                                                           'type' => '109'
                                                         },
                                                  '3' => {
                                                           'name' => 'ai_protocol',
                                                           'offset' => '12',
                                                           'type' => '109'
                                                         },
                                                  '4' => {
                                                           'name' => 'ai_addrlen',
                                                           'offset' => '16',
                                                           'type' => '933'
                                                         },
                                                  '5' => {
                                                           'name' => 'ai_addr',
                                                           'offset' => '24',
                                                           'type' => '1226'
                                                         },
                                                  '6' => {
                                                           'name' => 'ai_canonname',
                                                           'offset' => '32',
                                                           'type' => '180'
                                                         },
                                                  '7' => {
                                                           'name' => 'ai_next',
                                                           'offset' => '40',
                                                           'type' => '8087'
                                                         }
                                                },
                                      'Name' => 'struct addrinfo',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '80' => {
                                    'BaseType' => '45',
                                    'Header' => 'types.h',
                                    'Line' => '37',
                                    'Name' => '__uint8_t',
                                    'Size' => '1',
                                    'Type' => 'Typedef'
                                  },
                          '8087' => {
                                      'BaseType' => '7963',
                                      'Name' => 'struct addrinfo*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '900' => {
                                     'BaseType' => '80',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '24',
                                     'Name' => 'uint8_t',
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '911' => {
                                     'BaseType' => '98',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '25',
                                     'Name' => 'uint16_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '922' => {
                                     'BaseType' => '116',
                                     'Header' => 'stdint-uintn.h',
                                     'Line' => '26',
                                     'Name' => 'uint32_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '933' => {
                                     'BaseType' => '198',
                                     'Header' => 'socket.h',
                                     'Line' => '33',
                                     'Name' => 'socklen_t',
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '944' => {
                                     'BaseType' => '52',
                                     'Header' => 'sockaddr.h',
                                     'Line' => '28',
                                     'Name' => 'sa_family_t',
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '955' => {
                                     'Header' => 'socket.h',
                                     'Line' => '175',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'sa_family',
                                                          'offset' => '0',
                                                          'type' => '944'
                                                        },
                                                 '1' => {
                                                          'name' => 'sa_data',
                                                          'offset' => '2',
                                                          'type' => '997'
                                                        }
                                               },
                                     'Name' => 'struct sockaddr',
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '98' => {
                                    'BaseType' => '52',
                                    'Header' => 'types.h',
                                    'Line' => '39',
                                    'Name' => '__uint16_t',
                                    'Size' => '2',
                                    'Type' => 'Typedef'
                                  },
                          '992' => {
                                     'BaseType' => '955',
                                     'Name' => 'struct sockaddr const',
                                     'Size' => '16',
                                     'Type' => 'Const'
                                   },
                          '997' => {
                                     'BaseType' => '186',
                                     'Name' => 'char[14]',
                                     'Size' => '14',
                                     'Type' => 'Array'
                                   }
                        },
          'UndefinedSymbols' => {
                                  'libradcli.so.4.1.3' => {
                                                            '_ITM_deregisterTMCloneTable' => 0,
                                                            '_ITM_registerTMCloneTable' => 0,
                                                            '__ctype_b_loc@GLIBC_2.3' => 0,
                                                            '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                            '__errno_location@GLIBC_2.2.5' => 0,
                                                            '__gmon_start__' => 0,
                                                            '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                            'abort@GLIBC_2.2.5' => 0,
                                                            'bind@GLIBC_2.2.5' => 0,
                                                            'calloc@GLIBC_2.2.5' => 0,
                                                            'clock_gettime@GLIBC_2.17' => 0,
                                                            'close@GLIBC_2.2.5' => 0,
                                                            'connect@GLIBC_2.2.5' => 0,
                                                            'fclose@GLIBC_2.2.5' => 0,
                                                            'fgets@GLIBC_2.2.5' => 0,
                                                            'fopen@GLIBC_2.2.5' => 0,
                                                            'free@GLIBC_2.2.5' => 0,
                                                            'freeaddrinfo@GLIBC_2.2.5' => 0,
                                                            'getaddrinfo@GLIBC_2.2.5' => 0,
                                                            'getnameinfo@GLIBC_2.2.5' => 0,
                                                            'getpid@GLIBC_2.2.5' => 0,
                                                            'getservbyname@GLIBC_2.2.5' => 0,
                                                            'getsockname@GLIBC_2.2.5' => 0,
                                                            'gmtime@GLIBC_2.2.5' => 0,
                                                            'gnutls_alert_get@GNUTLS_3_4' => 0,
                                                            'gnutls_alert_get_name@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_allocate_credentials@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_free_credentials@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_set_verify_function@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_set_x509_key_file@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_set_x509_trust_file@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_type_get@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_verification_status_print@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_verify_peers2@GNUTLS_3_4' => 0,
                                                            'gnutls_certificate_verify_peers3@GNUTLS_3_4' => 0,
                                                            'gnutls_credentials_set@GNUTLS_3_4' => 0,
                                                            'gnutls_deinit@GNUTLS_3_4' => 0,
                                                            'gnutls_dtls_set_timeouts@GNUTLS_3_4' => 0,
                                                            'gnutls_error_is_fatal@GNUTLS_3_4' => 0,
                                                            'gnutls_free@GNUTLS_3_4' => 0,
                                                            'gnutls_handshake@GNUTLS_3_4' => 0,
                                                            'gnutls_handshake_set_timeout@GNUTLS_3_4' => 0,
                                                            'gnutls_heartbeat_enable@GNUTLS_3_4' => 0,
                                                            'gnutls_heartbeat_ping@GNUTLS_3_4' => 0,
                                                            'gnutls_init@GNUTLS_3_4' => 0,
                                                            'gnutls_priority_set_direct@GNUTLS_3_4' => 0,
                                                            'gnutls_psk_allocate_client_credentials@GNUTLS_3_4' => 0,
                                                            'gnutls_psk_free_client_credentials@GNUTLS_3_4' => 0,
                                                            'gnutls_psk_set_client_credentials@GNUTLS_3_4' => 0,
                                                            'gnutls_record_recv@GNUTLS_3_4' => 0,
                                                            'gnutls_record_send@GNUTLS_3_4' => 0,
                                                            'gnutls_rnd@GNUTLS_3_4' => 0,
                                                            'gnutls_server_name_set@GNUTLS_3_4' => 0,
                                                            'gnutls_session_get_ptr@GNUTLS_3_4' => 0,
                                                            'gnutls_session_set_ptr@GNUTLS_3_4' => 0,
                                                            'gnutls_set_default_priority@GNUTLS_3_4' => 0,
                                                            'gnutls_strerror@GNUTLS_3_4' => 0,
                                                            'gnutls_transport_set_int2@GNUTLS_3_4' => 0,
                                                            'inet_ntoa@GLIBC_2.2.5' => 0,
                                                            'inet_ntop@GLIBC_2.2.5' => 0,
                                                            'inet_pton@GLIBC_2.2.5' => 0,
                                                            'localtime@GLIBC_2.2.5' => 0,
                                                            'malloc@GLIBC_2.2.5' => 0,
                                                            'memcmp@GLIBC_2.2.5' => 0,
                                                            'memcpy@GLIBC_2.14' => 0,
                                                            'memmove@GLIBC_2.2.5' => 0,
                                                            'mktime@GLIBC_2.2.5' => 0,
                                                            'nettle_MD5Final@NETTLE_6' => 0,
                                                            'nettle_MD5Init@NETTLE_6' => 0,
                                                            'nettle_MD5Update@NETTLE_6' => 0,
                                                            'nettle_hmac_md5_digest@NETTLE_6' => 0,
                                                            'nettle_hmac_md5_set_key@NETTLE_6' => 0,
                                                            'nettle_hmac_md5_update@NETTLE_6' => 0,
                                                            'open@GLIBC_2.2.5' => 0,
                                                            'openlog@GLIBC_2.2.5' => 0,
                                                            'poll@GLIBC_2.2.5' => 0,
                                                            'pthread_mutex_destroy@GLIBC_2.2.5' => 0,
                                                            'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                            'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                            'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                            'random@GLIBC_2.2.5' => 0,
                                                            'recvfrom@GLIBC_2.2.5' => 0,
                                                            'sendto@GLIBC_2.2.5' => 0,
                                                            'setns@GLIBC_2.14' => 0,
                                                            'snprintf@GLIBC_2.2.5' => 0,
                                                            'socket@GLIBC_2.2.5' => 0,
                                                            'sprintf@GLIBC_2.2.5' => 0,
                                                            'srandom@GLIBC_2.2.5' => 0,
                                                            'strcasecmp@GLIBC_2.2.5' => 0,
                                                            'strcat@GLIBC_2.2.5' => 0,
                                                            'strchr@GLIBC_2.2.5' => 0,
                                                            'strcmp@GLIBC_2.2.5' => 0,
                                                            'strcpy@GLIBC_2.2.5' => 0,
                                                            'strcspn@GLIBC_2.2.5' => 0,
                                                            'strdup@GLIBC_2.2.5' => 0,
                                                            'strerror@GLIBC_2.2.5' => 0,
                                                            'strftime@GLIBC_2.2.5' => 0,
                                                            'strlen@GLIBC_2.2.5' => 0,
                                                            'strncmp@GLIBC_2.2.5' => 0,
                                                            'strrchr@GLIBC_2.2.5' => 0,
                                                            'strtok_r@GLIBC_2.2.5' => 0,
                                                            'strtol@GLIBC_2.2.5' => 0,
                                                            'syslog@GLIBC_2.2.5' => 0,
                                                            'time@GLIBC_2.2.5' => 0,
                                                            'uname@GLIBC_2.2.5' => 0
                                                          }
                                },
          'WordSize' => '8'
        };
