<abi-corpus path='./lib/.libs/libradcli.so' architecture='elf-amd-x86_64' soname='libradcli.so.5'>
  <elf-needed>
    <dependency name='libasan.so.5'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rc_aaa' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_free' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_get_secret' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_get_vector' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_server' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_acct' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rc_dict_addvend' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_findattr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_findval' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_findvend' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_free' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_getattr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_getval' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_getvend' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_find_server_addr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_get_socket_type' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_get_srcaddr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_getport' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_mksid' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_add' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_create_multihandle' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_destroy_multihandle' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_get_fd_set' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_get_pollfds' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_process' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_process_fd_set' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_process_pollfds' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_remove' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_multi_remove_next_done' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_new' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_openlog' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_own_hostname' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_config' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_dictionary' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_dictionary_from_buffer' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_send_server' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_setdebug' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_test_config' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='buildreq.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <class-decl name='rc_conf' size-in-bits='3136' is-struct='yes' visibility='default' filepath='../include/includes.h' line='190' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='config_options' type-id='type-id-3' visibility='default' filepath='../include/includes.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nas_addr' type-id='type-id-4' visibility='default' filepath='../include/includes.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nas_addr_set' type-id='type-id-5' visibility='default' filepath='../include/includes.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='own_bind_addr' type-id='type-id-4' visibility='default' filepath='../include/includes.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='own_bind_addr_set' type-id='type-id-5' visibility='default' filepath='../include/includes.h' line='197' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='first_dict_read' type-id='type-id-6' visibility='default' filepath='../include/includes.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='dictionary_attributes' type-id='type-id-7' visibility='default' filepath='../include/includes.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='dictionary_values' type-id='type-id-8' visibility='default' filepath='../include/includes.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='dictionary_vendors' type-id='type-id-9' visibility='default' filepath='../include/includes.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='so' type-id='type-id-10' visibility='default' filepath='../include/includes.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='so_type' type-id='type-id-5' visibility='default' filepath='../include/includes.h' line='208' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_option' size-in-bits='640' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-3'/>
    <class-decl name='sockaddr_storage' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='191' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='type-id-13' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='type-id-14' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-15'/>
    <typedef-decl name='sa_family_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/sockaddr.h' line='28' column='1' id='type-id-12'/>
    <type-decl name='char' size-in-bits='8' id='type-id-16'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-14'/>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='944' id='type-id-13'>
      <subrange length='118' type-id='type-id-14' id='type-id-17'/>

    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-5'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-6'/>
    <class-decl name='dict_attr' size-in-bits='512' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='434' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-19' visibility='default' filepath='../include/radcli/radcli.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='value' type-id='type-id-20' visibility='default' filepath='../include/radcli/radcli.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='../include/radcli/radcli.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next' type-id='type-id-7' visibility='default' filepath='../include/radcli/radcli.h' line='439' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='264' id='type-id-19'>
      <subrange length='33' type-id='type-id-14' id='type-id-22'/>

    </array-type-def>
    <typedef-decl name='__uint64_t' type-id='type-id-14' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-23'/>
    <typedef-decl name='uint64_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-20'/>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-24'/>
    <enum-decl name='rc_attr_type' filepath='../include/radcli/radcli.h' line='116' column='1' id='type-id-25'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='PW_TYPE_STRING' value='0'/>
      <enumerator name='PW_TYPE_INTEGER' value='1'/>
      <enumerator name='PW_TYPE_IPADDR' value='2'/>
      <enumerator name='PW_TYPE_DATE' value='3'/>
      <enumerator name='PW_TYPE_IPV6ADDR' value='4'/>
      <enumerator name='PW_TYPE_IPV6PREFIX' value='5'/>
      <enumerator name='PW_TYPE_MAX' value='6'/>
    </enum-decl>
    <typedef-decl name='rc_attr_type' type-id='type-id-25' filepath='../include/radcli/radcli.h' line='124' column='1' id='type-id-21'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-7'/>
    <class-decl name='dict_value' size-in-bits='640' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='442' column='1' id='type-id-26'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrname' type-id='type-id-19' visibility='default' filepath='../include/radcli/radcli.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='name' type-id='type-id-19' visibility='default' filepath='../include/radcli/radcli.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='value' type-id='type-id-27' visibility='default' filepath='../include/radcli/radcli.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-8' visibility='default' filepath='../include/radcli/radcli.h' line='447' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__uint32_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='42' column='1' id='type-id-28'/>
    <typedef-decl name='uint32_t' type-id='type-id-28' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='26' column='1' id='type-id-27'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-8'/>
    <class-decl name='dict_vendor' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='450' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vendorname' type-id='type-id-19' visibility='default' filepath='../include/radcli/radcli.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='vendorpec' type-id='type-id-27' visibility='default' filepath='../include/radcli/radcli.h' line='453' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='type-id-9' visibility='default' filepath='../include/radcli/radcli.h' line='454' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-9'/>
    <class-decl name='rc_sockets_override' size-in-bits='576' is-struct='yes' visibility='default' filepath='../include/includes.h' line='175' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-31' visibility='default' filepath='../include/includes.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='static_secret' type-id='type-id-32' visibility='default' filepath='../include/includes.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_fd' type-id='type-id-33' visibility='default' filepath='../include/includes.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='close_fd' type-id='type-id-34' visibility='default' filepath='../include/includes.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='connect' type-id='type-id-35' visibility='default' filepath='../include/includes.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sendto' type-id='type-id-36' visibility='default' filepath='../include/includes.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='recvfrom' type-id='type-id-37' visibility='default' filepath='../include/includes.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lock' type-id='type-id-38' visibility='default' filepath='../include/includes.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlock' type-id='type-id-38' visibility='default' filepath='../include/includes.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='void' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-31'/>
    <qualified-type-def type-id='type-id-16' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-32'/>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='178' column='1' id='type-id-41'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='type-id-12' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='181' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='112' id='type-id-42'>
      <subrange length='14' type-id='type-id-14' id='type-id-43'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-34'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-47'/>
    <typedef-decl name='__ssize_t' type-id='type-id-47' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='193' column='1' id='type-id-48'/>
    <typedef-decl name='ssize_t' type-id='type-id-48' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-49'/>
    <qualified-type-def type-id='type-id-41' const='yes' id='type-id-50'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-51'/>
    <typedef-decl name='__socklen_t' type-id='type-id-5' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='209' column='1' id='type-id-52'/>
    <typedef-decl name='socklen_t' type-id='type-id-52' filepath='/usr/include/x86_64-linux-gnu/bits/socket.h' line='33' column='1' id='type-id-53'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-35'/>
    <typedef-decl name='size_t' type-id='type-id-14' filepath='/usr/lib/gcc/x86_64-linux-gnu/9/include/stddef.h' line='209' column='1' id='type-id-55'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-36'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-37'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-38'/>
    <typedef-decl name='rc_sockets_override' type-id='type-id-30' filepath='../include/includes.h' line='188' column='1' id='type-id-10'/>
    <typedef-decl name='rc_handle' type-id='type-id-2' filepath='../include/radcli/radcli.h' line='85' column='1' id='type-id-60'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-61'/>
    <function-decl name='rc_check' mangled-name='rc_check' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_check@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-6' name='host' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-6' name='secret' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-15' name='port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-6' name='msg' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='304' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rc_value_pair' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='479' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-19' visibility='default' filepath='../include/radcli/radcli.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attribute' type-id='type-id-20' visibility='default' filepath='../include/radcli/radcli.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type' type-id='type-id-21' visibility='default' filepath='../include/radcli/radcli.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='lvalue' type-id='type-id-27' visibility='default' filepath='../include/radcli/radcli.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strvalue' type-id='type-id-63' visibility='default' filepath='../include/radcli/radcli.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='next' type-id='type-id-64' visibility='default' filepath='../include/radcli/radcli.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='pad' type-id='type-id-65' visibility='default' filepath='../include/radcli/radcli.h' line='487' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='2032' id='type-id-63'>
      <subrange length='254' type-id='type-id-14' id='type-id-66'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-64'/>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='256' id='type-id-65'>
      <subrange length='32' type-id='type-id-14' id='type-id-67'/>

    </array-type-def>
    <typedef-decl name='VALUE_PAIR' type-id='type-id-62' filepath='../include/radcli/radcli.h' line='488' column='1' id='type-id-68'/>
    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-69'/>
    <function-decl name='rc_acct_proxy' mangled-name='rc_acct_proxy' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_acct_proxy@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='287' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='287' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_acct' mangled-name='rc_acct' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_acct@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='274' column='1'/>
      <parameter type-id='type-id-27' name='nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='274' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='274' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-70'/>
    <function-decl name='rc_auth_proxy' mangled-name='rc_auth_proxy' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_auth_proxy@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-70' name='received' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-6' name='msg' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='258' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_auth' mangled-name='rc_auth' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_auth@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-27' name='nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-70' name='received' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='236' column='1'/>
      <parameter type-id='type-id-6' name='msg' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='236' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <enum-decl name='rc_standard_codes' filepath='../include/radcli/radcli.h' line='128' column='1' id='type-id-71'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='PW_ACCESS_REQUEST' value='1'/>
      <enumerator name='PW_ACCESS_ACCEPT' value='2'/>
      <enumerator name='PW_ACCESS_REJECT' value='3'/>
      <enumerator name='PW_ACCOUNTING_REQUEST' value='4'/>
      <enumerator name='PW_ACCOUNTING_RESPONSE' value='5'/>
      <enumerator name='PW_ACCOUNTING_STATUS' value='6'/>
      <enumerator name='PW_PASSWORD_REQUEST' value='7'/>
      <enumerator name='PW_PASSWORD_ACK' value='8'/>
      <enumerator name='PW_PASSWORD_REJECT' value='9'/>
      <enumerator name='PW_ACCOUNTING_MESSAGE' value='10'/>
      <enumerator name='PW_ACCESS_CHALLENGE' value='11'/>
      <enumerator name='PW_STATUS_SERVER' value='12'/>
      <enumerator name='PW_STATUS_CLIENT' value='13'/>
    </enum-decl>
    <typedef-decl name='rc_standard_codes' type-id='type-id-71' filepath='../include/radcli/radcli.h' line='142' column='1' id='type-id-72'/>
    <function-decl name='rc_aaa' mangled-name='rc_aaa' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-27' name='nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-70' name='received' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-6' name='msg' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-1' name='add_nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-72' name='request_type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='217' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='rc_aaa_ctx_st' size-in-bits='904' is-struct='yes' visibility='default' filepath='../include/includes.h' line='212' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret' type-id='type-id-74' visibility='default' filepath='../include/includes.h' line='214' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='776'>
        <var-decl name='request_vector' type-id='type-id-75' visibility='default' filepath='../include/includes.h' line='215' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='776' id='type-id-74'>
      <subrange length='97' type-id='type-id-14' id='type-id-76'/>

    </array-type-def>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-77'/>
    <typedef-decl name='__uint8_t' type-id='type-id-77' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='38' column='1' id='type-id-78'/>
    <typedef-decl name='uint8_t' type-id='type-id-78' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='24' column='1' id='type-id-79'/>

    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='128' id='type-id-75'>
      <subrange length='16' type-id='type-id-14' id='type-id-80'/>

    </array-type-def>
    <typedef-decl name='RC_AAA_CTX' type-id='type-id-73' filepath='../include/radcli/radcli.h' line='506' column='1' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-83'/>
    <class-decl name='server' size-in-bits='1728' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='91' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max' type-id='type-id-1' visibility='default' filepath='../include/radcli/radcli.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-85' visibility='default' filepath='../include/radcli/radcli.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='port' type-id='type-id-86' visibility='default' filepath='../include/radcli/radcli.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='secret' type-id='type-id-85' visibility='default' filepath='../include/radcli/radcli.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='deadtime_ends' type-id='type-id-87' visibility='default' filepath='../include/radcli/radcli.h' line='96' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-6' size-in-bits='512' id='type-id-85'>
      <subrange length='8' type-id='type-id-14' id='type-id-88'/>

    </array-type-def>
    <typedef-decl name='__uint16_t' type-id='type-id-15' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-89'/>
    <typedef-decl name='uint16_t' type-id='type-id-89' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='25' column='1' id='type-id-90'/>

    <array-type-def dimensions='1' type-id='type-id-90' size-in-bits='128' id='type-id-86'>
      <subrange length='8' type-id='type-id-14' id='type-id-88'/>

    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-91'/>

    <array-type-def dimensions='1' type-id='type-id-91' size-in-bits='512' id='type-id-87'>
      <subrange length='8' type-id='type-id-14' id='type-id-88'/>

    </array-type-def>
    <typedef-decl name='SERVER' type-id='type-id-84' filepath='../include/radcli/radcli.h' line='97' column='1' id='type-id-92'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-93'/>
    <enum-decl name='rc_type' filepath='../include/radcli/radcli.h' line='70' column='1' id='type-id-94'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='AUTH' value='0'/>
      <enumerator name='ACCT' value='1'/>
    </enum-decl>
    <typedef-decl name='rc_type' type-id='type-id-94' filepath='../include/radcli/radcli.h' line='73' column='1' id='type-id-95'/>
    <function-decl name='rc_aaa_ctx_server' mangled-name='rc_aaa_ctx_server' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_server@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-83' name='ctx' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-93' name='aaaserver' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-95' name='type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='112' column='1'/>
      <parameter type-id='type-id-27' name='nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='113' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='114' column='1'/>
      <parameter type-id='type-id-70' name='received' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='114' column='1'/>
      <parameter type-id='type-id-6' name='msg' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='115' column='1'/>
      <parameter type-id='type-id-1' name='add_nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='115' column='1'/>
      <parameter type-id='type-id-72' name='request_type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='116' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx' mangled-name='rc_aaa_ctx' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-83' name='ctx' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-27' name='nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-70' name='received' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-6' name='msg' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-1' name='add_nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='72' column='1'/>
      <parameter type-id='type-id-72' name='request_type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='72' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-96'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-97'/>
    <class-decl name='send_data' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='490' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='code' type-id='type-id-79' visibility='default' filepath='../include/radcli/radcli.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='seq_nbr' type-id='type-id-79' visibility='default' filepath='../include/radcli/radcli.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='server' type-id='type-id-6' visibility='default' filepath='../include/radcli/radcli.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='svc_port' type-id='type-id-1' visibility='default' filepath='../include/radcli/radcli.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='secret' type-id='type-id-6' visibility='default' filepath='../include/radcli/radcli.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timeout' type-id='type-id-1' visibility='default' filepath='../include/radcli/radcli.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='retries' type-id='type-id-1' visibility='default' filepath='../include/radcli/radcli.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_pairs' type-id='type-id-69' visibility='default' filepath='../include/radcli/radcli.h' line='499' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='receive_pairs' type-id='type-id-69' visibility='default' filepath='../include/radcli/radcli.h' line='500' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='SEND_DATA' type-id='type-id-98' filepath='../include/radcli/radcli.h' line='501' column='1' id='type-id-99'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-100'/>
    <function-decl name='rc_buildreq' mangled-name='rc_buildreq' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_buildreq@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-100' name='data' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-1' name='code' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-6' name='server' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-15' name='port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-6' name='secret' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-1' name='timeout' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-1' name='retries' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/buildreq.c' line='42' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_conf_int' mangled-name='rc_conf_int' filepath='../include/radcli/radcli.h' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_add' mangled-name='rc_avpair_add' filepath='../include/radcli/radcli.h' line='573' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_send_server' mangled-name='rc_send_server' filepath='../include/radcli/radcli.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_free' mangled-name='rc_avpair_free' filepath='../include/radcli/radcli.h' line='582' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_store4' mangled-name='__asan_report_store4' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_load4' mangled-name='__asan_report_load4' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_store8' mangled-name='__asan_report_store8' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_load8' mangled-name='__asan_report_load8' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__stack_chk_fail' mangled-name='__stack_chk_fail' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__syslog_chk' mangled-name='__syslog_chk' filepath='/usr/include/x86_64-linux-gnu/bits/syslog.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_send_server_ctx' mangled-name='rc_send_server_ctx' filepath='../include/includes.h' line='218' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_getmtime' mangled-name='rc_getmtime' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/util.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_get' mangled-name='rc_avpair_get' filepath='../include/radcli/radcli.h' line='579' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_assign' mangled-name='rc_avpair_assign' filepath='../include/radcli/radcli.h' line='574' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_load2' mangled-name='__asan_report_load2' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_conf_srv' mangled-name='rc_conf_srv' filepath='../include/radcli/radcli.h' line='621' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='random' mangled-name='random' filepath='/usr/include/stdlib.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_store1' mangled-name='__asan_report_store1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-59'>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-45'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-1'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-54'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-49'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-56'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-49'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-58'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-44'/>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-49'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-46'>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-39'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='sendserver.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <function-decl name='rc_send_server' mangled-name='rc_send_server' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver.c' line='552' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_send_server@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver.c' line='552' column='1'/>
      <parameter type-id='type-id-100' name='data' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver.c' line='552' column='1'/>
      <parameter type-id='type-id-6' name='msg' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver.c' line='552' column='1'/>
      <parameter type-id='type-id-95' name='type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver.c' line='552' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='setsockopt' mangled-name='setsockopt' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__errno_location' mangled-name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strerror' mangled-name='strerror' filepath='/usr/include/string.h' line='397' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_conf_str' mangled-name='rc_conf_str' filepath='../include/radcli/radcli.h' line='619' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strcasecmp' mangled-name='strcasecmp' filepath='/usr/include/strings.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='getnameinfo' mangled-name='getnameinfo' filepath='/usr/include/netdb.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_store_n' mangled-name='__asan_report_store_n' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin_memset' mangled-name='memset' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='inet_ntop' mangled-name='inet_ntop' filepath='/usr/include/arpa/inet.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__poll_alias' mangled-name='poll' filepath='/usr/include/x86_64-linux-gnu/bits/poll2.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_set_netns' mangled-name='rc_set_netns' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/util.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_strlcpy' mangled-name='rc_strlcpy' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/util.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_find_server_addr' mangled-name='rc_find_server_addr' filepath='../include/radcli/radcli.h' line='624' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_own_bind_addr' mangled-name='rc_own_bind_addr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/util.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_remove' mangled-name='rc_avpair_remove' filepath='../include/radcli/radcli.h' line='578' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_get_srcaddr' mangled-name='rc_get_srcaddr' filepath='../include/radcli/radcli.h' line='660' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_random_vector' mangled-name='rc_random_vector' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_util.h' line='11' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_pack_list' mangled-name='rc_pack_list' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_util.h' line='4' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='add_msg_auth_attr' mangled-name='add_msg_auth_attr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_util.h' line='12' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_unpoison_stack_memory' mangled-name='__asan_unpoison_stack_memory' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='freeaddrinfo' mangled-name='freeaddrinfo' filepath='/usr/include/netdb.h' line='666' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_reset_netns' mangled-name='rc_reset_netns' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/util.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_check_reply' mangled-name='rc_check_reply' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_util.h' line='9' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='populate_ctx' mangled-name='populate_ctx' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_util.h' line='6' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strappend' mangled-name='strappend' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_util.h' line='5' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_store2' mangled-name='__asan_report_store2' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strlen' mangled-name='strlen' filepath='/usr/include/string.h' line='385' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_md5_calc' mangled-name='rc_md5_calc' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/rc-md5.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_getaddrinfo' mangled-name='rc_getaddrinfo' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/util.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_load1' mangled-name='__asan_report_load1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_load16' mangled-name='__asan_report_load16' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_gen' mangled-name='rc_avpair_gen' filepath='../include/radcli/radcli.h' line='576' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='sendserver_util.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <function-decl name='hmac_md5' mangled-name='hmac_md5' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/hmac.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='getentropy' mangled-name='getentropy' filepath='/usr/include/unistd.h' line='1161' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_load_n' mangled-name='__asan_report_load_n' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_report_store16' mangled-name='__asan_report_store16' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='malloc' mangled-name='malloc' filepath='/usr/include/stdlib.h' line='539' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___memcpy_chk' mangled-name='__memcpy_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___strcpy_chk' mangled-name='__strcpy_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='sendserver_async.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <class-decl name='rc_async_handle' size-in-bits='133376' is-struct='yes' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='41' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='msg' type-id='type-id-6' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-99' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-95' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ctx' type-id='type-id-83' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='rh' type-id='type-id-61' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='sockfd' type-id='type-id-1' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='736'>
        <var-decl name='result' type-id='type-id-1' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='state' type-id='type-id-102' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='auth_addr' type-id='type-id-103' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='sfuncs' type-id='type-id-104' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='so_type' type-id='type-id-105' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='secretlen' type-id='type-id-55' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='secret' type-id='type-id-74' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1864'>
        <var-decl name='vector' type-id='type-id-106' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1992'>
        <var-decl name='recv_buffer' type-id='type-id-107' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='67528'>
        <var-decl name='send_buffer' type-id='type-id-107' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133088'>
        <var-decl name='send_length' type-id='type-id-1' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133120'>
        <var-decl name='transferred' type-id='type-id-1' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133152'>
        <var-decl name='retry_max' type-id='type-id-1' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133184'>
        <var-decl name='retries' type-id='type-id-1' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133248'>
        <var-decl name='start_time' type-id='type-id-91' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='133312'>
        <var-decl name='timeout' type-id='type-id-91' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='rc_async_handle_state' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='31' column='1' id='type-id-102'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='RC_ASYNC_CREATED' value='0'/>
      <enumerator name='RC_ASYNC_PREPARED' value='1'/>
      <enumerator name='RC_ASYNC_CONNECTING' value='2'/>
      <enumerator name='RC_ASYNC_SENDING' value='3'/>
      <enumerator name='RC_ASYNC_RECEIVING' value='4'/>
      <enumerator name='RC_ASYNC_DONE' value='5'/>
    </enum-decl>
    <class-decl name='addrinfo' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/netdb.h' line='565' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ai_flags' type-id='type-id-1' visibility='default' filepath='/usr/include/netdb.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ai_family' type-id='type-id-1' visibility='default' filepath='/usr/include/netdb.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ai_socktype' type-id='type-id-1' visibility='default' filepath='/usr/include/netdb.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ai_protocol' type-id='type-id-1' visibility='default' filepath='/usr/include/netdb.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ai_addrlen' type-id='type-id-53' visibility='default' filepath='/usr/include/netdb.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ai_addr' type-id='type-id-44' visibility='default' filepath='/usr/include/netdb.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ai_canonname' type-id='type-id-6' visibility='default' filepath='/usr/include/netdb.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ai_next' type-id='type-id-103' visibility='default' filepath='/usr/include/netdb.h' line='574' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-103'/>
    <qualified-type-def type-id='type-id-10' const='yes' id='type-id-109'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-104'/>
    <enum-decl name='rc_socket_type' filepath='../include/radcli/radcli.h' line='101' column='1' id='type-id-110'>
      <underlying-type type-id='type-id-24'/>
      <enumerator name='RC_SOCKET_UDP' value='0'/>
      <enumerator name='RC_SOCKET_TLS' value='1'/>
      <enumerator name='RC_SOCKET_DTLS' value='2'/>
      <enumerator name='RC_SOCKET_TCP' value='3'/>
    </enum-decl>
    <typedef-decl name='rc_socket_type' type-id='type-id-110' filepath='../include/radcli/radcli.h' line='106' column='1' id='type-id-105'/>

    <array-type-def dimensions='1' type-id='type-id-77' size-in-bits='128' id='type-id-106'>
      <subrange length='16' type-id='type-id-14' id='type-id-80'/>

    </array-type-def>

    <array-type-def dimensions='1' type-id='type-id-79' size-in-bits='65536' id='type-id-107'>
      <subrange length='8192' type-id='type-id-14' id='type-id-111'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-112'/>
    <function-decl name='rc_async_create_handle_acct' mangled-name='rc_async_create_handle_acct' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='1041' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_create_handle_acct@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='1041' column='1'/>
      <parameter type-id='type-id-27' name='nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='1041' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='1042' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rc_async_create_handle_auth' mangled-name='rc_async_create_handle_auth' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='1012' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_create_handle_auth@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='1041' column='1'/>
      <parameter type-id='type-id-27' name='nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='1041' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='1042' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rc_async_create_handle' mangled-name='rc_async_create_handle' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='860' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_create_handle@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='860' column='1'/>
      <parameter type-id='type-id-83' name='ctx' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='860' column='1'/>
      <parameter type-id='type-id-93' name='aaaserver' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='860' column='1'/>
      <parameter type-id='type-id-95' name='type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='861' column='1'/>
      <parameter type-id='type-id-27' name='nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='861' column='1'/>
      <parameter type-id='type-id-69' name='send' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='861' column='1'/>
      <parameter type-id='type-id-1' name='add_nas_port' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='862' column='1'/>
      <parameter type-id='type-id-72' name='request_type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='862' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-113'/>
    <function-decl name='rc_async_process_handle' mangled-name='rc_async_process_handle' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='796' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_process_handle@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='796' column='1'/>
      <parameter type-id='type-id-113' name='revents' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='796' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_async_get_events' mangled-name='rc_async_get_events' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_get_events@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='227' column='1'/>
      <return type-id='type-id-113'/>
    </function-decl>
    <function-decl name='rc_async_get_fd' mangled-name='rc_async_get_fd' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_get_fd@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='215' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_async_get_socket_type' mangled-name='rc_async_get_socket_type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_get_socket_type@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='203' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='rc_async_get_send_pairs' mangled-name='rc_async_get_send_pairs' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_get_send_pairs@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='191' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='rc_async_get_receive_pairs' mangled-name='rc_async_get_receive_pairs' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_get_receive_pairs@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='191' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='rc_async_get_reply_message' mangled-name='rc_async_get_reply_message' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_get_reply_message@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='163' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='rc_async_get_result' mangled-name='rc_async_get_result' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_get_result@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='215' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_async_is_done' mangled-name='rc_async_is_done' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_is_done@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='215' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_async_destroy_handle' mangled-name='rc_async_destroy_handle' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_async_destroy_handle@@RADCLI_5'>
      <parameter type-id='type-id-112' name='hdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/sendserver_async.c' line='99' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='calloc' mangled-name='calloc' filepath='/usr/include/stdlib.h' line='542' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='free' mangled-name='free' filepath='/usr/include/stdlib.h' line='565' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_copy' mangled-name='rc_avpair_copy' filepath='../include/radcli/radcli.h' line='580' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_buildreq' mangled-name='rc_buildreq' filepath='../include/radcli/radcli.h' line='595' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='fcntl' mangled-name='fcntl' filepath='/usr/include/fcntl.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='getsockopt' mangled-name='getsockopt' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='208' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='avpair.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-114'/>
    <function-decl name='rc_avpair_get_attr' mangled-name='rc_avpair_get_attr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1055' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_attr@@RADCLI_5'>
      <parameter type-id='type-id-69' name='vp' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1055' column='1'/>
      <parameter type-id='type-id-114' name='type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1055' column='1'/>
      <parameter type-id='type-id-114' name='id' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1055' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-115'/>
    <function-decl name='rc_avpair_get_raw' mangled-name='rc_avpair_get_raw' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_raw@@RADCLI_5'>
      <parameter type-id='type-id-69' name='vp' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1035' column='1'/>
      <parameter type-id='type-id-115' name='res' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1035' column='1'/>
      <parameter type-id='type-id-114' name='res_size' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1035' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='in6_addr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='212' column='1' id='type-id-116'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__in6_u' type-id='type-id-117' visibility='default' filepath='/usr/include/netinet/in.h' line='219' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='214' column='1' id='type-id-117'>
      <data-member access='private'>
        <var-decl name='__u6_addr8' type-id='type-id-75' visibility='default' filepath='/usr/include/netinet/in.h' line='216' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__u6_addr16' type-id='type-id-86' visibility='default' filepath='/usr/include/netinet/in.h' line='217' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__u6_addr32' type-id='type-id-118' visibility='default' filepath='/usr/include/netinet/in.h' line='218' column='1'/>
      </data-member>
    </union-decl>

    <array-type-def dimensions='1' type-id='type-id-27' size-in-bits='128' id='type-id-118'>
      <subrange length='4' type-id='type-id-14' id='type-id-119'/>

    </array-type-def>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-120'/>
    <function-decl name='rc_avpair_get_in6' mangled-name='rc_avpair_get_in6' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_in6@@RADCLI_5'>
      <parameter type-id='type-id-69' name='vp' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1003' column='1'/>
      <parameter type-id='type-id-120' name='res' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1003' column='1'/>
      <parameter type-id='type-id-114' name='prefix' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='1003' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-121'/>
    <function-decl name='rc_avpair_get_uint32' mangled-name='rc_avpair_get_uint32' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_uint32@@RADCLI_5'>
      <parameter type-id='type-id-69' name='vp' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='982' column='1'/>
      <parameter type-id='type-id-121' name='res' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='982' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_avpair_log' mangled-name='rc_avpair_log' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_log@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-69' name='pair' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-6' name='buf' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-55' name='buf_len' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='952' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='rc_avpair_tostr' mangled-name='rc_avpair_tostr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_tostr@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-69' name='pair' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-1' name='ln' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-6' name='value' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-1' name='lv' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='831' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_avpair_parse' mangled-name='rc_avpair_parse' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_parse@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='601' column='1'/>
      <parameter type-id='type-id-32' name='buffer' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='601' column='1'/>
      <parameter type-id='type-id-70' name='first_pair' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='601' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_avpair_free' mangled-name='rc_avpair_free' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='537' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_free@@RADCLI_5'>
      <parameter type-id='type-id-69' name='pair' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='537' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_insert' mangled-name='rc_avpair_insert' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_insert@@RADCLI_5'>
      <parameter type-id='type-id-70' name='a' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='485' column='1'/>
      <parameter type-id='type-id-69' name='p' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='485' column='1'/>
      <parameter type-id='type-id-69' name='b' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='485' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_copy' mangled-name='rc_avpair_copy' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_copy@@RADCLI_5'>
      <parameter type-id='type-id-69' name='p' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='450' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='rc_avpair_get' mangled-name='rc_avpair_get' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get@@RADCLI_5'>
      <parameter type-id='type-id-69' name='vp' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='433' column='1'/>
      <parameter type-id='type-id-27' name='attrid' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='433' column='1'/>
      <parameter type-id='type-id-27' name='vendorspec' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='433' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <qualified-type-def type-id='type-id-77' const='yes' id='type-id-122'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
    <function-decl name='rc_avpair_gen' mangled-name='rc_avpair_gen' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_gen@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-69' name='pair' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-123' name='ptr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-1' name='length' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='272' column='1'/>
      <parameter type-id='type-id-27' name='vendorspec' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='272' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='rc_avpair_new' mangled-name='rc_avpair_new' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_new@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-27' name='attrid' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-31' name='pval' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-1' name='len' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-27' name='vendorspec' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='193' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='rc_avpair_assign' mangled-name='rc_avpair_assign' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_assign@@RADCLI_5'>
      <parameter type-id='type-id-69' name='vp' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='135' column='1'/>
      <parameter type-id='type-id-31' name='pval' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='135' column='1'/>
      <parameter type-id='type-id-1' name='len' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='135' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_avpair_next' mangled-name='rc_avpair_next' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_next@@RADCLI_5'>
      <parameter type-id='type-id-69' name='t' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='112' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='rc_avpair_remove' mangled-name='rc_avpair_remove' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_remove@@RADCLI_5'>
      <parameter type-id='type-id-70' name='list' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='69' column='1'/>
      <parameter type-id='type-id-27' name='attrid' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='69' column='1'/>
      <parameter type-id='type-id-27' name='vendorspec' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='69' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_avpair_add' mangled-name='rc_avpair_add' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_add@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-70' name='list' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-27' name='attrid' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-31' name='pval' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-1' name='len' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-27' name='vendorspec' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/avpair.c' line='46' column='1'/>
      <return type-id='type-id-69'/>
    </function-decl>
    <function-decl name='__builtin___sprintf_chk' mangled-name='__sprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___snprintf_chk' mangled-name='__snprintf_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='gmtime_r' mangled-name='gmtime_r' filepath='/usr/include/time.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strftime' mangled-name='strftime' filepath='/usr/include/time.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_dict_getval' mangled-name='rc_dict_getval' filepath='../include/radcli/radcli.h' line='647' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='inet_ntoa' mangled-name='inet_ntoa' filepath='/usr/include/arpa/inet.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' mangled-name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___memmove_chk' mangled-name='__memmove_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='strtol' filepath='/usr/include/stdlib.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='inet_pton' mangled-name='inet_pton' filepath='/usr/include/arpa/inet.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_dict_findattr' mangled-name='rc_dict_findattr' filepath='../include/radcli/radcli.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='time' mangled-name='time' filepath='/usr/include/time.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='localtime_r' mangled-name='localtime_r' filepath='/usr/include/time.h' line='133' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_str2tm' mangled-name='rc_str2tm' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/util.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='mktime' mangled-name='mktime' filepath='/usr/include/time.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strchr' mangled-name='strchr' filepath='/usr/include/string.h' line='226' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_dict_findval' mangled-name='rc_dict_findval' filepath='../include/radcli/radcli.h' line='644' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___asan_handle_no_return' mangled-name='__asan_handle_no_return' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='abort' mangled-name='abort' filepath='/usr/include/stdlib.h' line='591' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin___strcat_chk' mangled-name='__strcat_chk' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_dict_getvend' mangled-name='rc_dict_getvend' filepath='../include/radcli/radcli.h' line='646' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_dict_getattr' mangled-name='rc_dict_getattr' filepath='../include/radcli/radcli.h' line='642' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='config.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <class-decl name='_option' size-in-bits='640' is-struct='yes' visibility='default' filepath='./options.h' line='23' column='1' id='type-id-11'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-124' visibility='default' filepath='./options.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-1' visibility='default' filepath='./options.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='status' type-id='type-id-1' visibility='default' filepath='./options.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='val' type-id='type-id-31' visibility='default' filepath='./options.h' line='26' column='1'/>
      </data-member>
    </class-decl>

    <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='512' id='type-id-124'>
      <subrange length='64' type-id='type-id-14' id='type-id-125'/>

    </array-type-def>
    <function-decl name='rc_get_socket_type' mangled-name='rc_get_socket_type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='1145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_get_socket_type@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='1145' column='1'/>
      <return type-id='type-id-105'/>
    </function-decl>
    <function-decl name='rc_destroy' mangled-name='rc_destroy' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='1124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_destroy@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='1124' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-126'/>
    <function-decl name='rc_find_server_addr' mangled-name='rc_find_server_addr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='909' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_find_server_addr@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='909' column='1'/>
      <parameter type-id='type-id-32' name='server_name' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='909' column='1'/>
      <parameter type-id='type-id-126' name='info' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='910' column='1'/>
      <parameter type-id='type-id-6' name='secret' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='910' column='1'/>
      <parameter type-id='type-id-95' name='type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='910' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_test_config' mangled-name='rc_test_config' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='775' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_test_config@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='775' column='1'/>
      <parameter type-id='type-id-32' name='filename' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='775' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_conf_int' mangled-name='rc_conf_int' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_conf_int@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='744' column='1'/>
      <parameter type-id='type-id-32' name='optname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='744' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_read_config' mangled-name='rc_read_config' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='565' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_config@@RADCLI_5'>
      <parameter type-id='type-id-32' name='filename' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='565' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='rc_apply_config' mangled-name='rc_apply_config' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_apply_config@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='497' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_config_init' mangled-name='rc_config_init' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_config_init@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='349' column='1'/>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='rc_add_config' mangled-name='rc_add_config' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_add_config@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-32' name='option_name' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-32' name='option_val' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-32' name='source' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-1' name='line' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='294' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_conf_str' mangled-name='rc_conf_str' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='705' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_conf_str@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='705' column='1'/>
      <parameter type-id='type-id-32' name='optname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='705' column='1'/>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='rc_conf_srv' mangled-name='rc_conf_srv' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='755' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_conf_srv@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='755' column='1'/>
      <parameter type-id='type-id-32' name='optname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='755' column='1'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='rc_config_free' mangled-name='rc_config_free' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='1059' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_config_free@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='1059' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_new' mangled-name='rc_new' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/config.c' line='1093' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_new@@RADCLI_5'>
      <return type-id='type-id-61'/>
    </function-decl>
    <function-decl name='rc_dict_free' mangled-name='rc_dict_free' filepath='../include/radcli/radcli.h' line='648' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strncmp' mangled-name='strncmp' filepath='/usr/include/string.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='socket' mangled-name='socket' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='bind' mangled-name='bind' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='close' mangled-name='close' filepath='/usr/include/unistd.h' line='353' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__fgets_alias' mangled-name='fgets' filepath='/usr/include/x86_64-linux-gnu/bits/stdio2.h' line='245' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='fopen' mangled-name='fopen' filepath='/usr/include/stdio.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strtok_r' mangled-name='strtok_r' filepath='/usr/include/string.h' line='346' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='fclose' mangled-name='fclose' filepath='/usr/include/stdio.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strdup' mangled-name='strdup' filepath='/usr/include/string.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strcspn' mangled-name='strcspn' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_read_dictionary' mangled-name='rc_read_dictionary' filepath='../include/radcli/radcli.h' line='635' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__recvfrom_alias' mangled-name='recvfrom' filepath='/usr/include/x86_64-linux-gnu/bits/socket2.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='connect' mangled-name='connect' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='sendto' mangled-name='sendto' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='getservbyname' mangled-name='getservbyname' filepath='/usr/include/netdb.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strcmp' mangled-name='strcmp' filepath='/usr/include/string.h' line='137' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='getpid' mangled-name='getpid' filepath='/usr/include/unistd.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='srandom' mangled-name='srandom' filepath='/usr/include/stdlib.h' line='404' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='dict.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <function-decl name='rc_dict_free' mangled-name='rc_dict_free' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_free@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='653' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <typedef-decl name='DICT_VALUE' type-id='type-id-26' filepath='../include/radcli/radcli.h' line='448' column='1' id='type-id-127'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-128'/>
    <function-decl name='rc_dict_getval' mangled-name='rc_dict_getval' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_getval@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='632' column='1'/>
      <parameter type-id='type-id-27' name='value' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='632' column='1'/>
      <parameter type-id='type-id-32' name='attrname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='632' column='1'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <typedef-decl name='DICT_VENDOR' type-id='type-id-29' filepath='../include/radcli/radcli.h' line='455' column='1' id='type-id-129'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-130'/>
    <function-decl name='rc_dict_getvend' mangled-name='rc_dict_getvend' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_getvend@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='615' column='1'/>
      <parameter type-id='type-id-27' name='vendorspec' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='615' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='rc_dict_findvend' mangled-name='rc_dict_findvend' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_findvend@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='599' column='1'/>
      <parameter type-id='type-id-32' name='vendorname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='599' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='rc_dict_findval' mangled-name='rc_dict_findval' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_findval@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='578' column='1'/>
      <parameter type-id='type-id-32' name='valname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='578' column='1'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <typedef-decl name='DICT_ATTR' type-id='type-id-18' filepath='../include/radcli/radcli.h' line='440' column='1' id='type-id-131'/>
    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-132'/>
    <function-decl name='rc_dict_findattr' mangled-name='rc_dict_findattr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_findattr@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='555' column='1'/>
      <parameter type-id='type-id-32' name='attrname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='555' column='1'/>
      <return type-id='type-id-132'/>
    </function-decl>
    <function-decl name='rc_dict_getattr' mangled-name='rc_dict_getattr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='532' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_getattr@@RADCLI_5'>
      <parameter type-id='type-id-97' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='532' column='1'/>
      <parameter type-id='type-id-20' name='attribute' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='532' column='1'/>
      <return type-id='type-id-132'/>
    </function-decl>
    <function-decl name='rc_read_dictionary_from_buffer' mangled-name='rc_read_dictionary_from_buffer' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_dictionary_from_buffer@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='507' column='1'/>
      <parameter type-id='type-id-32' name='buf' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='507' column='1'/>
      <parameter type-id='type-id-55' name='size' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='507' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_dict_addvend' mangled-name='rc_dict_addvend' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addvend@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='122' column='1'/>
      <parameter type-id='type-id-32' name='namestr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='122' column='1'/>
      <parameter type-id='type-id-27' name='vendorspec' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='122' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='rc_dict_addval' mangled-name='rc_dict_addval' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addval@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-32' name='attrstr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-32' name='namestr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-27' name='value' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='81' column='1'/>
      <return type-id='type-id-128'/>
    </function-decl>
    <function-decl name='rc_dict_addattr' mangled-name='rc_dict_addattr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addattr@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-32' name='namestr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-27' name='value' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-1' name='type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-27' name='vendorspec' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='38' column='1'/>
      <return type-id='type-id-132'/>
    </function-decl>
    <function-decl name='rc_read_dictionary' mangled-name='rc_read_dictionary' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_dictionary@@RADCLI_5'>
      <parameter type-id='type-id-61' name='rh' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='472' column='1'/>
      <parameter type-id='type-id-32' name='filename' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/dict.c' line='472' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fmemopen' mangled-name='fmemopen' filepath='/usr/include/stdio.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='__isoc99_sscanf' filepath='/usr/include/stdio.h' line='412' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__builtin_strncpy' mangled-name='strncpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strrchr' mangled-name='strrchr' filepath='/usr/include/string.h' line='253' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='ip_util.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <function-decl name='rc_get_srcaddr' mangled-name='rc_get_srcaddr' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/ip_util.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_get_srcaddr@@RADCLI_5'>
      <parameter type-id='type-id-44' name='lia' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/ip_util.c' line='124' column='1'/>
      <parameter type-id='type-id-51' name='ria' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/ip_util.c' line='124' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_own_hostname' mangled-name='rc_own_hostname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/ip_util.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_own_hostname@@RADCLI_5'>
      <parameter type-id='type-id-6' name='hostname' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/ip_util.c' line='81' column='1'/>
      <parameter type-id='type-id-1' name='len' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/ip_util.c' line='81' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_getport' mangled-name='rc_getport' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/ip_util.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_getport@@RADCLI_5'>
      <parameter type-id='type-id-1' name='type' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/ip_util.c' line='63' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='getsockname' mangled-name='getsockname' filepath='/usr/include/x86_64-linux-gnu/sys/socket.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='uname' mangled-name='uname' filepath='/usr/include/x86_64-linux-gnu/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='getaddrinfo' mangled-name='getaddrinfo' filepath='/usr/include/netdb.h' line='660' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='log.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <function-decl name='rc_openlog' mangled-name='rc_openlog' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/log.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_openlog@@RADCLI_5'>
      <parameter type-id='type-id-32' name='ident' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/log.c' line='36' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_setdebug' mangled-name='rc_setdebug' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/log.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_setdebug@@RADCLI_5'>
      <parameter type-id='type-id-1' name='debug' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/log.c' line='16' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='openlog' mangled-name='openlog' filepath='/usr/include/x86_64-linux-gnu/sys/syslog.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='util.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <function-decl name='rc_mksid' mangled-name='rc_mksid' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/util.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_mksid@@RADCLI_5'>
      <return type-id='type-id-6'/>
    </function-decl>
    <function-decl name='setns' mangled-name='setns' filepath='/usr/include/x86_64-linux-gnu/bits/sched.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__open_alias' mangled-name='open' filepath='/usr/include/x86_64-linux-gnu/bits/fcntl2.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='clock_gettime' mangled-name='clock_gettime' filepath='/usr/include/time.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='rc-md5.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <function-decl name='librad_MD5Init' mangled-name='librad_MD5Init' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/md5.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='librad_MD5Update' mangled-name='librad_MD5Update' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/md5.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='librad_MD5Final' mangled-name='librad_MD5Final' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/md5.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-39'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='aaa_ctx.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <function-decl name='rc_aaa_ctx_free' mangled-name='rc_aaa_ctx_free' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/aaa_ctx.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_free@@RADCLI_5'>
      <parameter type-id='type-id-82' name='ctx' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/aaa_ctx.c' line='62' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_get_vector' mangled-name='rc_aaa_ctx_get_vector' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/aaa_ctx.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_get_vector@@RADCLI_5'>
      <parameter type-id='type-id-82' name='ctx' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/aaa_ctx.c' line='52' column='1'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_get_secret' mangled-name='rc_aaa_ctx_get_secret' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/aaa_ctx.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_get_secret@@RADCLI_5'>
      <parameter type-id='type-id-82' name='ctx' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/aaa_ctx.c' line='41' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='multihandle.c' comp-dir-path='/home/mari/Code/cadami/sw-sync/radcli/lib' language='LANG_C99'>
    <class-decl name='rc_multihandle' size-in-bits='128' is-struct='yes' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='36' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='previous' type-id='type-id-134' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-134' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='37' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_async_handle_list_member' size-in-bits='192' is-struct='yes' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='30' column='1' id='type-id-135'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='previous' type-id='type-id-134' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-134' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='hdl' type-id='type-id-112' visibility='default' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='32' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-136'/>
    <class-decl name='pollfd' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='36' column='1' id='type-id-137'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='events' type-id='type-id-113' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='revents' type-id='type-id-113' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/poll.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-138'/>
    <function-decl name='rc_multi_process_pollfds' mangled-name='rc_multi_process_pollfds' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_multi_process_pollfds@@RADCLI_5'>
      <parameter type-id='type-id-136' name='mhdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='354' column='1'/>
      <parameter type-id='type-id-138' name='pollfds' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='355' column='1'/>
      <parameter type-id='type-id-5' name='pollfds_len' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='355' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='1024' is-struct='yes' is-anonymous='yes' naming-typedef-id='type-id-139' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='59' column='1' id='type-id-140'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__fds_bits' type-id='type-id-141' visibility='default' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='67' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__fd_mask' type-id='type-id-47' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='49' column='1' id='type-id-142'/>

    <array-type-def dimensions='1' type-id='type-id-142' size-in-bits='1024' id='type-id-141'>
      <subrange length='16' type-id='type-id-14' id='type-id-80'/>

    </array-type-def>
    <typedef-decl name='fd_set' type-id='type-id-140' filepath='/usr/include/x86_64-linux-gnu/sys/select.h' line='70' column='1' id='type-id-139'/>
    <pointer-type-def type-id='type-id-139' size-in-bits='64' id='type-id-143'/>
    <function-decl name='rc_multi_process_fd_set' mangled-name='rc_multi_process_fd_set' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_multi_process_fd_set@@RADCLI_5'>
      <parameter type-id='type-id-136' name='mhdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='302' column='1'/>
      <parameter type-id='type-id-143' name='rfd' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='303' column='1'/>
      <parameter type-id='type-id-143' name='wfd' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='303' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_multi_process' mangled-name='rc_multi_process' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_multi_process@@RADCLI_5'>
      <parameter type-id='type-id-136' name='mhdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='277' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_multi_get_pollfds' mangled-name='rc_multi_get_pollfds' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='238' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_multi_get_pollfds@@RADCLI_5'>
      <parameter type-id='type-id-136' name='mhdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='238' column='1'/>
      <parameter type-id='type-id-138' name='pollfds' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='238' column='1'/>
      <parameter type-id='type-id-5' name='pollfds_len' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='239' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_multi_get_fd_set' mangled-name='rc_multi_get_fd_set' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='199' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_multi_get_fd_set@@RADCLI_5'>
      <parameter type-id='type-id-136' name='mhdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='302' column='1'/>
      <parameter type-id='type-id-143' name='rfd' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='303' column='1'/>
      <parameter type-id='type-id-143' name='wfd' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='303' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='rc_multi_remove_next_done' mangled-name='rc_multi_remove_next_done' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='168' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_multi_remove_next_done@@RADCLI_5'>
      <parameter type-id='type-id-136' name='mhdl' filepath='/home/mari/Code/cadami/sw-sync/radcli/lib/multihandle.c' line='168' column='1'/>
