<abi-corpus version='2.4' path='./lib/.libs/libradcli.so' architecture='elf-amd-x86_64' soname='libradcli.so.10'>
  <elf-needed>
    <dependency name='libgnutls.so.30'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rc_aaa' version='RADCLI_10' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx' version='RADCLI_10' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_free' version='RADCLI_10' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_get_secret' version='RADCLI_10' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_get_vector' version='RADCLI_10' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_server' version='RADCLI_10' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='sendto' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='setns' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='setsockopt' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='snprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='socket' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='sprintf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='srandom' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcasecmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcat' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strcspn' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strdup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strerror' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strftime' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlcpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strlen' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncmp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strncpy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strrchr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='strtok_r' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='syslog' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='time' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='uname' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-function-symbols>
  <undefined-elf-variable-symbols>
    <elf-symbol name='_ITM_deregisterTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='_ITM_registerTMCloneTable' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='__gmon_start__' type='no-type' binding='weak-binding' visibility='default-visibility' is-defined='no'/>
    <elf-symbol name='gnutls_free' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='no'/>
  </undefined-elf-variable-symbols>
  <abi-instr address-size='64' path='aaa_ctx.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <function-decl name='rc_aaa_ctx_get_secret' mangled-name='rc_aaa_ctx_get_secret' filepath='/home/nmav/projects/radcli/lib/aaa_ctx.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_get_secret@@RADCLI_10' hash='611e8f70b044ca28'>
      <parameter type-id='type-id-1' name='ctx' filepath='/home/nmav/projects/radcli/lib/aaa_ctx.c' line='41' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_get_vector' mangled-name='rc_aaa_ctx_get_vector' filepath='/home/nmav/projects/radcli/lib/aaa_ctx.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_get_vector@@RADCLI_10' hash='b62f346783d8d97a'>
      <parameter type-id='type-id-1' name='ctx' filepath='/home/nmav/projects/radcli/lib/aaa_ctx.c' line='52' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_free' mangled-name='rc_aaa_ctx_free' filepath='/home/nmav/projects/radcli/lib/aaa_ctx.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_free@@RADCLI_10' hash='b62f346783d8d97a'>
      <parameter type-id='type-id-1' name='ctx' filepath='/home/nmav/projects/radcli/lib/aaa_ctx.c' line='62' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-type size-in-bits='64' hash='7f32ffea222edbe7' id='type-id-5'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='avpair.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <class-decl name='in6_addr' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/netinet/in.h' line='223' column='1' hash='8b501153bb93cbb0' id='type-id-6'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__in6_u' type-id='type-id-7' visibility='default' filepath='/usr/include/netinet/in.h' line='230' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='in_addr' is-struct='yes' visibility='default' size-in-bits='32' filepath='/usr/include/netinet/in.h' line='31' column='1' hash='8335790ae1212c07' id='type-id-8'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_addr' type-id='type-id-9' visibility='default' filepath='/usr/include/netinet/in.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' is-struct='yes' visibility='default' size-in-bits='448' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' hash='831fa813c3806379' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DICT_ATTR' type-id='type-id-13' size-in-bits='768' filepath='../include/radcli/radcli.h' line='439' column='1' id='type-id-14'/>
    <typedef-decl name='DICT_VALUE' type-id='type-id-15' size-in-bits='1152' filepath='../include/radcli/radcli.h' line='447' column='1' id='type-id-16'/>
    <typedef-decl name='DICT_VENDOR' type-id='type-id-17' size-in-bits='640' filepath='../include/radcli/radcli.h' line='454' column='1' id='type-id-18'/>
    <typedef-decl name='__time_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='160' column='1' hash='b119fe0931d2ee10' id='type-id-19'/>
    <typedef-decl name='in_addr_t' type-id='type-id-20' size-in-bits='32' filepath='/usr/include/netinet/in.h' line='30' column='1' hash='e66b43f97c38e87a' id='type-id-9'/>
    <typedef-decl name='time_t' type-id='type-id-19' size-in-bits='64' filepath='/usr/include/bits/types/time_t.h' line='10' column='1' hash='b119fe0931d2ee10' id='type-id-21'/>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='128' hash='54581fe115faa565' id='type-id-22'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-24'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' visibility='default' size-in-bits='128' is-anonymous='yes' filepath='/usr/include/netinet/in.h' line='225' column='1' hash='eec64f0682bee6e8' id='type-id-7'>
      <data-member access='public'>
        <var-decl name='__u6_addr8' type-id='type-id-25' visibility='default' filepath='/usr/include/netinet/in.h' line='227' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__u6_addr16' type-id='type-id-26' visibility='default' filepath='/usr/include/netinet/in.h' line='228' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__u6_addr32' type-id='type-id-22' visibility='default' filepath='/usr/include/netinet/in.h' line='229' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' hash='f937b3f2df1df0ab' id='type-id-27'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' hash='006c1b23d864bf91' id='type-id-28'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' hash='3721edb903ec4d1a' id='type-id-29'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' hash='a93039fe023ed77b' id='type-id-31'/>
    <qualified-type-def type-id='type-id-31' restrict='yes' hash='b04f089b5ae14a6d' id='type-id-32'/>
    <qualified-type-def type-id='type-id-21' const='yes' hash='3d3ed5b21cd59821' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' hash='5933014f14812f40' id='type-id-34'/>
    <qualified-type-def type-id='type-id-34' restrict='yes' hash='ba279bf62b26c900' id='type-id-35'/>
    <qualified-type-def type-id='type-id-10' const='yes' hash='6d30d2c0485b21b8' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' hash='934b82f269d593b3' id='type-id-37'/>
    <qualified-type-def type-id='type-id-38' const='yes' hash='8f60dd2f0b8834b6' id='type-id-39'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' hash='7da4750c0c4a7ea5' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' hash='fd89690d624a6590' id='type-id-41'/>
    <pointer-type-def type-id='type-id-6' size-in-bits='64' hash='c753a701e662d03e' id='type-id-42'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' hash='784a05f2083b5c30' id='type-id-43'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' hash='0450557ac0931bcf' id='type-id-44'/>
    <qualified-type-def type-id='type-id-44' restrict='yes' hash='757fb5c6c05e30f5' id='type-id-45'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' hash='a285db8f38e4ea02' id='type-id-46'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' hash='232fa04f890c2a5a' id='type-id-48'/>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='7f32ffea222edbe7'>
      <return type-id='type-id-4'/>
    </function-decl>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-49'/>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-50'/>
    <function-decl name='rc_avpair_add' mangled-name='rc_avpair_add' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_add@@RADCLI_10' hash='e89e4495a56e81dd'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-52' name='list' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-20' name='attrid' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-3' name='pval' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-20' name='vendorspec' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='46' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_remove' mangled-name='rc_avpair_remove' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_remove@@RADCLI_10' hash='f77a116040d8e031'>
      <parameter type-id='type-id-52' name='list' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='69' column='1'/>
      <parameter type-id='type-id-20' name='attrid' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='69' column='1'/>
      <parameter type-id='type-id-20' name='vendorspec' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='69' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_avpair_next' mangled-name='rc_avpair_next' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_next@@RADCLI_10' hash='452119daab2eac4c'>
      <parameter type-id='type-id-53' name='p' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='450' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_assign' mangled-name='rc_avpair_assign' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_assign@@RADCLI_10' hash='cdddf26064be7c2c'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='135' column='1'/>
      <parameter type-id='type-id-3' name='pval' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='135' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='135' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_avpair_new' mangled-name='rc_avpair_new' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_new@@RADCLI_10' hash='bd8dad0450d8ba6c'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-20' name='attrid' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-3' name='pval' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-20' name='vendorspec' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='193' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_gen' mangled-name='rc_avpair_gen' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_gen@@RADCLI_10' hash='f151ba58f34057b2'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-53' name='pair' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-54' name='ptr' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-11' name='length' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='272' column='1'/>
      <parameter type-id='type-id-20' name='vendorspec' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='272' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_get' mangled-name='rc_avpair_get' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get@@RADCLI_10' hash='a300cfa616e69187'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='433' column='1'/>
      <parameter type-id='type-id-20' name='attrid' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='433' column='1'/>
      <parameter type-id='type-id-20' name='vendorspec' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='433' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_copy' mangled-name='rc_avpair_copy' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_copy@@RADCLI_10' hash='452119daab2eac4c'>
      <parameter type-id='type-id-53' name='p' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='450' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_insert' mangled-name='rc_avpair_insert' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_insert@@RADCLI_10' hash='ff43e876a395514d'>
      <parameter type-id='type-id-52' name='a' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='485' column='1'/>
      <parameter type-id='type-id-53' name='p' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='485' column='1'/>
      <parameter type-id='type-id-53' name='b' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='485' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_avpair_free' mangled-name='rc_avpair_free' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='537' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_free@@RADCLI_10' hash='a635386af7ae3ebb'>
      <parameter type-id='type-id-53' name='pair' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='537' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_avpair_parse' mangled-name='rc_avpair_parse' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_parse@@RADCLI_10' hash='ef52961ee11ac67f'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='601' column='1'/>
      <parameter type-id='type-id-2' name='buffer' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='601' column='1'/>
      <parameter type-id='type-id-52' name='first_pair' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='601' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_avpair_tostr' mangled-name='rc_avpair_tostr' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_tostr@@RADCLI_10' hash='91b85d32d5c9a49d'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-53' name='pair' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-30' name='name' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-11' name='ln' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-30' name='value' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-11' name='lv' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='831' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_avpair_log' mangled-name='rc_avpair_log' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_log@@RADCLI_10' hash='9059a9be3701b246'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-53' name='pair' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-30' name='buf' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-55' name='buf_len' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='952' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='rc_avpair_get_uint32' mangled-name='rc_avpair_get_uint32' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_uint32@@RADCLI_10' hash='3af697f6f27bbe92'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='982' column='1'/>
      <parameter type-id='type-id-46' name='res' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='982' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_avpair_get_in6' mangled-name='rc_avpair_get_in6' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_in6@@RADCLI_10' hash='b48e148031b30d19'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1003' column='1'/>
      <parameter type-id='type-id-42' name='res' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1003' column='1'/>
      <parameter type-id='type-id-48' name='prefix' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1003' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_avpair_get_raw' mangled-name='rc_avpair_get_raw' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_raw@@RADCLI_10' hash='f28c95ee7b0e5443'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1035' column='1'/>
      <parameter type-id='type-id-31' name='res' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1035' column='1'/>
      <parameter type-id='type-id-48' name='res_size' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1035' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_avpair_get_attr' mangled-name='rc_avpair_get_attr' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1055' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_attr@@RADCLI_10' hash='81652d0d54e9c92a'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1055' column='1'/>
      <parameter type-id='type-id-48' name='type' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1055' column='1'/>
      <parameter type-id='type-id-48' name='id' filepath='/home/nmav/projects/radcli/lib/avpair.c' line='1055' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='inet_ntoa' filepath='/usr/include/arpa/inet.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inet_ntoa' hash='02a096d257a5e00d'>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='inet_pton' filepath='/usr/include/arpa/inet.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inet_pton' hash='9cd49665f4987e01'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-50'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='inet_ntop' filepath='/usr/include/arpa/inet.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='inet_ntop' hash='298a733b96c4469e'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-49'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__ctype_b_loc' hash='2d54aef0745cb1f9'>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sprintf' hash='21335fc22233a3a7'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='388' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='snprintf' hash='9e970561a213ee08'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strtol' mangled-name='__isoc23_strtol' filepath='/usr/include/stdlib.h' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_strtol' hash='52efcc9e902b4c3e'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='672' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='malloc' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='calloc' hash='91495cdf6321a116'>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='730' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='abort' hash='7f32ffea222edbe7'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcpy' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='memmove' filepath='/usr/include/string.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memmove' hash='e0055d99adb0e173'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcpy' hash='d2c49d83b30fb50c'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strcat' filepath='/usr/include/string.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcat' hash='d2c49d83b30fb50c'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strchr' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlen' hash='ed7b6a29124427dd'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='strlcpy' filepath='/usr/include/string.h' line='506' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strlcpy' hash='7c851ed6ca3879f9'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='syslog' filepath='/usr/include/sys/syslog.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='syslog' hash='e9ea91a7eab8302c'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='time' hash='dfbf0d86b5e56f45'>
      <parameter type-id='type-id-43'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='mktime' filepath='/usr/include/time.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='mktime' hash='93e83c388da365bd'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strftime' hash='9dcd2db97e14a6fc'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-37'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='gmtime_r' filepath='/usr/include/time.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gmtime_r' hash='738b12e2e9661338'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-44'/>
    </function-decl>
    <function-decl name='localtime_r' filepath='/usr/include/time.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='localtime_r' hash='738b12e2e9661338'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-44'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='buildreq.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' hash='65b2d157027b431a' id='type-id-59'/>
    <array-type-def dimensions='1' type-id='type-id-30' size-in-bits='512' hash='17725a40cdadf2ea' id='type-id-60'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-61'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='944' hash='e78758ef10066232' id='type-id-62'>
      <subrange length='118' lower-bound='0' upper-bound='117' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6f97e773a1e88e39' id='type-id-63'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='112' hash='32c03ac42667596f' id='type-id-64'>
      <subrange length='14' lower-bound='0' upper-bound='13' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='73cf96c2d1f03103' id='type-id-65'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='2032' hash='be3620d24f2d7549' id='type-id-66'>
      <subrange length='254' lower-bound='0' upper-bound='253' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='2294eea025b5f76b' id='type-id-67'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='2056' hash='85a15a68e9db1393' id='type-id-68'>
      <subrange length='257' lower-bound='0' upper-bound='256' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='28db190caf697622' id='type-id-69'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='256' hash='3e9fefcb964ef6b4' id='type-id-70'>
      <subrange length='32' lower-bound='0' upper-bound='31' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='99f823ef025a9d75' id='type-id-71'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='520' hash='5b11e0ff30e6fbfa' id='type-id-72'>
      <subrange length='65' lower-bound='0' upper-bound='64' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='ba3b86918ae00425' id='type-id-73'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' hash='e9e9b320886d9aa6' id='type-id-74'/>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='512' hash='f8859bc464d8cd16' id='type-id-75'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-61'/>
    </array-type-def>
    <enum-decl name='rc_attr_type' size-in-bits='32' alignment-in-bits='32' filepath='../include/radcli/radcli.h' line='115' column='1' hash='d5b96d74a4f35e62' id='type-id-76'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='PW_TYPE_STRING' value='0'/>
      <enumerator name='PW_TYPE_INTEGER' value='1'/>
      <enumerator name='PW_TYPE_IPADDR' value='2'/>
      <enumerator name='PW_TYPE_DATE' value='3'/>
      <enumerator name='PW_TYPE_IPV6ADDR' value='4'/>
      <enumerator name='PW_TYPE_IPV6PREFIX' value='5'/>
      <enumerator name='PW_TYPE_MAX' value='6'/>
    </enum-decl>
    <enum-decl name='rc_standard_codes' size-in-bits='32' alignment-in-bits='32' filepath='../include/radcli/radcli.h' line='127' column='1' hash='e41dfe5328868d85' id='type-id-78'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='PW_ACCESS_REQUEST' value='1'/>
      <enumerator name='PW_ACCESS_ACCEPT' value='2'/>
      <enumerator name='PW_ACCESS_REJECT' value='3'/>
      <enumerator name='PW_ACCOUNTING_REQUEST' value='4'/>
      <enumerator name='PW_ACCOUNTING_RESPONSE' value='5'/>
      <enumerator name='PW_ACCOUNTING_STATUS' value='6'/>
      <enumerator name='PW_PASSWORD_REQUEST' value='7'/>
      <enumerator name='PW_PASSWORD_ACK' value='8'/>
      <enumerator name='PW_PASSWORD_REJECT' value='9'/>
      <enumerator name='PW_ACCOUNTING_MESSAGE' value='10'/>
      <enumerator name='PW_ACCESS_CHALLENGE' value='11'/>
      <enumerator name='PW_STATUS_SERVER' value='12'/>
      <enumerator name='PW_STATUS_CLIENT' value='13'/>
    </enum-decl>
    <enum-decl name='rc_type' size-in-bits='32' alignment-in-bits='32' filepath='../include/radcli/radcli.h' line='69' column='1' hash='27d67a40aa4b9efa' id='type-id-79'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='AUTH' value='0'/>
      <enumerator name='ACCT' value='1'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' hash='09d17c08f594edc7' id='type-id-11'/>
    <type-decl name='long int' size-in-bits='64' hash='b119fe0931d2ee10#2' id='type-id-12'/>
    <class-decl name='dict_attr' is-struct='yes' visibility='default' size-in-bits='768' filepath='../include/radcli/radcli.h' line='433' column='1' hash='e01c5fd639f87215' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-72' visibility='default' filepath='../include/radcli/radcli.h' line='435' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='value' type-id='type-id-80' visibility='default' filepath='../include/radcli/radcli.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='type' type-id='type-id-81' visibility='default' filepath='../include/radcli/radcli.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='next' type-id='type-id-82' visibility='default' filepath='../include/radcli/radcli.h' line='438' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dict_value' is-struct='yes' visibility='default' size-in-bits='1152' filepath='../include/radcli/radcli.h' line='441' column='1' hash='74a2158e844e121a' id='type-id-15'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrname' type-id='type-id-72' visibility='default' filepath='../include/radcli/radcli.h' line='443' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='name' type-id='type-id-72' visibility='default' filepath='../include/radcli/radcli.h' line='444' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='value' type-id='type-id-20' visibility='default' filepath='../include/radcli/radcli.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='next' type-id='type-id-83' visibility='default' filepath='../include/radcli/radcli.h' line='446' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dict_vendor' is-struct='yes' visibility='default' size-in-bits='640' filepath='../include/radcli/radcli.h' line='449' column='1' hash='7d643bf1c351ebed' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vendorname' type-id='type-id-72' visibility='default' filepath='../include/radcli/radcli.h' line='451' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='vendorpec' type-id='type-id-20' visibility='default' filepath='../include/radcli/radcli.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-84' visibility='default' filepath='../include/radcli/radcli.h' line='453' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_aaa_ctx_st' is-struct='yes' visibility='default' size-in-bits='2184' filepath='../include/includes.h' line='214' column='1' hash='68ea9703fcbff041' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret' type-id='type-id-68' visibility='default' filepath='../include/includes.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2056'>
        <var-decl name='request_vector' type-id='type-id-25' visibility='default' filepath='../include/includes.h' line='217' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_conf' is-struct='yes' visibility='default' size-in-bits='3136' filepath='../include/includes.h' line='192' column='1' hash='49880ab9f1e09a29' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='config_options' type-id='type-id-87' visibility='default' filepath='../include/includes.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nas_addr' type-id='type-id-88' visibility='default' filepath='../include/includes.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nas_addr_set' type-id='type-id-47' visibility='default' filepath='../include/includes.h' line='196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='own_bind_addr' type-id='type-id-88' visibility='default' filepath='../include/includes.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='own_bind_addr_set' type-id='type-id-47' visibility='default' filepath='../include/includes.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='first_dict_read' type-id='type-id-30' visibility='default' filepath='../include/includes.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='dictionary_attributes' type-id='type-id-82' visibility='default' filepath='../include/includes.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='dictionary_values' type-id='type-id-83' visibility='default' filepath='../include/includes.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='dictionary_vendors' type-id='type-id-84' visibility='default' filepath='../include/includes.h' line='207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='so' type-id='type-id-89' visibility='default' filepath='../include/includes.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='so_type' type-id='type-id-47' visibility='default' filepath='../include/includes.h' line='210' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_sockets_override' is-struct='yes' visibility='default' size-in-bits='576' filepath='../include/includes.h' line='175' column='1' hash='ef4426f46565aa5d' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-3' visibility='default' filepath='../include/includes.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='static_secret' type-id='type-id-2' visibility='default' filepath='../include/includes.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_fd' type-id='type-id-91' visibility='default' filepath='../include/includes.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='get_active_fd' type-id='type-id-92' visibility='default' filepath='../include/includes.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='close_fd' type-id='type-id-93' visibility='default' filepath='../include/includes.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='sendto' type-id='type-id-94' visibility='default' filepath='../include/includes.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='recvfrom' type-id='type-id-95' visibility='default' filepath='../include/includes.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='lock' type-id='type-id-92' visibility='default' filepath='../include/includes.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='unlock' type-id='type-id-92' visibility='default' filepath='../include/includes.h' line='189' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_value_pair' is-struct='yes' visibility='default' size-in-bits='3072' filepath='../include/radcli/radcli.h' line='478' column='1' hash='20c4c7a71c281e48' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-72' visibility='default' filepath='../include/radcli/radcli.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='attribute' type-id='type-id-80' visibility='default' filepath='../include/radcli/radcli.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='type' type-id='type-id-81' visibility='default' filepath='../include/radcli/radcli.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='672'>
        <var-decl name='lvalue' type-id='type-id-20' visibility='default' filepath='../include/radcli/radcli.h' line='483' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='strvalue' type-id='type-id-66' visibility='default' filepath='../include/radcli/radcli.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='next' type-id='type-id-97' visibility='default' filepath='../include/radcli/radcli.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='pad' type-id='type-id-70' visibility='default' filepath='../include/radcli/radcli.h' line='486' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='send_data' is-struct='yes' visibility='default' size-in-bits='448' filepath='../include/radcli/radcli.h' line='489' column='1' hash='ed01b9ce36055e2c' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='code' type-id='type-id-99' visibility='default' filepath='../include/radcli/radcli.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='seq_nbr' type-id='type-id-99' visibility='default' filepath='../include/radcli/radcli.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='server' type-id='type-id-30' visibility='default' filepath='../include/radcli/radcli.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='svc_port' type-id='type-id-11' visibility='default' filepath='../include/radcli/radcli.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='secret' type-id='type-id-30' visibility='default' filepath='../include/radcli/radcli.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timeout' type-id='type-id-11' visibility='default' filepath='../include/radcli/radcli.h' line='496' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='retries' type-id='type-id-11' visibility='default' filepath='../include/radcli/radcli.h' line='497' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_pairs' type-id='type-id-53' visibility='default' filepath='../include/radcli/radcli.h' line='498' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='receive_pairs' type-id='type-id-53' visibility='default' filepath='../include/radcli/radcli.h' line='499' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='server' is-struct='yes' visibility='default' size-in-bits='1728' filepath='../include/radcli/radcli.h' line='90' column='1' hash='a17cce6752d91333' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max' type-id='type-id-11' visibility='default' filepath='../include/radcli/radcli.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-60' visibility='default' filepath='../include/radcli/radcli.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='port' type-id='type-id-26' visibility='default' filepath='../include/radcli/radcli.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='secret' type-id='type-id-60' visibility='default' filepath='../include/radcli/radcli.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='deadtime_ends' type-id='type-id-75' visibility='default' filepath='../include/radcli/radcli.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/socket.h' line='184' column='1' hash='17b889f8dd08e00f' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='type-id-102' visibility='default' filepath='/usr/include/bits/socket.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/socket.h' line='187' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' is-struct='yes' visibility='default' size-in-bits='1024' filepath='/usr/include/bits/socket.h' line='197' column='1' hash='3ad3c646386e818d' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-102' visibility='default' filepath='/usr/include/bits/socket.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='type-id-62' visibility='default' filepath='/usr/include/bits/socket.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='type-id-23' visibility='default' filepath='/usr/include/bits/socket.h' line='201' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='RC_AAA_CTX' type-id='type-id-85' size-in-bits='2184' filepath='../include/radcli/radcli.h' line='505' column='1' id='type-id-103'/>
    <typedef-decl name='SEND_DATA' type-id='type-id-98' size-in-bits='448' filepath='../include/radcli/radcli.h' line='500' column='1' id='type-id-104'/>
    <typedef-decl name='SERVER' type-id='type-id-100' size-in-bits='1728' filepath='../include/radcli/radcli.h' line='96' column='1' id='type-id-105'/>
    <typedef-decl name='VALUE_PAIR' type-id='type-id-96' size-in-bits='3072' filepath='../include/radcli/radcli.h' line='487' column='1' id='type-id-106'/>
    <typedef-decl name='__socklen_t' type-id='type-id-47' size-in-bits='32' filepath='/usr/include/bits/types.h' line='210' column='1' hash='e66b43f97c38e87a' id='type-id-107'/>
    <typedef-decl name='__ssize_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='194' column='1' hash='b119fe0931d2ee10' id='type-id-108'/>
    <typedef-decl name='__uint16_t' type-id='type-id-38' size-in-bits='16' filepath='/usr/include/bits/types.h' line='40' column='1' hash='d7723bb93a30b11d' id='type-id-109'/>
    <typedef-decl name='__uint32_t' type-id='type-id-47' size-in-bits='32' filepath='/usr/include/bits/types.h' line='42' column='1' hash='e66b43f97c38e87a' id='type-id-110'/>
    <typedef-decl name='__uint64_t' type-id='type-id-23' size-in-bits='64' filepath='/usr/include/bits/types.h' line='45' column='1' hash='8fdc5eea2983a729' id='type-id-111'/>
    <typedef-decl name='__uint8_t' type-id='type-id-112' size-in-bits='8' filepath='/usr/include/bits/types.h' line='38' column='1' hash='6ebac62b3366db68' id='type-id-113'/>
    <typedef-decl name='rc_attr_type' type-id='type-id-76' size-in-bits='32' alignment-in-bits='32' filepath='../include/radcli/radcli.h' line='123' column='1' hash='d5b96d74a4f35e62' id='type-id-81'/>
    <typedef-decl name='rc_handle' type-id='type-id-86' size-in-bits='3136' filepath='../include/radcli/radcli.h' line='84' column='1' id='type-id-114'/>
    <typedef-decl name='rc_sockets_override' type-id='type-id-90' size-in-bits='576' filepath='../include/includes.h' line='190' column='1' id='type-id-89'/>
    <typedef-decl name='rc_standard_codes' type-id='type-id-78' size-in-bits='32' alignment-in-bits='32' filepath='../include/radcli/radcli.h' line='141' column='1' hash='e41dfe5328868d85' id='type-id-115'/>
    <typedef-decl name='rc_type' type-id='type-id-79' size-in-bits='32' alignment-in-bits='32' filepath='../include/radcli/radcli.h' line='72' column='1' hash='27d67a40aa4b9efa' id='type-id-116'/>
    <typedef-decl name='sa_family_t' type-id='type-id-38' size-in-bits='16' filepath='/usr/include/bits/sockaddr.h' line='28' column='1' hash='d7723bb93a30b11d' id='type-id-102'/>
    <typedef-decl name='size_t' type-id='type-id-23' size-in-bits='64' filepath='/usr/lib/gcc/x86_64-redhat-linux/15/include/stddef.h' line='229' column='1' hash='8fdc5eea2983a729' id='type-id-55'/>
    <typedef-decl name='socklen_t' type-id='type-id-107' size-in-bits='32' filepath='/usr/include/bits/socket.h' line='33' column='1' hash='e66b43f97c38e87a' id='type-id-58'/>
    <typedef-decl name='ssize_t' type-id='type-id-108' size-in-bits='64' filepath='/usr/include/sys/types.h' line='108' column='1' hash='b119fe0931d2ee10' id='type-id-117'/>
    <typedef-decl name='uint16_t' type-id='type-id-109' size-in-bits='16' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' hash='d7723bb93a30b11d' id='type-id-118'/>
    <typedef-decl name='uint32_t' type-id='type-id-110' size-in-bits='32' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' hash='e66b43f97c38e87a' id='type-id-20'/>
    <typedef-decl name='uint64_t' type-id='type-id-111' size-in-bits='64' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' hash='8fdc5eea2983a729' id='type-id-80'/>
    <typedef-decl name='uint8_t' type-id='type-id-113' size-in-bits='8' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' hash='6ebac62b3366db68' id='type-id-99'/>
    <array-type-def dimensions='1' type-id='type-id-118' size-in-bits='128' hash='d0221bf58f875ebc' id='type-id-26'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-61'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-99' size-in-bits='128' hash='d62d8a2ca2ec1fdd' id='type-id-25'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6c35b1e999eba398' id='type-id-119'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' size-in-bits='32' alignment-in-bits='32' is-anonymous='yes' hash='5181a58e665b3619' id='type-id-77'/>
    <type-decl name='unsigned char' size-in-bits='8' hash='6ebac62b3366db68' id='type-id-112'/>
    <type-decl name='unsigned int' size-in-bits='32' hash='e66b43f97c38e87a' id='type-id-47'/>
    <type-decl name='unsigned long int' size-in-bits='64' hash='8fdc5eea2983a729#2' id='type-id-23'/>
    <type-decl name='unsigned short int' size-in-bits='16' hash='d7723bb93a30b11d#3' id='type-id-38'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' hash='ce055b25bf0be5cf' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' hash='d7d9bbd7d3134ae1' id='type-id-120'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' hash='739355674780da1e' id='type-id-121'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' hash='2e744b4b1d09a8f2' id='type-id-122'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' hash='eed61a66dba9a1e6' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' hash='ef8f0265d7072f6c' id='type-id-52'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' hash='75a04f33739ae2c8' id='type-id-87'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' hash='e533f42d1dd4942c' id='type-id-30'/>
    <qualified-type-def type-id='type-id-59' const='yes' hash='3e50fd33f9bb78d9' id='type-id-124'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' hash='c44743f354f6a443' id='type-id-2'/>
    <qualified-type-def type-id='type-id-114' const='yes' hash='3a197ba29190c28a' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' hash='cbc1af01423fb43d' id='type-id-51'/>
    <qualified-type-def type-id='type-id-101' const='yes' hash='2d422cca3ed5844e' id='type-id-126'/>
    <pointer-type-def type-id='type-id-126' size-in-bits='64' hash='ef2a95c645ed5947' id='type-id-127'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' hash='df0c765c2905a570' id='type-id-82'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' hash='6e5d55c41a828f01' id='type-id-83'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' hash='e73daab1bbc90a01' id='type-id-84'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-92'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-91'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' hash='8e4c24db84c22673' id='type-id-130'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' hash='3b470972e064f0e8' id='type-id-97'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' hash='b051efca9beefff0' id='type-id-131'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' hash='3e6cb5670d087c61' id='type-id-132'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-94'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-95'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-93'/>
    <class-decl name='_option' is-struct='yes' visibility='default' size-in-bits='640' filepath='./options.h' line='23' column='1' hash='6d4447ec3a3c7677' id='type-id-123'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-136' visibility='default' filepath='./options.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-11' visibility='default' filepath='./options.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='status' type-id='type-id-11' visibility='default' filepath='./options.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='val' type-id='type-id-3' visibility='default' filepath='./options.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <function-decl name='rc_buildreq' mangled-name='rc_buildreq' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_buildreq@@RADCLI_10' hash='7cfd40833daf367f'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-121' name='data' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-11' name='code' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-30' name='server' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-38' name='port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-30' name='secret' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-11' name='timeout' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-11' name='retries' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='42' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx' mangled-name='rc_aaa_ctx' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx@@RADCLI_10' hash='1340f48c31fa6120'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-120' name='ctx' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-20' name='nas_port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-30' name='msg' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-11' name='add_nas_port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='72' column='1'/>
      <parameter type-id='type-id-115' name='request_type' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='72' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_server' mangled-name='rc_aaa_ctx_server' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_server@@RADCLI_10' hash='263fed8cea076c4f'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-120' name='ctx' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-122' name='aaaserver' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-116' name='type' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='112' column='1'/>
      <parameter type-id='type-id-20' name='nas_port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='113' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='114' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='114' column='1'/>
      <parameter type-id='type-id-30' name='msg' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='115' column='1'/>
      <parameter type-id='type-id-11' name='add_nas_port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='115' column='1'/>
      <parameter type-id='type-id-115' name='request_type' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='116' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_aaa' mangled-name='rc_aaa' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa@@RADCLI_10' hash='0bd54b12dc7fab85'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-20' name='nas_port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-30' name='msg' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-11' name='add_nas_port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-115' name='request_type' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='217' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_auth' mangled-name='rc_auth' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_auth@@RADCLI_10' hash='b653c9a88b550ab8'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-20' name='nas_port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='236' column='1'/>
      <parameter type-id='type-id-30' name='msg' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='236' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_auth_proxy' mangled-name='rc_auth_proxy' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_auth_proxy@@RADCLI_10' hash='fa41cd0d1cfcedb5'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-30' name='msg' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='258' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_acct' mangled-name='rc_acct' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_acct@@RADCLI_10' hash='43c292fd0273b7a9'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='274' column='1'/>
      <parameter type-id='type-id-20' name='nas_port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='274' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='274' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_acct_proxy' mangled-name='rc_acct_proxy' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_acct_proxy@@RADCLI_10' hash='512e428547b00817'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='287' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='287' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_check' mangled-name='rc_check' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_check@@RADCLI_10' hash='b1df0502a05212bb'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-30' name='host' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-30' name='secret' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-38' name='port' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-30' name='msg' filepath='/home/nmav/projects/radcli/lib/buildreq.c' line='304' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='random' filepath='/usr/include/stdlib.h' line='521' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='random' hash='52c0efb08d2aa513'>
      <return type-id='type-id-12'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-137'/>
    <type-decl name='void' id='type-id-4'/>
    <pointer-type-def type-id='type-id-4' id='type-id-3'/>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-128'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' hash='ab9ab7e640e35e69' id='type-id-129'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-11'/>
    </function-type>
    <function-type size-in-bits='64' hash='73f2469f9f45339a' id='type-id-133'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-117'/>
    </function-type>
    <function-type size-in-bits='64' hash='e8518666fa663741' id='type-id-134'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-131'/>
      <parameter type-id='type-id-132'/>
      <return type-id='type-id-117'/>
    </function-type>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-135'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='config.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='8' hash='f7aed1c6cc6e7b3c' id='type-id-138'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='eba0a2b392137dcb' id='type-id-139'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='512' hash='ea93b43678875247' id='type-id-136'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-140'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='64' hash='e1c8b625c73024c4' id='type-id-141'>
      <subrange length='8' lower-bound='0' upper-bound='7' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6e87a8ff484907ad' id='type-id-61'/>
    </array-type-def>
    <enum-decl name='rc_socket_type' size-in-bits='32' alignment-in-bits='32' filepath='../include/radcli/radcli.h' line='100' column='1' hash='3abaa96b612ae129' id='type-id-142'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='RC_SOCKET_UDP' value='0'/>
      <enumerator name='RC_SOCKET_TLS' value='1'/>
      <enumerator name='RC_SOCKET_DTLS' value='2'/>
      <enumerator name='RC_SOCKET_TCP' value='3'/>
    </enum-decl>
    <type-decl name='signed char' size-in-bits='8' hash='3c595c3350588f18' id='type-id-143'/>
    <class-decl name='_IO_FILE' is-struct='yes' visibility='default' size-in-bits='1728' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1' hash='dedab36ee0ea6582' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-30' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-145' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-146' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='952'>
        <var-decl name='_short_backupbuf' type-id='type-id-138' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-147' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-143' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-138' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-148' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-149' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-150' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-151' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-146' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='_prevchain' type-id='type-id-152' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused3' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='_total_written' type-id='type-id-111' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='_unused2' type-id='type-id-141' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='109' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='servent' is-struct='yes' visibility='default' size-in-bits='256' filepath='/usr/include/netdb.h' line='255' column='1' hash='61648539907639d9' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_name' type-id='type-id-30' visibility='default' filepath='/usr/include/netdb.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_aliases' type-id='type-id-31' visibility='default' filepath='/usr/include/netdb.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_port' type-id='type-id-11' visibility='default' filepath='/usr/include/netdb.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='s_proto' type-id='type-id-30' visibility='default' filepath='/usr/include/netdb.h' line='260' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-144' size-in-bits='1728' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-154'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' filepath='/usr/include/bits/types/struct_FILE.h' line='45' column='1' id='type-id-155'/>
    <typedef-decl name='__off64_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='153' column='1' hash='b119fe0931d2ee10' id='type-id-149'/>
    <typedef-decl name='__off_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='152' column='1' hash='b119fe0931d2ee10' id='type-id-147'/>
    <typedef-decl name='__pid_t' type-id='type-id-11' size-in-bits='32' filepath='/usr/include/bits/types.h' line='154' column='1' hash='09d17c08f594edc7' id='type-id-156'/>
    <typedef-decl name='rc_socket_type' type-id='type-id-142' size-in-bits='32' alignment-in-bits='32' filepath='../include/radcli/radcli.h' line='105' column='1' hash='3abaa96b612ae129' id='type-id-157'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' hash='4cdc26b379a5c62d' id='type-id-158'/>
    <qualified-type-def type-id='type-id-158' restrict='yes' hash='6a2cf982d0fba87f' id='type-id-159'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' hash='071f36dcbe00ad00' id='type-id-146'/>
    <pointer-type-def type-id='type-id-146' size-in-bits='64' hash='e8c018048121152c' id='type-id-152'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' hash='cd7c54cc1a101652' id='type-id-160'/>
    <qualified-type-def type-id='type-id-131' restrict='yes' hash='94957dbcf9ff8392' id='type-id-161'/>
    <qualified-type-def type-id='type-id-132' restrict='yes' hash='a826ca4896eac1a9' id='type-id-162'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-155' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-151'/>
    <function-decl name='__builtin_memcmp' mangled-name='memcmp' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='7f32ffea222edbe7'>
      <return type-id='type-id-4'/>
    </function-decl>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-163'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-164'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-165'/>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-166'/>
    <function-decl name='rc_add_config' mangled-name='rc_add_config' filepath='/home/nmav/projects/radcli/lib/config.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_add_config@@RADCLI_10' hash='9555b6198352d410'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-2' name='option_name' filepath='/home/nmav/projects/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-2' name='option_val' filepath='/home/nmav/projects/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-2' name='source' filepath='/home/nmav/projects/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-11' name='line' filepath='/home/nmav/projects/radcli/lib/config.c' line='294' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_config_init' mangled-name='rc_config_init' filepath='/home/nmav/projects/radcli/lib/config.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_config_init@@RADCLI_10' hash='301447e85753c583'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/config.c' line='349' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='rc_apply_config' mangled-name='rc_apply_config' filepath='/home/nmav/projects/radcli/lib/config.c' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_apply_config@@RADCLI_10' hash='b6704dc70a55ac3c'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/config.c' line='500' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_read_config' mangled-name='rc_read_config' filepath='/home/nmav/projects/radcli/lib/config.c' line='568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_config@@RADCLI_10' hash='f1bd4031c3a977ce'>
      <parameter type-id='type-id-2' name='filename' filepath='/home/nmav/projects/radcli/lib/config.c' line='568' column='1'/>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='rc_conf_str' mangled-name='rc_conf_str' filepath='/home/nmav/projects/radcli/lib/config.c' line='708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_conf_str@@RADCLI_10' hash='57390266c6026cfb'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/config.c' line='708' column='1'/>
      <parameter type-id='type-id-2' name='optname' filepath='/home/nmav/projects/radcli/lib/config.c' line='708' column='1'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='rc_conf_int' mangled-name='rc_conf_int' filepath='/home/nmav/projects/radcli/lib/config.c' line='747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_conf_int@@RADCLI_10' hash='1b4b3bdd6142682c'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_conf_srv' mangled-name='rc_conf_srv' filepath='/home/nmav/projects/radcli/lib/config.c' line='758' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_conf_srv@@RADCLI_10' hash='222e9258b4d6fde1'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-122'/>
    </function-decl>
    <function-decl name='rc_test_config' mangled-name='rc_test_config' filepath='/home/nmav/projects/radcli/lib/config.c' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_test_config@@RADCLI_10' hash='b8839c8a7cbb371f'>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_find_server_addr' mangled-name='rc_find_server_addr' filepath='/home/nmav/projects/radcli/lib/config.c' line='912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_find_server_addr@@RADCLI_10' hash='45aa6cd92a689c8d'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/config.c' line='912' column='1'/>
      <parameter type-id='type-id-2' name='server_name' filepath='/home/nmav/projects/radcli/lib/config.c' line='912' column='1'/>
      <parameter type-id='type-id-167' name='info' filepath='/home/nmav/projects/radcli/lib/config.c' line='913' column='1'/>
      <parameter type-id='type-id-30' name='secret' filepath='/home/nmav/projects/radcli/lib/config.c' line='913' column='1'/>
      <parameter type-id='type-id-116' name='type' filepath='/home/nmav/projects/radcli/lib/config.c' line='913' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_config_free' mangled-name='rc_config_free' filepath='/home/nmav/projects/radcli/lib/config.c' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_config_free@@RADCLI_10' hash='353ae88bca3393cc'>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_new' mangled-name='rc_new' filepath='/home/nmav/projects/radcli/lib/config.c' line='1096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_new@@RADCLI_10' hash='353ae88bca3393cc'>
      <return type-id='type-id-130'/>
    </function-decl>
    <function-decl name='rc_destroy' mangled-name='rc_destroy' filepath='/home/nmav/projects/radcli/lib/config.c' line='1127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_destroy@@RADCLI_10' hash='353ae88bca3393cc'>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_get_socket_type' mangled-name='rc_get_socket_type' filepath='/home/nmav/projects/radcli/lib/config.c' line='1151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_get_socket_type@@RADCLI_10' hash='6854e817773e3e1d'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/config.c' line='1151' column='1'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__errno_location' hash='c0e4f5f42afc96e0'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='getservbyname' filepath='/usr/include/netdb.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getservbyname' hash='778416737a95e66b'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-160'/>
    </function-decl>
    <function-decl name='freeaddrinfo' filepath='/usr/include/netdb.h' line='666' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='freeaddrinfo' hash='45195f0dcc39c25a'>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fclose' hash='5ac3795bb1331787'>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fopen' filepath='/usr/include/stdio.h' line='267' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fopen' hash='6347265fef1b547c'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='654' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fgets' hash='fd5632ef4c98da5a'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-159'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='srandom' filepath='/usr/include/stdlib.h' line='524' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='srandom' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='memcmp' hash='b6a97d07f8261bc0'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncmp' hash='2f99ec08ee54ebb4'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strdup' hash='bac6a89264ba699c'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strcspn' filepath='/usr/include/string.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcspn' hash='70d41fbc12e2dbd9'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='strtok_r' filepath='/usr/include/string.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strtok_r' hash='6b6e39e1a51c0d16'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strerror' hash='64137bddd2d8bd37'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strcasecmp' filepath='/usr/include/strings.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strcasecmp' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='socket' filepath='/usr/include/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='socket' hash='a3e40634f2a60824'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='bind' filepath='/usr/include/sys/socket.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='bind' hash='172b8ca998e4258f'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='connect' filepath='/usr/include/sys/socket.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='connect' hash='172b8ca998e4258f'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='sendto' filepath='/usr/include/sys/socket.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='sendto' hash='73f2469f9f45339a'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-127'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='recvfrom' filepath='/usr/include/sys/socket.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='recvfrom' hash='594a6e983386cc1c'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-166'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-162'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='close' hash='d628501fd2223339'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getpid' hash='388da3fa973fde78'>
      <return type-id='type-id-156'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dict.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <function-decl name='rc_dict_addattr' mangled-name='rc_dict_addattr' filepath='/home/nmav/projects/radcli/lib/dict.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addattr@@RADCLI_10' hash='aebba32c43b3c554'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-2' name='namestr' filepath='/home/nmav/projects/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-20' name='value' filepath='/home/nmav/projects/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-11' name='type' filepath='/home/nmav/projects/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-20' name='vendorspec' filepath='/home/nmav/projects/radcli/lib/dict.c' line='38' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='rc_dict_addval' mangled-name='rc_dict_addval' filepath='/home/nmav/projects/radcli/lib/dict.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addval@@RADCLI_10' hash='521342721a7fc551'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-2' name='attrstr' filepath='/home/nmav/projects/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-2' name='namestr' filepath='/home/nmav/projects/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-20' name='value' filepath='/home/nmav/projects/radcli/lib/dict.c' line='81' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='rc_dict_addvend' mangled-name='rc_dict_addvend' filepath='/home/nmav/projects/radcli/lib/dict.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addvend@@RADCLI_10' hash='35cda895f5678ce2'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/dict.c' line='122' column='1'/>
      <parameter type-id='type-id-2' name='namestr' filepath='/home/nmav/projects/radcli/lib/dict.c' line='122' column='1'/>
      <parameter type-id='type-id-20' name='vendorspec' filepath='/home/nmav/projects/radcli/lib/dict.c' line='122' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='rc_read_dictionary' mangled-name='rc_read_dictionary' filepath='/home/nmav/projects/radcli/lib/dict.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_dictionary@@RADCLI_10' hash='b8839c8a7cbb371f'>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_read_dictionary_from_buffer' mangled-name='rc_read_dictionary_from_buffer' filepath='/home/nmav/projects/radcli/lib/dict.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_dictionary_from_buffer@@RADCLI_10' hash='3d29dfbe20b2165a'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/dict.c' line='507' column='1'/>
      <parameter type-id='type-id-2' name='buf' filepath='/home/nmav/projects/radcli/lib/dict.c' line='507' column='1'/>
      <parameter type-id='type-id-55' name='size' filepath='/home/nmav/projects/radcli/lib/dict.c' line='507' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_dict_getattr' mangled-name='rc_dict_getattr' filepath='/home/nmav/projects/radcli/lib/dict.c' line='532' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_getattr@@RADCLI_10' hash='9e8ae7c8fe5cb1c6'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-80'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='rc_dict_findattr' mangled-name='rc_dict_findattr' filepath='/home/nmav/projects/radcli/lib/dict.c' line='555' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_findattr@@RADCLI_10' hash='de576606dd7cea23'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='rc_dict_findval' mangled-name='rc_dict_findval' filepath='/home/nmav/projects/radcli/lib/dict.c' line='578' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_findval@@RADCLI_10' hash='1d13568d91239b15'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='rc_dict_findvend' mangled-name='rc_dict_findvend' filepath='/home/nmav/projects/radcli/lib/dict.c' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_findvend@@RADCLI_10' hash='6104406fdd298785'>
      <parameter type-id='type-id-51' name='rh' filepath='/home/nmav/projects/radcli/lib/dict.c' line='599' column='1'/>
      <parameter type-id='type-id-2' name='vendorname' filepath='/home/nmav/projects/radcli/lib/dict.c' line='599' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='rc_dict_getvend' mangled-name='rc_dict_getvend' filepath='/home/nmav/projects/radcli/lib/dict.c' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_getvend@@RADCLI_10' hash='cd50171e355bc71d'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-20'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='rc_dict_getval' mangled-name='rc_dict_getval' filepath='/home/nmav/projects/radcli/lib/dict.c' line='632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_getval@@RADCLI_10' hash='a3db79373c3c61b8'>
      <parameter type-id='type-id-51'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='rc_dict_free' mangled-name='rc_dict_free' filepath='/home/nmav/projects/radcli/lib/dict.c' line='653' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_free@@RADCLI_10' hash='353ae88bca3393cc'>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fmemopen' filepath='/usr/include/stdio.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fmemopen' hash='cebfb10aecb7bdc2'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='sscanf' mangled-name='__isoc23_sscanf' filepath='/usr/include/stdio.h' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__isoc23_sscanf' hash='5f03b5b551b5a51f'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strncpy' hash='2da84c559242300d'>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-23'/>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='strrchr' hash='1b0d39e45ce45198'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-30'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ip_util.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <class-decl name='utsname' is-struct='yes' visibility='default' size-in-bits='3120' filepath='/usr/include/sys/utsname.h' line='48' column='1' hash='9f1102b5a8c5187c' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='type-id-72' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='type-id-72' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='type-id-72' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='type-id-72' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='type-id-72' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='__domainname' type-id='type-id-72' visibility='default' filepath='/usr/include/sys/utsname.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-167' restrict='yes' hash='fc840d18d5f75cdd' id='type-id-171'/>
    <qualified-type-def type-id='type-id-172' const='yes' hash='4400c446ed8ca1e0' id='type-id-173'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' hash='d494314dd05a39c9' id='type-id-174'/>
    <qualified-type-def type-id='type-id-174' restrict='yes' hash='58de7f06ef5ba183' id='type-id-175'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' hash='907e6270359c7eb6' id='type-id-176'/>
    <function-decl name='rc_getport' mangled-name='rc_getport' filepath='/home/nmav/projects/radcli/lib/ip_util.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_getport@@RADCLI_10' hash='5ad99fba7754b0cc'>
      <parameter type-id='type-id-11' name='type' filepath='/home/nmav/projects/radcli/lib/ip_util.c' line='63' column='1'/>
      <return type-id='type-id-38'/>
    </function-decl>
    <function-decl name='rc_own_hostname' mangled-name='rc_own_hostname' filepath='/home/nmav/projects/radcli/lib/ip_util.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_own_hostname@@RADCLI_10' hash='8487c9d489875495'>
      <parameter type-id='type-id-30' name='hostname' filepath='/home/nmav/projects/radcli/lib/ip_util.c' line='81' column='1'/>
      <parameter type-id='type-id-11' name='len' filepath='/home/nmav/projects/radcli/lib/ip_util.c' line='81' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_get_srcaddr' mangled-name='rc_get_srcaddr' filepath='/home/nmav/projects/radcli/lib/ip_util.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_get_srcaddr@@RADCLI_10' hash='c9310d0363e1e118'>
      <parameter type-id='type-id-131' name='lia' filepath='/home/nmav/projects/radcli/lib/ip_util.c' line='124' column='1'/>
      <parameter type-id='type-id-127' name='ria' filepath='/home/nmav/projects/radcli/lib/ip_util.c' line='124' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getaddrinfo' filepath='/usr/include/netdb.h' line='660' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getaddrinfo' hash='cead3b60de2556b6'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-175'/>
      <parameter type-id='type-id-171'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getsockname' filepath='/usr/include/sys/socket.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getsockname' hash='99769d94e1bfc3a4'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-162'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='uname' hash='5024d1665fd35374'>
      <parameter type-id='type-id-176'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='log.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <function-decl name='rc_setdebug' mangled-name='rc_setdebug' filepath='/home/nmav/projects/radcli/lib/log.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_setdebug@@RADCLI_10' hash='388da3fa973fde78'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_openlog' mangled-name='rc_openlog' filepath='/home/nmav/projects/radcli/lib/log.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_openlog@@RADCLI_10' hash='53885bde0aa65efe'>
      <parameter type-id='type-id-2' name='ident' filepath='/home/nmav/projects/radcli/lib/log.c' line='36' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='openlog' filepath='/usr/include/sys/syslog.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='openlog' hash='9e3d92cc5a49119c'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nettle-hmac.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <class-decl name='hmac_md5_ctx' is-struct='yes' visibility='default' size-in-bits='2304' filepath='/usr/include/nettle/hmac.h' line='121' column='1' hash='c08cb3e8286eb57f' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='outer' type-id='type-id-178' visibility='default' filepath='/usr/include/nettle/hmac.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='inner' type-id='type-id-178' visibility='default' filepath='/usr/include/nettle/hmac.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='state' type-id='type-id-178' visibility='default' filepath='/usr/include/nettle/hmac.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-99' const='yes' hash='5a6582fbecdbfc78' id='type-id-179'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' hash='d2a42ec7d4838233' id='type-id-180'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' hash='d30a3ae29d7dde0e' id='type-id-181'/>
    <function-decl name='nettle_hmac_md5_set_key' filepath='/usr/include/nettle/hmac.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_hmac_md5_set_key@@NETTLE_8' hash='3490f0c318b46f98'>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nettle_hmac_md5_update' filepath='/usr/include/nettle/hmac.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_hmac_md5_update@@NETTLE_8' hash='3490f0c318b46f98'>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-180'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nettle_hmac_md5_digest' filepath='/usr/include/nettle/hmac.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_hmac_md5_digest@@NETTLE_8' hash='4135c4456297f21f'>
      <parameter type-id='type-id-181'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-182'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='rc-md5.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <class-decl name='md5_ctx' is-struct='yes' visibility='default' size-in-bits='768' filepath='/usr/include/nettle/md5.h' line='57' column='1' hash='9e034aee31139eed' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-22' visibility='default' filepath='/usr/include/nettle/md5.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='count' type-id='type-id-80' visibility='default' filepath='/usr/include/nettle/md5.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='index' type-id='type-id-47' visibility='default' filepath='/usr/include/nettle/md5.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='block' type-id='type-id-183' visibility='default' filepath='/usr/include/nettle/md5.h' line='62' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='MD5_CTX' type-id='type-id-178' size-in-bits='768' filepath='/usr/include/nettle/md5-compat.h' line='48' column='1' id='type-id-184'/>
    <array-type-def dimensions='1' type-id='type-id-99' size-in-bits='512' hash='3dfa51af160e3953' id='type-id-183'>
      <subrange length='64' lower-bound='0' upper-bound='63' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6066f2053fe47763' id='type-id-140'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' hash='a30f40a35c5a0c01' id='type-id-185'/>
    <function-decl name='nettle_MD5Init' filepath='/usr/include/nettle/md5-compat.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_MD5Init@@NETTLE_8' hash='c3a96d56cdb33d10'>
      <parameter type-id='type-id-185'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nettle_MD5Final' filepath='/usr/include/nettle/md5-compat.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nettle_MD5Final@@NETTLE_8' hash='096989ba09e5b33d'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-185'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sendserver.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <enum-decl name='gnutls_rnd_level' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/crypto.h' line='184' column='1' hash='80fb2266ac304593' id='type-id-187'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_RND_NONCE' value='0'/>
      <enumerator name='GNUTLS_RND_RANDOM' value='1'/>
      <enumerator name='GNUTLS_RND_KEY' value='2'/>
    </enum-decl>
    <type-decl name='short int' size-in-bits='16' hash='6c2352eccdcd3eea#3' id='type-id-188'/>
    <class-decl name='addrinfo' is-struct='yes' visibility='default' size-in-bits='384' filepath='/usr/include/netdb.h' line='565' column='1' hash='48abe09dffa0d298' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ai_flags' type-id='type-id-11' visibility='default' filepath='/usr/include/netdb.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ai_family' type-id='type-id-11' visibility='default' filepath='/usr/include/netdb.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ai_socktype' type-id='type-id-11' visibility='default' filepath='/usr/include/netdb.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ai_protocol' type-id='type-id-11' visibility='default' filepath='/usr/include/netdb.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ai_addrlen' type-id='type-id-58' visibility='default' filepath='/usr/include/netdb.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ai_addr' type-id='type-id-131' visibility='default' filepath='/usr/include/netdb.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ai_canonname' type-id='type-id-30' visibility='default' filepath='/usr/include/netdb.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ai_next' type-id='type-id-169' visibility='default' filepath='/usr/include/netdb.h' line='574' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pollfd' is-struct='yes' visibility='default' size-in-bits='64' filepath='/usr/include/sys/poll.h' line='36' column='1' hash='9448f51ff629d594' id='type-id-189'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-11' visibility='default' filepath='/usr/include/sys/poll.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='events' type-id='type-id-188' visibility='default' filepath='/usr/include/sys/poll.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='revents' type-id='type-id-188' visibility='default' filepath='/usr/include/sys/poll.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_rnd_level_t' type-id='type-id-187' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/crypto.h' line='188' column='1' hash='80fb2266ac304593' id='type-id-190'/>
    <typedef-decl name='nfds_t' type-id='type-id-23' size-in-bits='64' filepath='/usr/include/sys/poll.h' line='33' column='1' hash='8fdc5eea2983a729' id='type-id-191'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' hash='2f1471831b7872fc' id='type-id-169'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' hash='ee3d8418c48dfc48' id='type-id-167'/>
    <qualified-type-def type-id='type-id-30' restrict='yes' hash='566dfacc48804f50' id='type-id-57'/>
    <qualified-type-def type-id='type-id-2' restrict='yes' hash='b7d5472019e79b5f' id='type-id-56'/>
    <qualified-type-def type-id='type-id-127' restrict='yes' hash='149c8c35c9bdd087' id='type-id-192'/>
    <qualified-type-def type-id='type-id-112' const='yes' hash='645f4d0d44563fc6' id='type-id-193'/>
    <pointer-type-def type-id='type-id-193' size-in-bits='64' hash='61acb54cba0b002f' id='type-id-54'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' hash='3fd83b2c14ae2f2f' id='type-id-168'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' hash='4dd6d46112846be5' id='type-id-194'/>
    <pointer-type-def type-id='type-id-88' size-in-bits='64' hash='a6f2e682574a5947' id='type-id-195'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' hash='24d8cca8965ce13e' id='type-id-182'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' hash='f0221758ecf0c0cb' id='type-id-186'/>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-196'/>
    <function-decl name='rc_send_server' mangled-name='rc_send_server' filepath='/home/nmav/projects/radcli/lib/sendserver.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_send_server@@RADCLI_10' hash='659156f6be7b3111'>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-121'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_rnd' filepath='/usr/include/gnutls/crypto.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_rnd' hash='4ed095a3e8727273'>
      <parameter type-id='type-id-190'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='getnameinfo' filepath='/usr/include/netdb.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='getnameinfo' hash='51d62da82fc932b6'>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='poll' filepath='/usr/include/sys/poll.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='poll' hash='cb135ed4cbf61b36'>
      <parameter type-id='type-id-194'/>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='setsockopt' filepath='/usr/include/sys/socket.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setsockopt' hash='ebe82e516c4fad0f'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='tls.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='320' hash='e7f9696e246a3049' id='type-id-197'>
      <subrange length='40' lower-bound='0' upper-bound='39' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='6281bd35fbce8744' id='type-id-198'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='32' hash='932523ac2c3bfb84' id='type-id-199'>
      <subrange length='4' lower-bound='0' upper-bound='3' type-id='type-id-23' size-in-bits='64' is-anonymous='yes' hash='cee611f4a73e486c' id='type-id-24'/>
    </array-type-def>
    <enum-decl name='gnutls_alert_description_t' naming-typedef-id='type-id-200' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='614' column='1' hash='e194d6870a33c76f' id='type-id-201'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_A_CLOSE_NOTIFY' value='0'/>
      <enumerator name='GNUTLS_A_UNEXPECTED_MESSAGE' value='10'/>
      <enumerator name='GNUTLS_A_BAD_RECORD_MAC' value='20'/>
      <enumerator name='GNUTLS_A_DECRYPTION_FAILED' value='21'/>
      <enumerator name='GNUTLS_A_RECORD_OVERFLOW' value='22'/>
      <enumerator name='GNUTLS_A_DECOMPRESSION_FAILURE' value='30'/>
      <enumerator name='GNUTLS_A_HANDSHAKE_FAILURE' value='40'/>
      <enumerator name='GNUTLS_A_SSL3_NO_CERTIFICATE' value='41'/>
      <enumerator name='GNUTLS_A_BAD_CERTIFICATE' value='42'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_CERTIFICATE' value='43'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REVOKED' value='44'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_EXPIRED' value='45'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNKNOWN' value='46'/>
      <enumerator name='GNUTLS_A_ILLEGAL_PARAMETER' value='47'/>
      <enumerator name='GNUTLS_A_UNKNOWN_CA' value='48'/>
      <enumerator name='GNUTLS_A_ACCESS_DENIED' value='49'/>
      <enumerator name='GNUTLS_A_DECODE_ERROR' value='50'/>
      <enumerator name='GNUTLS_A_DECRYPT_ERROR' value='51'/>
      <enumerator name='GNUTLS_A_EXPORT_RESTRICTION' value='60'/>
      <enumerator name='GNUTLS_A_PROTOCOL_VERSION' value='70'/>
      <enumerator name='GNUTLS_A_INSUFFICIENT_SECURITY' value='71'/>
      <enumerator name='GNUTLS_A_INTERNAL_ERROR' value='80'/>
      <enumerator name='GNUTLS_A_INAPPROPRIATE_FALLBACK' value='86'/>
      <enumerator name='GNUTLS_A_USER_CANCELED' value='90'/>
      <enumerator name='GNUTLS_A_NO_RENEGOTIATION' value='100'/>
      <enumerator name='GNUTLS_A_MISSING_EXTENSION' value='109'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_EXTENSION' value='110'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNOBTAINABLE' value='111'/>
      <enumerator name='GNUTLS_A_UNRECOGNIZED_NAME' value='112'/>
      <enumerator name='GNUTLS_A_UNKNOWN_PSK_IDENTITY' value='115'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REQUIRED' value='116'/>
      <enumerator name='GNUTLS_A_NO_APPLICATION_PROTOCOL' value='120'/>
      <enumerator name='GNUTLS_A_MAX' value='120'/>
    </enum-decl>
    <enum-decl name='gnutls_certificate_type_t' naming-typedef-id='type-id-202' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='841' column='1' hash='0b0e0e9affa9ae45' id='type-id-203'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_CRT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CRT_X509' value='1'/>
      <enumerator name='GNUTLS_CRT_OPENPGP' value='2'/>
      <enumerator name='GNUTLS_CRT_RAWPK' value='3'/>
      <enumerator name='GNUTLS_CRT_MAX' value='3'/>
    </enum-decl>
    <enum-decl name='gnutls_credentials_type_t' naming-typedef-id='type-id-204' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='287' column='1' hash='7be2a490e9a7a839' id='type-id-205'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_CRD_CERTIFICATE' value='1'/>
      <enumerator name='GNUTLS_CRD_ANON' value='2'/>
      <enumerator name='GNUTLS_CRD_SRP' value='3'/>
      <enumerator name='GNUTLS_CRD_PSK' value='4'/>
      <enumerator name='GNUTLS_CRD_IA' value='5'/>
    </enum-decl>
    <enum-decl name='gnutls_psk_key_flags' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='2595' column='1' hash='ec9c286850994608' id='type-id-206'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_PSK_KEY_RAW' value='0'/>
      <enumerator name='GNUTLS_PSK_KEY_HEX' value='1'/>
      <enumerator name='GNUTLS_PSK_KEY_EXT' value='2'/>
    </enum-decl>
    <enum-decl name='gnutls_server_name_type_t' naming-typedef-id='type-id-207' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='1628' column='1' hash='c8633d71e0b702a6' id='type-id-208'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_NAME_DNS' value='1'/>
    </enum-decl>
    <enum-decl name='gnutls_x509_crt_fmt_t' naming-typedef-id='type-id-209' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='856' column='1' hash='2a90723ab146748b' id='type-id-210'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_X509_FMT_DER' value='0'/>
      <enumerator name='GNUTLS_X509_FMT_PEM' value='1'/>
    </enum-decl>
    <class-decl name='__pthread_internal_list' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1' hash='5bcfb7f1ab39fa47' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-212' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-212' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' is-struct='yes' visibility='default' size-in-bits='320' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' hash='765d7e157ef2ec37' id='type-id-213'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-47' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-188' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-214' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_datum_t' is-struct='yes' naming-typedef-id='type-id-215' visibility='default' size-in-bits='128' filepath='/usr/include/gnutls/gnutls.h' line='1291' column='1' hash='bb81b3b569018715' id='type-id-216'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-186' visibility='default' filepath='/usr/include/gnutls/gnutls.h' line='1292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-47' visibility='default' filepath='/usr/include/gnutls/gnutls.h' line='1293' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-211' size-in-bits='128' filepath='/usr/include/bits/thread-shared-types.h' line='55' column='1' id='type-id-214'/>
    <typedef-decl name='gnutls_alert_description_t' type-id='type-id-201' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='648' column='1' hash='e194d6870a33c76f' id='type-id-200'/>
    <typedef-decl name='gnutls_certificate_type_t' type-id='type-id-203' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='847' column='1' hash='0b0e0e9affa9ae45' id='type-id-202'/>
    <typedef-decl name='gnutls_certificate_verify_function' type-id='type-id-217' size-in-bits='64' filepath='/usr/include/gnutls/gnutls.h' line='1868' column='1' id='type-id-218'/>
    <typedef-decl name='gnutls_credentials_type_t' type-id='type-id-205' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='293' column='1' hash='7be2a490e9a7a839' id='type-id-204'/>
    <typedef-decl name='gnutls_datum_t' type-id='type-id-216' size-in-bits='128' filepath='/usr/include/gnutls/gnutls.h' line='1294' column='1' id='type-id-215'/>
    <typedef-decl name='gnutls_free_function' type-id='type-id-219' size-in-bits='64' filepath='/usr/include/gnutls/gnutls.h' line='2300' column='1' hash='fd7a63c0c6c822c4' id='type-id-220'/>
    <typedef-decl name='gnutls_psk_key_flags' type-id='type-id-206' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='2599' column='1' hash='ec9c286850994608' id='type-id-221'/>
    <typedef-decl name='gnutls_server_name_type_t' type-id='type-id-208' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='1630' column='1' hash='c8633d71e0b702a6' id='type-id-207'/>
    <typedef-decl name='gnutls_x509_crt_fmt_t' type-id='type-id-210' size-in-bits='32' alignment-in-bits='32' filepath='/usr/include/gnutls/gnutls.h' line='859' column='1' hash='2a90723ab146748b' id='type-id-209'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-222' size-in-bits='320' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-223'/>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-224' size-in-bits='32' filepath='/usr/include/bits/pthreadtypes.h' line='36' column='1' id='type-id-225'/>
    <union-decl name='pthread_mutex_t' naming-typedef-id='type-id-223' visibility='default' size-in-bits='320' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' hash='8e3e5ddbcaed875f' id='type-id-222'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-213' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-197' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutexattr_t' naming-typedef-id='type-id-225' visibility='default' size-in-bits='32' filepath='/usr/include/bits/pthreadtypes.h' line='32' column='1' hash='9efcb016ff95e817' id='type-id-224'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-199' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-211' size-in-bits='64' hash='b83eb2deac70d470' id='type-id-212'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' hash='cea1d4b0943594a3' id='type-id-226'/>
    <qualified-type-def type-id='type-id-215' const='yes' hash='5a80acf2d0fea502' id='type-id-227'/>
    <pointer-type-def type-id='type-id-227' size-in-bits='64' hash='4064e3b112d2436b' id='type-id-228'/>
    <qualified-type-def type-id='type-id-225' const='yes' hash='c2459df9f244e03e' id='type-id-229'/>
    <pointer-type-def type-id='type-id-229' size-in-bits='64' hash='27684f07d936e645' id='type-id-230'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' hash='642bec7be6092e76' id='type-id-231'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' hash='4c6f5948093ff053' id='type-id-232'/>
    <pointer-type-def type-id='type-id-223' size-in-bits='64' hash='8f341987365c3f23' id='type-id-233'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' hash='fd7a63c0c6c822c4' id='type-id-219'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-236' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-242' size-in-bits='64' id='type-id-243'/>
    <pointer-type-def type-id='type-id-244' size-in-bits='64' id='type-id-245'/>
    <class-decl name='gnutls_certificate_credentials_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-234'/>
    <class-decl name='gnutls_psk_client_credentials_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-238'/>
    <class-decl name='gnutls_session_int' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-242'/>
    <function-decl name='rc_tls_fd' mangled-name='rc_tls_fd' filepath='/home/nmav/projects/radcli/lib/tls.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_tls_fd@@RADCLI_10' hash='b6704dc70a55ac3c'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/config.c' line='500' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='rc_check_tls' mangled-name='rc_check_tls' filepath='/home/nmav/projects/radcli/lib/tls.c' line='478' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_check_tls@@RADCLI_10' hash='b6704dc70a55ac3c'>
      <parameter type-id='type-id-130' name='rh' filepath='/home/nmav/projects/radcli/lib/config.c' line='500' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_timeouts' filepath='/usr/include/gnutls/dtls.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_dtls_set_timeouts' hash='0389e499374a3f97'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <typedef-decl name='gnutls_session_t' type-id='type-id-243' size-in-bits='64' filepath='/usr/include/gnutls/gnutls.h' line='1279' column='1' id='type-id-244'/>
    <function-decl name='gnutls_init' filepath='/usr/include/gnutls/gnutls.h' line='1315' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_init' hash='6668baab5275d4c5'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_deinit' filepath='/usr/include/gnutls/gnutls.h' line='1316' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_deinit' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_handshake' filepath='/usr/include/gnutls/gnutls.h' line='1321' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake' hash='388da3fa973fde78'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_handshake_set_timeout' filepath='/usr/include/gnutls/gnutls.h' line='1327' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_handshake_set_timeout' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_alert_get' filepath='/usr/include/gnutls/gnutls.h' line='1335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get' hash='392ddd37575e20d5'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-200'/>
    </function-decl>
    <function-decl name='gnutls_alert_get_name' filepath='/usr/include/gnutls/gnutls.h' line='1339' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_alert_get_name' hash='154b5031065dfc5f'>
      <parameter type-id='type-id-200'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_get' filepath='/usr/include/gnutls/gnutls.h' line='1370' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_type_get' hash='1b2bdb637dcf0fd4'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-202'/>
    </function-decl>
    <function-decl name='gnutls_error_is_fatal' filepath='/usr/include/gnutls/gnutls.h' line='1497' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_error_is_fatal' hash='d628501fd2223339'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_strerror' filepath='/usr/include/gnutls/gnutls.h' line='1501' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_strerror' hash='7cffa03161e7e042'>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_ping' filepath='/usr/include/gnutls/gnutls.h' line='1519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_ping' hash='64b268c2afc86ade'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_record_send' filepath='/usr/include/gnutls/gnutls.h' line='1548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_send' hash='c013aa17bfe204e4'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='gnutls_record_recv' filepath='/usr/include/gnutls/gnutls.h' line='1557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_record_recv' hash='c013aa17bfe204e4'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='gnutls_server_name_set' filepath='/usr/include/gnutls/gnutls.h' line='1632' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_server_name_set' hash='3cf77f0af9b7637f'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-207'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_enable' filepath='/usr/include/gnutls/gnutls.h' line='1649' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_heartbeat_enable' hash='2bb88322482ae81c'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_priority_set_direct' filepath='/usr/include/gnutls/gnutls.h' line='1808' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_priority_set_direct' hash='881d31261d7717c8'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-226'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_set_default_priority' filepath='/usr/include/gnutls/gnutls.h' line='1834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_set_default_priority' hash='388da3fa973fde78'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_credentials_set' filepath='/usr/include/gnutls/gnutls.h' line='2019' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_credentials_set' hash='d5d85d8c61c04744'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-204'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <typedef-decl name='gnutls_certificate_credentials_t' type-id='type-id-235' size-in-bits='64' filepath='/usr/include/gnutls/gnutls.h' line='2052' column='1' id='type-id-236'/>
    <function-decl name='gnutls_certificate_free_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2081' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_free_credentials' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_allocate_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_allocate_credentials' hash='388da3fa973fde78'>
      <parameter type-id='type-id-237'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_file' filepath='/usr/include/gnutls/gnutls.h' line='2137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_trust_file' hash='b5123cd0f9c430fe'>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file' filepath='/usr/include/gnutls/gnutls.h' line='2155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_x509_key_file' hash='42d85191e9454b9d'>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-209'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <var-decl name='gnutls_free' type-id='type-id-220' visibility='default' filepath='/usr/include/gnutls/gnutls.h' line='2309' column='1' elf-symbol-id='gnutls_free'/>
    <function-decl name='gnutls_transport_set_int2' filepath='/usr/include/gnutls/gnutls.h' line='2407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_transport_set_int2' hash='d628501fd2223339'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_session_set_ptr' filepath='/usr/include/gnutls/gnutls.h' line='2441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_set_ptr' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_session_get_ptr' filepath='/usr/include/gnutls/gnutls.h' line='2442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_session_get_ptr' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <typedef-decl name='gnutls_psk_client_credentials_t' type-id='type-id-239' size-in-bits='64' filepath='/usr/include/gnutls/gnutls.h' line='2585' column='1' id='type-id-240'/>
    <function-decl name='gnutls_psk_free_client_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_psk_free_client_credentials' hash='7f32ffea222edbe7'>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_psk_allocate_client_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_psk_allocate_client_credentials' hash='388da3fa973fde78'>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_psk_set_client_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2606' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_psk_set_client_credentials' hash='625f70f9fc878b8a'>
      <parameter type-id='type-id-240'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_function' filepath='/usr/include/gnutls/gnutls.h' line='2802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_set_verify_function' hash='aa9f0d16bd44ff10'>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers2' filepath='/usr/include/gnutls/gnutls.h' line='2822' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers2' hash='cd648ea08204a733'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers3' filepath='/usr/include/gnutls/gnutls.h' line='2824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verify_peers3' hash='bb41a3ada991dc33'>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verification_status_print' filepath='/usr/include/gnutls/gnutls.h' line='2833' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='gnutls_certificate_verification_status_print' hash='fa2b6a117920810f'>
      <parameter type-id='type-id-47'/>
      <parameter type-id='type-id-202'/>
      <parameter type-id='type-id-232'/>
      <parameter type-id='type-id-47'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_init' hash='f616842fe991fad1'>
      <parameter type-id='type-id-233'/>
      <parameter type-id='type-id-230'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_destroy' hash='0e581935b984ff36'>
      <parameter type-id='type-id-233'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_lock' hash='0e581935b984ff36'>
      <parameter type-id='type-id-233'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='835' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='pthread_mutex_unlock' hash='0e581935b984ff36'>
      <parameter type-id='type-id-233'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-type size-in-bits='64' hash='388da3fa973fde78' id='type-id-217'>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-11'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='util.c' comp-dir-path='/home/nmav/projects/radcli/lib' language='LANG_C11'>
    <class-decl name='timespec' is-struct='yes' visibility='default' size-in-bits='128' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' hash='7451f9a3207df4f1' id='type-id-246'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-19' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-247' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__clockid_t' type-id='type-id-11' size-in-bits='32' filepath='/usr/include/bits/types.h' line='169' column='1' hash='09d17c08f594edc7' id='type-id-248'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-12' size-in-bits='64' filepath='/usr/include/bits/types.h' line='197' column='1' hash='b119fe0931d2ee10' id='type-id-247'/>
    <typedef-decl name='clockid_t' type-id='type-id-248' size-in-bits='32' filepath='/usr/include/bits/types/clockid_t.h' line='7' column='1' hash='09d17c08f594edc7' id='type-id-249'/>
    <pointer-type-def type-id='type-id-246' size-in-bits='64' hash='abfdebaa4180c5b7' id='type-id-250'/>
    <function-decl name='rc_mksid' mangled-name='rc_mksid' filepath='/home/nmav/projects/radcli/lib/util.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_mksid@@RADCLI_10' hash='02a096d257a5e00d'>
      <return type-id='type-id-30'/>
    </function-decl>
    <function-decl name='setns' filepath='/usr/include/bits/sched.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='setns' hash='a9fd86e6e981c3b5'>
      <parameter type-id='type-id-11'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='open' filepath='/usr/include/fcntl.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='open' hash='1d81aff51c388187'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-11'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='clock_gettime' hash='abb4abf77092cad6'>
      <parameter type-id='type-id-249'/>
      <parameter type-id='type-id-250'/>
      <return type-id='type-id-11'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
