<abi-corpus path='./lib/.libs/libradcli.so' architecture='elf-amd-x86_64' soname='libradcli.so.5'>
  <elf-needed>
    <dependency name='libgnutls.so.30'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rc_aaa' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_free' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_get_secret' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_get_vector' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_server' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_acct' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rc_dict_getval' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_getvend' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_find_server_addr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_get_socket_type' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_get_srcaddr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_getport' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_mksid' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_new' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_openlog' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_own_hostname' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_config' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_dictionary' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_dictionary_from_buffer' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_send_server' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_setdebug' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_test_config' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_tls_fd' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr version='1.0' address-size='64' path='buildreq.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C99'>








    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-2' size-in-bits='512' id='type-id-3'>
      <subrange length='8' type-id='type-id-4' id='type-id-5'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='944' id='type-id-6'>
      <subrange length='118' type-id='type-id-4' id='type-id-7'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='112' id='type-id-8'>
      <subrange length='14' type-id='type-id-4' id='type-id-9'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='2032' id='type-id-10'>
      <subrange length='254' type-id='type-id-4' id='type-id-11'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='256' id='type-id-12'>
      <subrange length='32' type-id='type-id-4' id='type-id-13'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='264' id='type-id-14'>
      <subrange length='33' type-id='type-id-4' id='type-id-15'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='776' id='type-id-16'>
      <subrange length='97' type-id='type-id-4' id='type-id-17'/>

    </array-type-def>
    <class-decl name='_option' size-in-bits='640' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-18'/>
    <type-decl name='double' size-in-bits='64' id='type-id-19'/>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='512' id='type-id-20'>
      <subrange length='8' type-id='type-id-4' id='type-id-5'/>

    </array-type-def>
    <type-decl name='int' size-in-bits='32' id='type-id-21'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-22'/>
    <array-type-def dimensions='1' type-id='type-id-23' size-in-bits='128' id='type-id-24'>
      <subrange length='8' type-id='type-id-4' id='type-id-5'/>

    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-25' size-in-bits='128' id='type-id-26'>
      <subrange length='16' type-id='type-id-4' id='type-id-27'/>

    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-28'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-29'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-30'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-4'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-31'/>
    <type-decl name='void' id='type-id-32'/>
    <typedef-decl name='rc_handle' type-id='type-id-33' filepath='../include/radcli/radcli.h' line='79' column='1' id='type-id-34'/>
    <class-decl name='rc_conf' size-in-bits='3072' is-struct='yes' visibility='default' filepath='../include/includes.h' line='188' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='config_options' type-id='type-id-35' visibility='default' filepath='../include/includes.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nas_addr' type-id='type-id-36' visibility='default' filepath='../include/includes.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nas_addr_set' type-id='type-id-30' visibility='default' filepath='../include/includes.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='own_bind_addr' type-id='type-id-36' visibility='default' filepath='../include/includes.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='own_bind_addr_set' type-id='type-id-30' visibility='default' filepath='../include/includes.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='first_dict_read' type-id='type-id-2' visibility='default' filepath='../include/includes.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='dictionary_attributes' type-id='type-id-37' visibility='default' filepath='../include/includes.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='dictionary_values' type-id='type-id-38' visibility='default' filepath='../include/includes.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='dictionary_vendors' type-id='type-id-39' visibility='default' filepath='../include/includes.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='so' type-id='type-id-40' visibility='default' filepath='../include/includes.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='so_type' type-id='type-id-30' visibility='default' filepath='../include/includes.h' line='206' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/usr/include/bits/socket.h' line='191' column='1' id='type-id-36'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/socket.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/socket.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/socket.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='sa_family_t' type-id='type-id-31' filepath='/usr/include/bits/sockaddr.h' line='28' column='1' id='type-id-41'/>
    <class-decl name='dict_attr' size-in-bits='512' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='427' column='1' id='type-id-42'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='../include/radcli/radcli.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='value' type-id='type-id-43' visibility='default' filepath='../include/radcli/radcli.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type' type-id='type-id-44' visibility='default' filepath='../include/radcli/radcli.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next' type-id='type-id-37' visibility='default' filepath='../include/radcli/radcli.h' line='432' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint64_t' type-id='type-id-45' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-43'/>
    <typedef-decl name='__uint64_t' type-id='type-id-4' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-45'/>
    <typedef-decl name='rc_attr_type' type-id='type-id-46' filepath='../include/radcli/radcli.h' line='117' column='1' id='type-id-44'/>
    <enum-decl name='rc_attr_type' filepath='../include/radcli/radcli.h' line='109' column='1' id='type-id-46'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='PW_TYPE_STRING' value='0'/>
      <enumerator name='PW_TYPE_INTEGER' value='1'/>
      <enumerator name='PW_TYPE_IPADDR' value='2'/>
      <enumerator name='PW_TYPE_DATE' value='3'/>
      <enumerator name='PW_TYPE_IPV6ADDR' value='4'/>
      <enumerator name='PW_TYPE_IPV6PREFIX' value='5'/>
      <enumerator name='PW_TYPE_MAX' value='6'/>
    </enum-decl>
    <class-decl name='dict_value' size-in-bits='640' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='435' column='1' id='type-id-47'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrname' type-id='type-id-14' visibility='default' filepath='../include/radcli/radcli.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='../include/radcli/radcli.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='value' type-id='type-id-48' visibility='default' filepath='../include/radcli/radcli.h' line='439' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-38' visibility='default' filepath='../include/radcli/radcli.h' line='440' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint32_t' type-id='type-id-49' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-48'/>
    <typedef-decl name='__uint32_t' type-id='type-id-30' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-49'/>
    <class-decl name='dict_vendor' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='443' column='1' id='type-id-50'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vendorname' type-id='type-id-14' visibility='default' filepath='../include/radcli/radcli.h' line='445' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='vendorpec' type-id='type-id-48' visibility='default' filepath='../include/radcli/radcli.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='type-id-39' visibility='default' filepath='../include/radcli/radcli.h' line='447' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='rc_sockets_override' type-id='type-id-51' filepath='../include/includes.h' line='186' column='1' id='type-id-40'/>
    <class-decl name='rc_sockets_override' size-in-bits='512' is-struct='yes' visibility='default' filepath='../include/includes.h' line='175' column='1' id='type-id-51'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-52' visibility='default' filepath='../include/includes.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='static_secret' type-id='type-id-53' visibility='default' filepath='../include/includes.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_fd' type-id='type-id-54' visibility='default' filepath='../include/includes.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='close_fd' type-id='type-id-55' visibility='default' filepath='../include/includes.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sendto' type-id='type-id-56' visibility='default' filepath='../include/includes.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='recvfrom' type-id='type-id-57' visibility='default' filepath='../include/includes.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lock' type-id='type-id-58' visibility='default' filepath='../include/includes.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unlock' type-id='type-id-58' visibility='default' filepath='../include/includes.h' line='185' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/socket.h' line='178' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='type-id-41' visibility='default' filepath='/usr/include/bits/socket.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/socket.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='ssize_t' type-id='type-id-60' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-61'/>
    <typedef-decl name='__ssize_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-60'/>
    <typedef-decl name='size_t' type-id='type-id-4' filepath='/usr/lib/gcc/x86_64-redhat-linux/10/include/stddef.h' line='209' column='1' id='type-id-62'/>
    <typedef-decl name='socklen_t' type-id='type-id-63' filepath='/usr/include/bits/socket.h' line='33' column='1' id='type-id-64'/>
    <typedef-decl name='__socklen_t' type-id='type-id-30' filepath='/usr/include/bits/types.h' line='210' column='1' id='type-id-63'/>
    <typedef-decl name='VALUE_PAIR' type-id='type-id-65' filepath='../include/radcli/radcli.h' line='480' column='1' id='type-id-66'/>
    <class-decl name='rc_value_pair' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='471' column='1' id='type-id-65'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-14' visibility='default' filepath='../include/radcli/radcli.h' line='473' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attribute' type-id='type-id-43' visibility='default' filepath='../include/radcli/radcli.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type' type-id='type-id-44' visibility='default' filepath='../include/radcli/radcli.h' line='475' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='lvalue' type-id='type-id-48' visibility='default' filepath='../include/radcli/radcli.h' line='476' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strvalue' type-id='type-id-10' visibility='default' filepath='../include/radcli/radcli.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='next' type-id='type-id-67' visibility='default' filepath='../include/radcli/radcli.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='pad' type-id='type-id-12' visibility='default' filepath='../include/radcli/radcli.h' line='479' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='rc_standard_codes' type-id='type-id-68' filepath='../include/radcli/radcli.h' line='135' column='1' id='type-id-69'/>
    <enum-decl name='rc_standard_codes' filepath='../include/radcli/radcli.h' line='121' column='1' id='type-id-68'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='PW_ACCESS_REQUEST' value='1'/>
      <enumerator name='PW_ACCESS_ACCEPT' value='2'/>
      <enumerator name='PW_ACCESS_REJECT' value='3'/>
      <enumerator name='PW_ACCOUNTING_REQUEST' value='4'/>
      <enumerator name='PW_ACCOUNTING_RESPONSE' value='5'/>
      <enumerator name='PW_ACCOUNTING_STATUS' value='6'/>
      <enumerator name='PW_PASSWORD_REQUEST' value='7'/>
      <enumerator name='PW_PASSWORD_ACK' value='8'/>
      <enumerator name='PW_PASSWORD_REJECT' value='9'/>
      <enumerator name='PW_ACCOUNTING_MESSAGE' value='10'/>
      <enumerator name='PW_ACCESS_CHALLENGE' value='11'/>
      <enumerator name='PW_STATUS_SERVER' value='12'/>
      <enumerator name='PW_STATUS_CLIENT' value='13'/>
    </enum-decl>
    <typedef-decl name='RC_AAA_CTX' type-id='type-id-70' filepath='../include/radcli/radcli.h' line='498' column='1' id='type-id-71'/>
    <class-decl name='rc_aaa_ctx_st' size-in-bits='904' is-struct='yes' visibility='default' filepath='../include/includes.h' line='210' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret' type-id='type-id-16' visibility='default' filepath='../include/includes.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='776'>
        <var-decl name='request_vector' type-id='type-id-26' visibility='default' filepath='../include/includes.h' line='213' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint8_t' type-id='type-id-72' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-25'/>
    <typedef-decl name='__uint8_t' type-id='type-id-29' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-72'/>
    <typedef-decl name='SERVER' type-id='type-id-73' filepath='../include/radcli/radcli.h' line='90' column='1' id='type-id-74'/>
    <class-decl name='server' size-in-bits='1728' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='84' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max' type-id='type-id-21' visibility='default' filepath='../include/radcli/radcli.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-3' visibility='default' filepath='../include/radcli/radcli.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='port' type-id='type-id-24' visibility='default' filepath='../include/radcli/radcli.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='secret' type-id='type-id-3' visibility='default' filepath='../include/radcli/radcli.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='deadtime_ends' type-id='type-id-20' visibility='default' filepath='../include/radcli/radcli.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='uint16_t' type-id='type-id-75' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-23'/>
    <typedef-decl name='__uint16_t' type-id='type-id-31' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-75'/>
    <typedef-decl name='rc_type' type-id='type-id-76' filepath='../include/radcli/radcli.h' line='67' column='1' id='type-id-77'/>
    <enum-decl name='rc_type' filepath='../include/radcli/radcli.h' line='64' column='1' id='type-id-76'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='AUTH' value='0'/>
      <enumerator name='ACCT' value='1'/>
    </enum-decl>
    <typedef-decl name='SEND_DATA' type-id='type-id-78' filepath='../include/radcli/radcli.h' line='493' column='1' id='type-id-79'/>
    <class-decl name='send_data' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='482' column='1' id='type-id-78'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='code' type-id='type-id-25' visibility='default' filepath='../include/radcli/radcli.h' line='484' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='seq_nbr' type-id='type-id-25' visibility='default' filepath='../include/radcli/radcli.h' line='485' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='server' type-id='type-id-2' visibility='default' filepath='../include/radcli/radcli.h' line='486' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='svc_port' type-id='type-id-21' visibility='default' filepath='../include/radcli/radcli.h' line='487' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='secret' type-id='type-id-2' visibility='default' filepath='../include/radcli/radcli.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timeout' type-id='type-id-21' visibility='default' filepath='../include/radcli/radcli.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='retries' type-id='type-id-21' visibility='default' filepath='../include/radcli/radcli.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_pairs' type-id='type-id-80' visibility='default' filepath='../include/radcli/radcli.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='receive_pairs' type-id='type-id-80' visibility='default' filepath='../include/radcli/radcli.h' line='492' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-74' size-in-bits='64' id='type-id-84'/>
    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-85'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-2'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-86'/>
    <pointer-type-def type-id='type-id-86' size-in-bits='64' id='type-id-53'/>
    <qualified-type-def type-id='type-id-34' const='yes' id='type-id-87'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-88'/>
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-89'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-37'/>
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-38'/>
    <pointer-type-def type-id='type-id-50' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-91' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-32' size-in-bits='64' id='type-id-52'/>
    <function-decl name='rc_check' mangled-name='rc_check' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_check@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-2' name='host' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-2' name='secret' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-31' name='port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-2' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='304' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_acct_proxy' mangled-name='rc_acct_proxy' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_acct_proxy@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='287' column='1'/>
      <parameter type-id='type-id-80' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='287' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_acct' mangled-name='rc_acct' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_acct@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='274' column='1'/>
      <parameter type-id='type-id-48' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='274' column='1'/>
      <parameter type-id='type-id-80' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='274' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_auth_proxy' mangled-name='rc_auth_proxy' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_auth_proxy@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-80' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-85' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-2' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='258' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_auth' mangled-name='rc_auth' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_auth@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-48' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-80' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-85' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='236' column='1'/>
      <parameter type-id='type-id-2' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='236' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_aaa' mangled-name='rc_aaa' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-48' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-80' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-85' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-2' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-21' name='add_nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-69' name='request_type' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='217' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_server' mangled-name='rc_aaa_ctx_server' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_server@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-82' name='ctx' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-84' name='aaaserver' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-77' name='type' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='112' column='1'/>
      <parameter type-id='type-id-48' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='113' column='1'/>
      <parameter type-id='type-id-80' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='114' column='1'/>
      <parameter type-id='type-id-85' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='114' column='1'/>
      <parameter type-id='type-id-2' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='115' column='1'/>
      <parameter type-id='type-id-21' name='add_nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='115' column='1'/>
      <parameter type-id='type-id-69' name='request_type' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='116' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx' mangled-name='rc_aaa_ctx' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-82' name='ctx' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-48' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-80' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-85' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-2' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-21' name='add_nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='72' column='1'/>
      <parameter type-id='type-id-69' name='request_type' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='72' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_buildreq' mangled-name='rc_buildreq' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_buildreq@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-83' name='data' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-21' name='code' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-2' name='server' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-31' name='port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-2' name='secret' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-21' name='timeout' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-21' name='retries' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='42' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-91'>
      <parameter type-id='type-id-52'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-92'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-94'/>
      <return type-id='type-id-21'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-96'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-61'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-97'>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-94'/>
      <parameter type-id='type-id-95'/>
      <return type-id='type-id-61'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-98'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-32'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='sendserver.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C99'>
    <function-decl name='rc_send_server' mangled-name='rc_send_server' filepath='/home/nmav/cvs/radcli/lib/sendserver.c' line='232' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_send_server@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/sendserver.c' line='232' column='1'/>
      <parameter type-id='type-id-83' name='data' filepath='/home/nmav/cvs/radcli/lib/sendserver.c' line='232' column='1'/>
      <parameter type-id='type-id-2' name='msg' filepath='/home/nmav/cvs/radcli/lib/sendserver.c' line='232' column='1'/>
      <parameter type-id='type-id-77' name='type' filepath='/home/nmav/cvs/radcli/lib/sendserver.c' line='232' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='__builtin_memcpy' mangled-name='memcpy' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-32'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='avpair.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-48' size-in-bits='128' id='type-id-99'>
      <subrange length='4' type-id='type-id-4' id='type-id-100'/>

    </array-type-def>
    <class-decl name='in6_addr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='216' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__in6_u' type-id='type-id-102' visibility='default' filepath='/usr/include/netinet/in.h' line='223' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='218' column='1' id='type-id-102'>
      <data-member access='private'>
        <var-decl name='__u6_addr8' type-id='type-id-26' visibility='default' filepath='/usr/include/netinet/in.h' line='220' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__u6_addr16' type-id='type-id-24' visibility='default' filepath='/usr/include/netinet/in.h' line='221' column='1'/>
      </data-member>
      <data-member access='private'>
        <var-decl name='__u6_addr32' type-id='type-id-99' visibility='default' filepath='/usr/include/netinet/in.h' line='222' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-103'/>
    <qualified-type-def type-id='type-id-29' const='yes' id='type-id-104'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-105'/>
    <pointer-type-def type-id='type-id-101' size-in-bits='64' id='type-id-106'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-107'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-108'/>
    <function-decl name='rc_avpair_get_attr' mangled-name='rc_avpair_get_attr' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1054' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_attr@@RADCLI_5'>
      <parameter type-id='type-id-80' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1054' column='1'/>
      <parameter type-id='type-id-108' name='type' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1054' column='1'/>
      <parameter type-id='type-id-108' name='id' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1054' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='rc_avpair_get_raw' mangled-name='rc_avpair_get_raw' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1034' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_raw@@RADCLI_5'>
      <parameter type-id='type-id-80' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1034' column='1'/>
      <parameter type-id='type-id-103' name='res' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1034' column='1'/>
      <parameter type-id='type-id-108' name='res_size' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1034' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_avpair_get_in6' mangled-name='rc_avpair_get_in6' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1002' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_in6@@RADCLI_5'>
      <parameter type-id='type-id-80' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1002' column='1'/>
      <parameter type-id='type-id-106' name='res' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1002' column='1'/>
      <parameter type-id='type-id-108' name='prefix' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1002' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_avpair_get_uint32' mangled-name='rc_avpair_get_uint32' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='981' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_uint32@@RADCLI_5'>
      <parameter type-id='type-id-80' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='981' column='1'/>
      <parameter type-id='type-id-107' name='res' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='981' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_avpair_log' mangled-name='rc_avpair_log' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='951' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_log@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='951' column='1'/>
      <parameter type-id='type-id-80' name='pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='951' column='1'/>
      <parameter type-id='type-id-2' name='buf' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='951' column='1'/>
      <parameter type-id='type-id-62' name='buf_len' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='951' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rc_avpair_tostr' mangled-name='rc_avpair_tostr' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_tostr@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-80' name='pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-2' name='name' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-21' name='ln' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-2' name='value' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-21' name='lv' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_avpair_parse' mangled-name='rc_avpair_parse' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_parse@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='601' column='1'/>
      <parameter type-id='type-id-53' name='buffer' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='601' column='1'/>
      <parameter type-id='type-id-85' name='first_pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='601' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_avpair_free' mangled-name='rc_avpair_free' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='537' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_free@@RADCLI_5'>
      <parameter type-id='type-id-80' name='pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='537' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='rc_avpair_insert' mangled-name='rc_avpair_insert' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_insert@@RADCLI_5'>
      <parameter type-id='type-id-85' name='a' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='485' column='1'/>
      <parameter type-id='type-id-80' name='p' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='485' column='1'/>
      <parameter type-id='type-id-80' name='b' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='485' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='rc_avpair_copy' mangled-name='rc_avpair_copy' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_copy@@RADCLI_5'>
      <parameter type-id='type-id-80' name='p' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='450' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='rc_avpair_get' mangled-name='rc_avpair_get' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get@@RADCLI_5'>
      <parameter type-id='type-id-80' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='433' column='1'/>
      <parameter type-id='type-id-48' name='attrid' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='433' column='1'/>
      <parameter type-id='type-id-48' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='433' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='rc_avpair_gen' mangled-name='rc_avpair_gen' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_gen@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-80' name='pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-105' name='ptr' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-21' name='length' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='272' column='1'/>
      <parameter type-id='type-id-48' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='272' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='rc_avpair_new' mangled-name='rc_avpair_new' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_new@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-48' name='attrid' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-52' name='pval' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-21' name='len' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-48' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='rc_avpair_assign' mangled-name='rc_avpair_assign' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_assign@@RADCLI_5'>
      <parameter type-id='type-id-80' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='135' column='1'/>
      <parameter type-id='type-id-52' name='pval' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='135' column='1'/>
      <parameter type-id='type-id-21' name='len' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='135' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_avpair_next' mangled-name='rc_avpair_next' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_next@@RADCLI_5'>
      <parameter type-id='type-id-80' name='t' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='112' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
    <function-decl name='rc_avpair_remove' mangled-name='rc_avpair_remove' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_remove@@RADCLI_5'>
      <parameter type-id='type-id-85' name='list' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='69' column='1'/>
      <parameter type-id='type-id-48' name='attrid' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='69' column='1'/>
      <parameter type-id='type-id-48' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='69' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='rc_avpair_add' mangled-name='rc_avpair_add' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_add@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-85' name='list' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-48' name='attrid' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-52' name='pval' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-21' name='len' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-48' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <return type-id='type-id-80'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='config.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C99'>

    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='512' id='type-id-109'>
      <subrange length='64' type-id='type-id-4' id='type-id-110'/>

    </array-type-def>
    <typedef-decl name='rc_socket_type' type-id='type-id-111' filepath='../include/radcli/radcli.h' line='99' column='1' id='type-id-112'/>
    <enum-decl name='rc_socket_type' filepath='../include/radcli/radcli.h' line='94' column='1' id='type-id-111'>
      <underlying-type type-id='type-id-28'/>
      <enumerator name='RC_SOCKET_UDP' value='0'/>
      <enumerator name='RC_SOCKET_TLS' value='1'/>
      <enumerator name='RC_SOCKET_DTLS' value='2'/>
      <enumerator name='RC_SOCKET_TCP' value='3'/>
    </enum-decl>
    <class-decl name='addrinfo' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/netdb.h' line='565' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ai_flags' type-id='type-id-21' visibility='default' filepath='/usr/include/netdb.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ai_family' type-id='type-id-21' visibility='default' filepath='/usr/include/netdb.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ai_socktype' type-id='type-id-21' visibility='default' filepath='/usr/include/netdb.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ai_protocol' type-id='type-id-21' visibility='default' filepath='/usr/include/netdb.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ai_addrlen' type-id='type-id-64' visibility='default' filepath='/usr/include/netdb.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ai_addr' type-id='type-id-94' visibility='default' filepath='/usr/include/netdb.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ai_canonname' type-id='type-id-2' visibility='default' filepath='/usr/include/netdb.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ai_next' type-id='type-id-114' visibility='default' filepath='/usr/include/netdb.h' line='574' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-115'/>
    <function-decl name='rc_get_socket_type' mangled-name='rc_get_socket_type' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_get_socket_type@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1146' column='1'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='rc_destroy' mangled-name='rc_destroy' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1125' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_destroy@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1125' column='1'/>
      <return type-id='type-id-32'/>
    </function-decl>
    <function-decl name='rc_find_server_addr' mangled-name='rc_find_server_addr' filepath='/home/nmav/cvs/radcli/lib/config.c' line='912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_find_server_addr@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='912' column='1'/>
      <parameter type-id='type-id-53' name='server_name' filepath='/home/nmav/cvs/radcli/lib/config.c' line='912' column='1'/>
      <parameter type-id='type-id-115' name='info' filepath='/home/nmav/cvs/radcli/lib/config.c' line='913' column='1'/>
      <parameter type-id='type-id-2' name='secret' filepath='/home/nmav/cvs/radcli/lib/config.c' line='913' column='1'/>
      <parameter type-id='type-id-77' name='type' filepath='/home/nmav/cvs/radcli/lib/config.c' line='913' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_test_config' mangled-name='rc_test_config' filepath='/home/nmav/cvs/radcli/lib/config.c' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_test_config@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='778' column='1'/>
      <parameter type-id='type-id-53' name='filename' filepath='/home/nmav/cvs/radcli/lib/config.c' line='778' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_conf_int' mangled-name='rc_conf_int' filepath='/home/nmav/cvs/radcli/lib/config.c' line='747' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_conf_int@@RADCLI_5'>
      <parameter type-id='type-id-88' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='747' column='1'/>
      <parameter type-id='type-id-53' name='optname' filepath='/home/nmav/cvs/radcli/lib/config.c' line='747' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='rc_read_config' mangled-name='rc_read_config' filepath='/home/nmav/cvs/radcli/lib/config.c' line='568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_config@@RADCLI_5'>
      <parameter type-id='type-id-53' name='filename' filepath='/home/nmav/cvs/radcli/lib/config.c' line='568' column='1'/>
      <return type-id='type-id-93'/>
    </function-decl>
    <function-decl name='rc_apply_config' mangled-name='rc_apply_config' filepath='/home/nmav/cvs/radcli/lib/config.c' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_apply_config@@RADCLI_5'>
      <parameter type-id='type-id-93' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='500' column='1'/>
      <return type-id='type-id-21'/>
