<abi-corpus version='2.1' path='./lib/.libs/libradcli.so' architecture='elf-amd-x86_64' soname='libradcli.so.5'>
  <elf-needed>
    <dependency name='libgnutls.so.30'/>
    <dependency name='libnettle.so.8'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='rc_aaa' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_free' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_get_secret' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_get_vector' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_aaa_ctx_server' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='rc_dict_addvend' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_findattr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_findval' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_findvend' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_free' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_getattr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_getval' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_dict_getvend' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_find_server_addr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_get_socket_type' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_get_srcaddr' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_getport' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_mksid' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_new' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_openlog' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_own_hostname' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_config' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_dictionary' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_read_dictionary_from_buffer' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_send_server' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_setdebug' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_test_config' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='rc_tls_fd' version='RADCLI_5' is-default-version='yes' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='aaa_ctx.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <function-decl name='rc_aaa_ctx_get_secret' mangled-name='rc_aaa_ctx_get_secret' filepath='/home/nmav/cvs/radcli/lib/aaa_ctx.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_get_secret@@RADCLI_5'>
      <parameter type-id='type-id-1' name='ctx' filepath='/home/nmav/cvs/radcli/lib/aaa_ctx.c' line='41' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_get_vector' mangled-name='rc_aaa_ctx_get_vector' filepath='/home/nmav/cvs/radcli/lib/aaa_ctx.c' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_get_vector@@RADCLI_5'>
      <parameter type-id='type-id-1' name='ctx' filepath='/home/nmav/cvs/radcli/lib/aaa_ctx.c' line='52' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_free' mangled-name='rc_aaa_ctx_free' filepath='/home/nmav/cvs/radcli/lib/aaa_ctx.c' line='62' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_free@@RADCLI_5'>
      <parameter type-id='type-id-1' name='ctx' filepath='/home/nmav/cvs/radcli/lib/aaa_ctx.c' line='62' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='free' filepath='/usr/include/stdlib.h' line='568' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='avpair.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <class-decl name='in6_addr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='219' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__in6_u' type-id='type-id-6' visibility='default' filepath='/usr/include/netinet/in.h' line='226' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='in_addr' size-in-bits='32' is-struct='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='31' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_addr' type-id='type-id-8' visibility='default' filepath='/usr/include/netinet/in.h' line='33' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='tm' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='7' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tm_sec' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='9' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='tm_min' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='10' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tm_hour' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='tm_mday' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='tm_mon' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='13' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tm_year' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='14' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tm_wday' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='15' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='tm_yday' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tm_isdst' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='17' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='tm_gmtoff' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='20' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='tm_zone' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/types/struct_tm.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='DICT_ATTR' type-id='type-id-12' filepath='../include/radcli/radcli.h' line='436' column='1' id='type-id-13'/>
    <typedef-decl name='DICT_VALUE' type-id='type-id-14' filepath='../include/radcli/radcli.h' line='444' column='1' id='type-id-15'/>
    <typedef-decl name='DICT_VENDOR' type-id='type-id-16' filepath='../include/radcli/radcli.h' line='451' column='1' id='type-id-17'/>
    <typedef-decl name='__time_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-18'/>
    <typedef-decl name='in_addr_t' type-id='type-id-19' filepath='/usr/include/netinet/in.h' line='30' column='1' id='type-id-8'/>
    <typedef-decl name='time_t' type-id='type-id-18' filepath='/usr/include/bits/types/time_t.h' line='10' column='1' id='type-id-20'/>
    <array-type-def dimensions='1' type-id='type-id-19' size-in-bits='128' id='type-id-21'>
      <subrange length='4' type-id='type-id-22' id='type-id-23'/>
    </array-type-def>
    <union-decl name='__anonymous_union__' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='/usr/include/netinet/in.h' line='221' column='1' id='type-id-6'>
      <data-member access='public'>
        <var-decl name='__u6_addr8' type-id='type-id-24' visibility='default' filepath='/usr/include/netinet/in.h' line='223' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__u6_addr16' type-id='type-id-25' visibility='default' filepath='/usr/include/netinet/in.h' line='224' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__u6_addr32' type-id='type-id-21' visibility='default' filepath='/usr/include/netinet/in.h' line='225' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-30'/>
    <qualified-type-def type-id='type-id-30' restrict='yes' id='type-id-31'/>
    <qualified-type-def type-id='type-id-2' restrict='yes' id='type-id-32'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-34'/>
    <qualified-type-def type-id='type-id-34' restrict='yes' id='type-id-35'/>
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-36'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <qualified-type-def type-id='type-id-37' restrict='yes' id='type-id-38'/>
    <qualified-type-def type-id='type-id-39' const='yes' id='type-id-40'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-45'/>
    <qualified-type-def type-id='type-id-45' restrict='yes' id='type-id-46'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-49'/>
    <function-decl name='rc_dict_getattr' filepath='../include/radcli/radcli.h' line='638' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='rc_dict_findattr' filepath='../include/radcli/radcli.h' line='639' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='rc_dict_findval' filepath='../include/radcli/radcli.h' line='640' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='rc_dict_getvend' filepath='../include/radcli/radcli.h' line='642' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='rc_dict_getval' filepath='../include/radcli/radcli.h' line='643' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-19'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='rc_avpair_add' mangled-name='rc_avpair_add' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_add@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-52' name='list' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-19' name='attrid' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-3' name='pval' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-10' name='len' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <parameter type-id='type-id-19' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='46' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_remove' mangled-name='rc_avpair_remove' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='69' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_remove@@RADCLI_5'>
      <parameter type-id='type-id-52' name='list' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='69' column='1'/>
      <parameter type-id='type-id-19' name='attrid' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='69' column='1'/>
      <parameter type-id='type-id-19' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='69' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_avpair_next' mangled-name='rc_avpair_next' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='112' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_next@@RADCLI_5'>
      <parameter type-id='type-id-53' name='t' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='112' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_assign' mangled-name='rc_avpair_assign' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='135' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_assign@@RADCLI_5'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='135' column='1'/>
      <parameter type-id='type-id-3' name='pval' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='135' column='1'/>
      <parameter type-id='type-id-10' name='len' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='135' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_avpair_new' mangled-name='rc_avpair_new' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_new@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-19' name='attrid' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-3' name='pval' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-10' name='len' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <parameter type-id='type-id-19' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='193' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_gen' mangled-name='rc_avpair_gen' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='271' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_gen@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-53' name='pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-54' name='ptr' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='271' column='1'/>
      <parameter type-id='type-id-10' name='length' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='272' column='1'/>
      <parameter type-id='type-id-19' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='272' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_get' mangled-name='rc_avpair_get' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get@@RADCLI_5'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='433' column='1'/>
      <parameter type-id='type-id-19' name='attrid' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='433' column='1'/>
      <parameter type-id='type-id-19' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='433' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_copy' mangled-name='rc_avpair_copy' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_copy@@RADCLI_5'>
      <parameter type-id='type-id-53' name='p' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='450' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='rc_avpair_insert' mangled-name='rc_avpair_insert' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='485' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_insert@@RADCLI_5'>
      <parameter type-id='type-id-52' name='a' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='485' column='1'/>
      <parameter type-id='type-id-53' name='p' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='485' column='1'/>
      <parameter type-id='type-id-53' name='b' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='485' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_avpair_free' mangled-name='rc_avpair_free' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='537' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_free@@RADCLI_5'>
      <parameter type-id='type-id-53' name='pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='537' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_avpair_parse' mangled-name='rc_avpair_parse' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='601' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_parse@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='601' column='1'/>
      <parameter type-id='type-id-2' name='buffer' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='601' column='1'/>
      <parameter type-id='type-id-52' name='first_pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='601' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_avpair_tostr' mangled-name='rc_avpair_tostr' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_tostr@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-53' name='pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-29' name='name' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-10' name='ln' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-29' name='value' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <parameter type-id='type-id-10' name='lv' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='831' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_avpair_log' mangled-name='rc_avpair_log' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_log@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-53' name='pair' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-29' name='buf' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='952' column='1'/>
      <parameter type-id='type-id-55' name='buf_len' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='952' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='rc_avpair_get_uint32' mangled-name='rc_avpair_get_uint32' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_uint32@@RADCLI_5'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='982' column='1'/>
      <parameter type-id='type-id-47' name='res' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='982' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_avpair_get_in6' mangled-name='rc_avpair_get_in6' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_in6@@RADCLI_5'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1003' column='1'/>
      <parameter type-id='type-id-43' name='res' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1003' column='1'/>
      <parameter type-id='type-id-49' name='prefix' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1003' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_avpair_get_raw' mangled-name='rc_avpair_get_raw' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1035' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_raw@@RADCLI_5'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1035' column='1'/>
      <parameter type-id='type-id-30' name='res' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1035' column='1'/>
      <parameter type-id='type-id-49' name='res_size' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1035' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_avpair_get_attr' mangled-name='rc_avpair_get_attr' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1055' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_avpair_get_attr@@RADCLI_5'>
      <parameter type-id='type-id-53' name='vp' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1055' column='1'/>
      <parameter type-id='type-id-49' name='type' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1055' column='1'/>
      <parameter type-id='type-id-49' name='id' filepath='/home/nmav/cvs/radcli/lib/avpair.c' line='1055' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_strlcpy' filepath='/home/nmav/cvs/radcli/lib/util.h' line='16' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='rc_str2tm' filepath='/home/nmav/cvs/radcli/lib/util.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='inet_ntoa' filepath='/usr/include/arpa/inet.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='inet_pton' filepath='/usr/include/arpa/inet.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-56'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='inet_ntop' filepath='/usr/include/arpa/inet.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-42'/>
    </function-decl>
    <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='malloc' filepath='/usr/include/stdlib.h' line='553' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='calloc' filepath='/usr/include/stdlib.h' line='556' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='abort' filepath='/usr/include/stdlib.h' line='611' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='memmove' filepath='/usr/include/string.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='strcpy' filepath='/usr/include/string.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='strcat' filepath='/usr/include/string.h' line='149' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='syslog' filepath='/usr/include/sys/syslog.h' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-2'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='time' filepath='/usr/include/time.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-44'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='mktime' filepath='/usr/include/time.h' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-45'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='strftime' filepath='/usr/include/time.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='gmtime_r' filepath='/usr/include/time.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-45'/>
    </function-decl>
    <function-decl name='localtime_r' filepath='/usr/include/time.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-35'/>
      <parameter type-id='type-id-46'/>
      <return type-id='type-id-45'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='buildreq.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <type-decl name='char' size-in-bits='8' id='type-id-59'/>
    <array-type-def dimensions='1' type-id='type-id-29' size-in-bits='512' id='type-id-60'>
      <subrange length='8' type-id='type-id-22' id='type-id-61'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='944' id='type-id-62'>
      <subrange length='118' type-id='type-id-22' id='type-id-63'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='112' id='type-id-64'>
      <subrange length='14' type-id='type-id-22' id='type-id-65'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='2032' id='type-id-66'>
      <subrange length='254' type-id='type-id-22' id='type-id-67'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='256' id='type-id-68'>
      <subrange length='32' type-id='type-id-22' id='type-id-69'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='264' id='type-id-70'>
      <subrange length='33' type-id='type-id-22' id='type-id-71'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='776' id='type-id-72'>
      <subrange length='97' type-id='type-id-22' id='type-id-73'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-74'/>
    <array-type-def dimensions='1' type-id='type-id-74' size-in-bits='512' id='type-id-75'>
      <subrange length='8' type-id='type-id-22' id='type-id-61'/>
    </array-type-def>
    <enum-decl name='rc_attr_type' filepath='../include/radcli/radcli.h' line='112' column='1' id='type-id-76'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='PW_TYPE_STRING' value='0'/>
      <enumerator name='PW_TYPE_INTEGER' value='1'/>
      <enumerator name='PW_TYPE_IPADDR' value='2'/>
      <enumerator name='PW_TYPE_DATE' value='3'/>
      <enumerator name='PW_TYPE_IPV6ADDR' value='4'/>
      <enumerator name='PW_TYPE_IPV6PREFIX' value='5'/>
      <enumerator name='PW_TYPE_MAX' value='6'/>
    </enum-decl>
    <enum-decl name='rc_standard_codes' filepath='../include/radcli/radcli.h' line='124' column='1' id='type-id-78'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='PW_ACCESS_REQUEST' value='1'/>
      <enumerator name='PW_ACCESS_ACCEPT' value='2'/>
      <enumerator name='PW_ACCESS_REJECT' value='3'/>
      <enumerator name='PW_ACCOUNTING_REQUEST' value='4'/>
      <enumerator name='PW_ACCOUNTING_RESPONSE' value='5'/>
      <enumerator name='PW_ACCOUNTING_STATUS' value='6'/>
      <enumerator name='PW_PASSWORD_REQUEST' value='7'/>
      <enumerator name='PW_PASSWORD_ACK' value='8'/>
      <enumerator name='PW_PASSWORD_REJECT' value='9'/>
      <enumerator name='PW_ACCOUNTING_MESSAGE' value='10'/>
      <enumerator name='PW_ACCESS_CHALLENGE' value='11'/>
      <enumerator name='PW_STATUS_SERVER' value='12'/>
      <enumerator name='PW_STATUS_CLIENT' value='13'/>
    </enum-decl>
    <enum-decl name='rc_type' filepath='../include/radcli/radcli.h' line='66' column='1' id='type-id-79'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='AUTH' value='0'/>
      <enumerator name='ACCT' value='1'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-10'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-11'/>
    <class-decl name='dict_attr' size-in-bits='512' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='430' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-70' visibility='default' filepath='../include/radcli/radcli.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='value' type-id='type-id-51' visibility='default' filepath='../include/radcli/radcli.h' line='433' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type' type-id='type-id-80' visibility='default' filepath='../include/radcli/radcli.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='next' type-id='type-id-81' visibility='default' filepath='../include/radcli/radcli.h' line='435' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dict_value' size-in-bits='640' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='438' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='attrname' type-id='type-id-70' visibility='default' filepath='../include/radcli/radcli.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='264'>
        <var-decl name='name' type-id='type-id-70' visibility='default' filepath='../include/radcli/radcli.h' line='441' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='value' type-id='type-id-19' visibility='default' filepath='../include/radcli/radcli.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='next' type-id='type-id-82' visibility='default' filepath='../include/radcli/radcli.h' line='443' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dict_vendor' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='446' column='1' id='type-id-16'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='vendorname' type-id='type-id-70' visibility='default' filepath='../include/radcli/radcli.h' line='448' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='vendorpec' type-id='type-id-19' visibility='default' filepath='../include/radcli/radcli.h' line='449' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='next' type-id='type-id-83' visibility='default' filepath='../include/radcli/radcli.h' line='450' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_aaa_ctx_st' size-in-bits='904' is-struct='yes' visibility='default' filepath='../include/includes.h' line='210' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='secret' type-id='type-id-72' visibility='default' filepath='../include/includes.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='776'>
        <var-decl name='request_vector' type-id='type-id-24' visibility='default' filepath='../include/includes.h' line='213' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_conf' size-in-bits='3072' is-struct='yes' visibility='default' filepath='../include/includes.h' line='188' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='config_options' type-id='type-id-86' visibility='default' filepath='../include/includes.h' line='190' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nas_addr' type-id='type-id-87' visibility='default' filepath='../include/includes.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='nas_addr_set' type-id='type-id-48' visibility='default' filepath='../include/includes.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='own_bind_addr' type-id='type-id-87' visibility='default' filepath='../include/includes.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='own_bind_addr_set' type-id='type-id-48' visibility='default' filepath='../include/includes.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='first_dict_read' type-id='type-id-29' visibility='default' filepath='../include/includes.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='dictionary_attributes' type-id='type-id-81' visibility='default' filepath='../include/includes.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='dictionary_values' type-id='type-id-82' visibility='default' filepath='../include/includes.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='dictionary_vendors' type-id='type-id-83' visibility='default' filepath='../include/includes.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='so' type-id='type-id-88' visibility='default' filepath='../include/includes.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='so_type' type-id='type-id-48' visibility='default' filepath='../include/includes.h' line='206' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_sockets_override' size-in-bits='512' is-struct='yes' visibility='default' filepath='../include/includes.h' line='175' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ptr' type-id='type-id-3' visibility='default' filepath='../include/includes.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='static_secret' type-id='type-id-2' visibility='default' filepath='../include/includes.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='get_fd' type-id='type-id-90' visibility='default' filepath='../include/includes.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='close_fd' type-id='type-id-91' visibility='default' filepath='../include/includes.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='sendto' type-id='type-id-92' visibility='default' filepath='../include/includes.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='recvfrom' type-id='type-id-93' visibility='default' filepath='../include/includes.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='lock' type-id='type-id-94' visibility='default' filepath='../include/includes.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='unlock' type-id='type-id-94' visibility='default' filepath='../include/includes.h' line='185' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='rc_value_pair' size-in-bits='2816' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='475' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-70' visibility='default' filepath='../include/radcli/radcli.h' line='477' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='attribute' type-id='type-id-51' visibility='default' filepath='../include/radcli/radcli.h' line='478' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='type' type-id='type-id-80' visibility='default' filepath='../include/radcli/radcli.h' line='479' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='lvalue' type-id='type-id-19' visibility='default' filepath='../include/radcli/radcli.h' line='480' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='strvalue' type-id='type-id-66' visibility='default' filepath='../include/radcli/radcli.h' line='481' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='next' type-id='type-id-96' visibility='default' filepath='../include/radcli/radcli.h' line='482' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='pad' type-id='type-id-68' visibility='default' filepath='../include/radcli/radcli.h' line='483' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='send_data' size-in-bits='448' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='486' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='code' type-id='type-id-98' visibility='default' filepath='../include/radcli/radcli.h' line='488' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='seq_nbr' type-id='type-id-98' visibility='default' filepath='../include/radcli/radcli.h' line='489' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='server' type-id='type-id-29' visibility='default' filepath='../include/radcli/radcli.h' line='490' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='svc_port' type-id='type-id-10' visibility='default' filepath='../include/radcli/radcli.h' line='491' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='secret' type-id='type-id-29' visibility='default' filepath='../include/radcli/radcli.h' line='492' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='timeout' type-id='type-id-10' visibility='default' filepath='../include/radcli/radcli.h' line='493' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='retries' type-id='type-id-10' visibility='default' filepath='../include/radcli/radcli.h' line='494' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='send_pairs' type-id='type-id-53' visibility='default' filepath='../include/radcli/radcli.h' line='495' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='receive_pairs' type-id='type-id-53' visibility='default' filepath='../include/radcli/radcli.h' line='496' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='server' size-in-bits='1728' is-struct='yes' visibility='default' filepath='../include/radcli/radcli.h' line='87' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='max' type-id='type-id-10' visibility='default' filepath='../include/radcli/radcli.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='name' type-id='type-id-60' visibility='default' filepath='../include/radcli/radcli.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='port' type-id='type-id-25' visibility='default' filepath='../include/radcli/radcli.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='secret' type-id='type-id-60' visibility='default' filepath='../include/radcli/radcli.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='deadtime_ends' type-id='type-id-75' visibility='default' filepath='../include/radcli/radcli.h' line='92' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/socket.h' line='183' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sa_family' type-id='type-id-101' visibility='default' filepath='/usr/include/bits/socket.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='sa_data' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/socket.h' line='186' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='sockaddr_storage' size-in-bits='1024' is-struct='yes' visibility='default' filepath='/usr/include/bits/socket.h' line='196' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ss_family' type-id='type-id-101' visibility='default' filepath='/usr/include/bits/socket.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='__ss_padding' type-id='type-id-62' visibility='default' filepath='/usr/include/bits/socket.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__ss_align' type-id='type-id-22' visibility='default' filepath='/usr/include/bits/socket.h' line='200' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='RC_AAA_CTX' type-id='type-id-84' filepath='../include/radcli/radcli.h' line='502' column='1' id='type-id-102'/>
    <typedef-decl name='SEND_DATA' type-id='type-id-97' filepath='../include/radcli/radcli.h' line='497' column='1' id='type-id-103'/>
    <typedef-decl name='SERVER' type-id='type-id-99' filepath='../include/radcli/radcli.h' line='93' column='1' id='type-id-104'/>
    <typedef-decl name='VALUE_PAIR' type-id='type-id-95' filepath='../include/radcli/radcli.h' line='484' column='1' id='type-id-105'/>
    <typedef-decl name='__socklen_t' type-id='type-id-48' filepath='/usr/include/bits/types.h' line='210' column='1' id='type-id-106'/>
    <typedef-decl name='__ssize_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='194' column='1' id='type-id-107'/>
    <typedef-decl name='__uint16_t' type-id='type-id-39' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-108'/>
    <typedef-decl name='__uint32_t' type-id='type-id-48' filepath='/usr/include/bits/types.h' line='42' column='1' id='type-id-109'/>
    <typedef-decl name='__uint64_t' type-id='type-id-22' filepath='/usr/include/bits/types.h' line='45' column='1' id='type-id-110'/>
    <typedef-decl name='__uint8_t' type-id='type-id-111' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-112'/>
    <typedef-decl name='rc_attr_type' type-id='type-id-76' filepath='../include/radcli/radcli.h' line='120' column='1' id='type-id-80'/>
    <typedef-decl name='rc_handle' type-id='type-id-85' filepath='../include/radcli/radcli.h' line='81' column='1' id='type-id-113'/>
    <typedef-decl name='rc_sockets_override' type-id='type-id-89' filepath='../include/includes.h' line='186' column='1' id='type-id-88'/>
    <typedef-decl name='rc_standard_codes' type-id='type-id-78' filepath='../include/radcli/radcli.h' line='138' column='1' id='type-id-114'/>
    <typedef-decl name='rc_type' type-id='type-id-79' filepath='../include/radcli/radcli.h' line='69' column='1' id='type-id-115'/>
    <typedef-decl name='sa_family_t' type-id='type-id-39' filepath='/usr/include/bits/sockaddr.h' line='28' column='1' id='type-id-101'/>
    <typedef-decl name='size_t' type-id='type-id-22' filepath='/usr/lib/gcc/x86_64-redhat-linux/12/include/stddef.h' line='214' column='1' id='type-id-55'/>
    <typedef-decl name='socklen_t' type-id='type-id-106' filepath='/usr/include/bits/socket.h' line='33' column='1' id='type-id-58'/>
    <typedef-decl name='ssize_t' type-id='type-id-107' filepath='/usr/include/sys/types.h' line='108' column='1' id='type-id-116'/>
    <typedef-decl name='uint16_t' type-id='type-id-108' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-117'/>
    <typedef-decl name='uint32_t' type-id='type-id-109' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-19'/>
    <typedef-decl name='uint64_t' type-id='type-id-110' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-51'/>
    <typedef-decl name='uint8_t' type-id='type-id-112' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-98'/>
    <array-type-def dimensions='1' type-id='type-id-117' size-in-bits='128' id='type-id-25'>
      <subrange length='8' type-id='type-id-22' id='type-id-61'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-98' size-in-bits='128' id='type-id-24'>
      <subrange length='16' type-id='type-id-22' id='type-id-118'/>
    </array-type-def>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-77'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-111'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-48'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-22'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-39'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-86'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-29'/>
    <qualified-type-def type-id='type-id-59' const='yes' id='type-id-123'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-2'/>
    <qualified-type-def type-id='type-id-113' const='yes' id='type-id-124'/>
    <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-50'/>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-125'/>
    <pointer-type-def type-id='type-id-125' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-81'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-82'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-83'/>
    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-90'/>
    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-58' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-92'/>
    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-93'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-3'/>
    <class-decl name='_option' size-in-bits='640' is-struct='yes' visibility='default' filepath='./options.h' line='23' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-135' visibility='default' filepath='./options.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-10' visibility='default' filepath='./options.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='status' type-id='type-id-10' visibility='default' filepath='./options.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='val' type-id='type-id-3' visibility='default' filepath='./options.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='variadic parameter type' id='type-id-136'/>
    <type-decl name='void' id='type-id-4'/>
    <function-decl name='rc_send_server_ctx' filepath='../include/includes.h' line='216' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-119'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_conf_int' filepath='../include/radcli/radcli.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_conf_srv' filepath='../include/radcli/radcli.h' line='617' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-50'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-121'/>
    </function-decl>
    <function-decl name='rc_send_server' filepath='../include/radcli/radcli.h' line='668' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-120'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-115'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_buildreq' mangled-name='rc_buildreq' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_buildreq@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-120' name='data' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-10' name='code' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-29' name='server' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='41' column='1'/>
      <parameter type-id='type-id-39' name='port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-29' name='secret' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-10' name='timeout' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='42' column='1'/>
      <parameter type-id='type-id-10' name='retries' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='42' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx' mangled-name='rc_aaa_ctx' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='70' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-119' name='ctx' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-19' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='70' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-29' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='71' column='1'/>
      <parameter type-id='type-id-10' name='add_nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='72' column='1'/>
      <parameter type-id='type-id-114' name='request_type' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='72' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_aaa_ctx_server' mangled-name='rc_aaa_ctx_server' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa_ctx_server@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-119' name='ctx' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-121' name='aaaserver' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='111' column='1'/>
      <parameter type-id='type-id-115' name='type' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='112' column='1'/>
      <parameter type-id='type-id-19' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='113' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='114' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='114' column='1'/>
      <parameter type-id='type-id-29' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='115' column='1'/>
      <parameter type-id='type-id-10' name='add_nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='115' column='1'/>
      <parameter type-id='type-id-114' name='request_type' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='116' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_aaa' mangled-name='rc_aaa' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_aaa@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-19' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='215' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-29' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-10' name='add_nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='216' column='1'/>
      <parameter type-id='type-id-114' name='request_type' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='217' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_auth' mangled-name='rc_auth' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_auth@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-19' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='235' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='236' column='1'/>
      <parameter type-id='type-id-29' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='236' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_auth_proxy' mangled-name='rc_auth_proxy' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='257' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_auth_proxy@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-52' name='received' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='257' column='1'/>
      <parameter type-id='type-id-29' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='258' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_acct' mangled-name='rc_acct' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_acct@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='274' column='1'/>
      <parameter type-id='type-id-19' name='nas_port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='274' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='274' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_acct_proxy' mangled-name='rc_acct_proxy' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='287' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_acct_proxy@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='287' column='1'/>
      <parameter type-id='type-id-53' name='send' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='287' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_check' mangled-name='rc_check' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_check@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-29' name='host' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-29' name='secret' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-39' name='port' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='303' column='1'/>
      <parameter type-id='type-id-29' name='msg' filepath='/home/nmav/cvs/radcli/lib/buildreq.c' line='304' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_getmtime' filepath='/home/nmav/cvs/radcli/lib/util.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='random' filepath='/usr/include/stdlib.h' line='402' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-127'>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-132'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-116'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-133'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-130'/>
      <parameter type-id='type-id-131'/>
      <return type-id='type-id-116'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-128'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-130'/>
      <return type-id='type-id-10'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-134'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='config.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='8' id='type-id-137'>
      <subrange length='1' type-id='type-id-22' id='type-id-138'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='160' id='type-id-139'>
      <subrange length='20' type-id='type-id-22' id='type-id-140'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='512' id='type-id-135'>
      <subrange length='64' type-id='type-id-22' id='type-id-141'/>
    </array-type-def>
    <enum-decl name='rc_socket_type' filepath='../include/radcli/radcli.h' line='97' column='1' id='type-id-142'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='RC_SOCKET_UDP' value='0'/>
      <enumerator name='RC_SOCKET_TLS' value='1'/>
      <enumerator name='RC_SOCKET_DTLS' value='2'/>
      <enumerator name='RC_SOCKET_TCP' value='3'/>
    </enum-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-143'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-144'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-29' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-145' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-146' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-147' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-39' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-143' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-137' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-148' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-149' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-150' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-151' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-146' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-55' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-139' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_option' size-in-bits='640' is-struct='yes' visibility='default' filepath='./options.h' line='23' column='1' id='type-id-122'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-135' visibility='default' filepath='./options.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='type' type-id='type-id-10' visibility='default' filepath='./options.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='status' type-id='type-id-10' visibility='default' filepath='./options.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='val' type-id='type-id-3' visibility='default' filepath='./options.h' line='26' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='servent' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/netdb.h' line='255' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='s_name' type-id='type-id-29' visibility='default' filepath='/usr/include/netdb.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='s_aliases' type-id='type-id-30' visibility='default' filepath='/usr/include/netdb.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='s_port' type-id='type-id-10' visibility='default' filepath='/usr/include/netdb.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='s_proto' type-id='type-id-29' visibility='default' filepath='/usr/include/netdb.h' line='260' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-144' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-153'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-4' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-154'/>
    <typedef-decl name='__off64_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='153' column='1' id='type-id-149'/>
    <typedef-decl name='__off_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='152' column='1' id='type-id-147'/>
    <typedef-decl name='__pid_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='154' column='1' id='type-id-155'/>
    <typedef-decl name='rc_socket_type' type-id='type-id-142' filepath='../include/radcli/radcli.h' line='102' column='1' id='type-id-156'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-157'/>
    <qualified-type-def type-id='type-id-157' restrict='yes' id='type-id-158'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-146'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-154' size-in-bits='64' id='type-id-148'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-151'/>
    <pointer-type-def type-id='type-id-152' size-in-bits='64' id='type-id-162'/>
    <qualified-type-def type-id='type-id-130' restrict='yes' id='type-id-163'/>
    <qualified-type-def type-id='type-id-131' restrict='yes' id='type-id-164'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-159'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-160'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-161'/>
    <function-decl name='rc_read_dictionary' filepath='../include/radcli/radcli.h' line='631' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_dict_free' filepath='../include/radcli/radcli.h' line='644' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_add_config' mangled-name='rc_add_config' filepath='/home/nmav/cvs/radcli/lib/config.c' line='294' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_add_config@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-2' name='option_name' filepath='/home/nmav/cvs/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-2' name='option_val' filepath='/home/nmav/cvs/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-2' name='source' filepath='/home/nmav/cvs/radcli/lib/config.c' line='294' column='1'/>
      <parameter type-id='type-id-10' name='line' filepath='/home/nmav/cvs/radcli/lib/config.c' line='294' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_config_init' mangled-name='rc_config_init' filepath='/home/nmav/cvs/radcli/lib/config.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_config_init@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='349' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='rc_apply_config' mangled-name='rc_apply_config' filepath='/home/nmav/cvs/radcli/lib/config.c' line='500' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_apply_config@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='500' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_read_config' mangled-name='rc_read_config' filepath='/home/nmav/cvs/radcli/lib/config.c' line='568' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_config@@RADCLI_5'>
      <parameter type-id='type-id-2' name='filename' filepath='/home/nmav/cvs/radcli/lib/config.c' line='568' column='1'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='rc_conf_str' mangled-name='rc_conf_str' filepath='/home/nmav/cvs/radcli/lib/config.c' line='708' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_conf_str@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='708' column='1'/>
      <parameter type-id='type-id-2' name='optname' filepath='/home/nmav/cvs/radcli/lib/config.c' line='708' column='1'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='rc_test_config' mangled-name='rc_test_config' filepath='/home/nmav/cvs/radcli/lib/config.c' line='778' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_test_config@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='778' column='1'/>
      <parameter type-id='type-id-2' name='filename' filepath='/home/nmav/cvs/radcli/lib/config.c' line='778' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_find_server_addr' mangled-name='rc_find_server_addr' filepath='/home/nmav/cvs/radcli/lib/config.c' line='912' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_find_server_addr@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='912' column='1'/>
      <parameter type-id='type-id-2' name='server_name' filepath='/home/nmav/cvs/radcli/lib/config.c' line='912' column='1'/>
      <parameter type-id='type-id-165' name='info' filepath='/home/nmav/cvs/radcli/lib/config.c' line='913' column='1'/>
      <parameter type-id='type-id-29' name='secret' filepath='/home/nmav/cvs/radcli/lib/config.c' line='913' column='1'/>
      <parameter type-id='type-id-115' name='type' filepath='/home/nmav/cvs/radcli/lib/config.c' line='913' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_config_free' mangled-name='rc_config_free' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1062' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_config_free@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1062' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_new' mangled-name='rc_new' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_new@@RADCLI_5'>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='rc_destroy' mangled-name='rc_destroy' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_destroy@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1127' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_get_socket_type' mangled-name='rc_get_socket_type' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1148' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_get_socket_type@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/config.c' line='1148' column='1'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='rc_init_tls' filepath='/home/nmav/cvs/radcli/lib/tls.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_getaddrinfo' filepath='/home/nmav/cvs/radcli/lib/util.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-166'/>
    </function-decl>
    <function-decl name='rc_own_bind_addr' filepath='/home/nmav/cvs/radcli/lib/util.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='getservbyname' filepath='/usr/include/netdb.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-162'/>
    </function-decl>
    <function-decl name='freeaddrinfo' filepath='/usr/include/netdb.h' line='666' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-157'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fopen' filepath='/usr/include/stdio.h' line='258' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='fgets' filepath='/usr/include/stdio.h' line='592' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='srandom' filepath='/usr/include/stdlib.h' line='405' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='strdup' filepath='/usr/include/string.h' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='strcspn' filepath='/usr/include/string.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='strtok_r' filepath='/usr/include/string.h' line='366' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='strcasecmp' filepath='/usr/include/strings.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='socket' filepath='/usr/include/sys/socket.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='bind' filepath='/usr/include/sys/socket.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='connect' filepath='/usr/include/sys/socket.h' line='126' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='sendto' filepath='/usr/include/sys/socket.h' line='152' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-126'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='recvfrom' filepath='/usr/include/sys/socket.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='getpid' filepath='/usr/include/unistd.h' line='650' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-155'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='dict.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <function-decl name='rc_dict_addattr' mangled-name='rc_dict_addattr' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='38' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addattr@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-2' name='namestr' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-19' name='value' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-10' name='type' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='38' column='1'/>
      <parameter type-id='type-id-19' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='38' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='rc_dict_addval' mangled-name='rc_dict_addval' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addval@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-2' name='attrstr' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-2' name='namestr' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='81' column='1'/>
      <parameter type-id='type-id-19' name='value' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='81' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='rc_dict_addvend' mangled-name='rc_dict_addvend' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='122' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_addvend@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='122' column='1'/>
      <parameter type-id='type-id-2' name='namestr' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='122' column='1'/>
      <parameter type-id='type-id-19' name='vendorspec' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='122' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='rc_read_dictionary_from_buffer' mangled-name='rc_read_dictionary_from_buffer' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_read_dictionary_from_buffer@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='507' column='1'/>
      <parameter type-id='type-id-2' name='buf' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='507' column='1'/>
      <parameter type-id='type-id-55' name='size' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='507' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_dict_findvend' mangled-name='rc_dict_findvend' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_dict_findvend@@RADCLI_5'>
      <parameter type-id='type-id-50' name='rh' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='599' column='1'/>
      <parameter type-id='type-id-2' name='vendorname' filepath='/home/nmav/cvs/radcli/lib/dict.c' line='599' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='fmemopen' filepath='/usr/include/stdio.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-157'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-29'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='ip_util.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='520' id='type-id-169'>
      <subrange length='65' type-id='type-id-22' id='type-id-170'/>
    </array-type-def>
    <class-decl name='utsname' size-in-bits='3120' is-struct='yes' visibility='default' filepath='/usr/include/sys/utsname.h' line='48' column='1' id='type-id-171'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='sysname' type-id='type-id-169' visibility='default' filepath='/usr/include/sys/utsname.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='520'>
        <var-decl name='nodename' type-id='type-id-169' visibility='default' filepath='/usr/include/sys/utsname.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='release' type-id='type-id-169' visibility='default' filepath='/usr/include/sys/utsname.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1560'>
        <var-decl name='version' type-id='type-id-169' visibility='default' filepath='/usr/include/sys/utsname.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='machine' type-id='type-id-169' visibility='default' filepath='/usr/include/sys/utsname.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2600'>
        <var-decl name='__domainname' type-id='type-id-169' visibility='default' filepath='/usr/include/sys/utsname.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-165' restrict='yes' id='type-id-172'/>
    <qualified-type-def type-id='type-id-173' const='yes' id='type-id-174'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-175'/>
    <qualified-type-def type-id='type-id-175' restrict='yes' id='type-id-176'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-177'/>
    <function-decl name='rc_getport' mangled-name='rc_getport' filepath='/home/nmav/cvs/radcli/lib/ip_util.c' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_getport@@RADCLI_5'>
      <parameter type-id='type-id-10' name='type' filepath='/home/nmav/cvs/radcli/lib/ip_util.c' line='63' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='rc_own_hostname' mangled-name='rc_own_hostname' filepath='/home/nmav/cvs/radcli/lib/ip_util.c' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_own_hostname@@RADCLI_5'>
      <parameter type-id='type-id-29' name='hostname' filepath='/home/nmav/cvs/radcli/lib/ip_util.c' line='81' column='1'/>
      <parameter type-id='type-id-10' name='len' filepath='/home/nmav/cvs/radcli/lib/ip_util.c' line='81' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_get_srcaddr' mangled-name='rc_get_srcaddr' filepath='/home/nmav/cvs/radcli/lib/ip_util.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_get_srcaddr@@RADCLI_5'>
      <parameter type-id='type-id-130' name='lia' filepath='/home/nmav/cvs/radcli/lib/ip_util.c' line='124' column='1'/>
      <parameter type-id='type-id-126' name='ria' filepath='/home/nmav/cvs/radcli/lib/ip_util.c' line='124' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='getaddrinfo' filepath='/usr/include/netdb.h' line='660' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-32'/>
      <parameter type-id='type-id-176'/>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='getsockname' filepath='/usr/include/sys/socket.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-164'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='uname' filepath='/usr/include/sys/utsname.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='log.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <function-decl name='rc_setdebug' mangled-name='rc_setdebug' filepath='/home/nmav/cvs/radcli/lib/log.c' line='16' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_setdebug@@RADCLI_5'>
      <parameter type-id='type-id-10' name='debug' filepath='/home/nmav/cvs/radcli/lib/log.c' line='16' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_openlog' mangled-name='rc_openlog' filepath='/home/nmav/cvs/radcli/lib/log.c' line='36' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_openlog@@RADCLI_5'>
      <parameter type-id='type-id-2' name='ident' filepath='/home/nmav/cvs/radcli/lib/log.c' line='36' column='1'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='openlog' filepath='/usr/include/sys/syslog.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nettle-hmac.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <class-decl name='hmac_md5_ctx' size-in-bits='2304' is-struct='yes' visibility='default' filepath='/usr/include/nettle/hmac.h' line='121' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='outer' type-id='type-id-179' visibility='default' filepath='/usr/include/nettle/hmac.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='inner' type-id='type-id-179' visibility='default' filepath='/usr/include/nettle/hmac.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='state' type-id='type-id-179' visibility='default' filepath='/usr/include/nettle/hmac.h' line='121' column='1'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='type-id-98' const='yes' id='type-id-180'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-181'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-182'/>
    <function-decl name='nettle_hmac_md5_set_key' filepath='/usr/include/nettle/hmac.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nettle_hmac_md5_update' filepath='/usr/include/nettle/hmac.h' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-181'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nettle_hmac_md5_digest' filepath='/usr/include/nettle/hmac.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-182'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='rc-md5.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <class-decl name='md5_ctx' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/nettle/md5.h' line='56' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='state' type-id='type-id-21' visibility='default' filepath='/usr/include/nettle/md5.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='count' type-id='type-id-51' visibility='default' filepath='/usr/include/nettle/md5.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='index' type-id='type-id-48' visibility='default' filepath='/usr/include/nettle/md5.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='block' type-id='type-id-184' visibility='default' filepath='/usr/include/nettle/md5.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='MD5_CTX' type-id='type-id-179' filepath='/usr/include/nettle/md5-compat.h' line='48' column='1' id='type-id-185'/>
    <array-type-def dimensions='1' type-id='type-id-98' size-in-bits='512' id='type-id-184'>
      <subrange length='64' type-id='type-id-22' id='type-id-141'/>
    </array-type-def>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-186'/>
    <function-decl name='nettle_MD5Init' filepath='/usr/include/nettle/md5-compat.h' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nettle_MD5Update' filepath='/usr/include/nettle/md5-compat.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-186'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='nettle_MD5Final' filepath='/usr/include/nettle/md5-compat.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-186'/>
      <return type-id='type-id-4'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='sendserver.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <enum-decl name='gnutls_rnd_level' filepath='/usr/include/gnutls/crypto.h' line='200' column='1' id='type-id-188'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_RND_NONCE' value='0'/>
      <enumerator name='GNUTLS_RND_RANDOM' value='1'/>
      <enumerator name='GNUTLS_RND_KEY' value='2'/>
    </enum-decl>
    <type-decl name='short int' size-in-bits='16' id='type-id-189'/>
    <class-decl name='addrinfo' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/netdb.h' line='565' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ai_flags' type-id='type-id-10' visibility='default' filepath='/usr/include/netdb.h' line='567' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ai_family' type-id='type-id-10' visibility='default' filepath='/usr/include/netdb.h' line='568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ai_socktype' type-id='type-id-10' visibility='default' filepath='/usr/include/netdb.h' line='569' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ai_protocol' type-id='type-id-10' visibility='default' filepath='/usr/include/netdb.h' line='570' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='ai_addrlen' type-id='type-id-58' visibility='default' filepath='/usr/include/netdb.h' line='571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ai_addr' type-id='type-id-130' visibility='default' filepath='/usr/include/netdb.h' line='572' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ai_canonname' type-id='type-id-29' visibility='default' filepath='/usr/include/netdb.h' line='573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ai_next' type-id='type-id-166' visibility='default' filepath='/usr/include/netdb.h' line='574' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='pollfd' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/sys/poll.h' line='36' column='1' id='type-id-190'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='fd' type-id='type-id-10' visibility='default' filepath='/usr/include/sys/poll.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='events' type-id='type-id-189' visibility='default' filepath='/usr/include/sys/poll.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='revents' type-id='type-id-189' visibility='default' filepath='/usr/include/sys/poll.h' line='40' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gnutls_rnd_level_t' type-id='type-id-188' filepath='/usr/include/gnutls/crypto.h' line='204' column='1' id='type-id-191'/>
    <typedef-decl name='nfds_t' type-id='type-id-22' filepath='/usr/include/sys/poll.h' line='33' column='1' id='type-id-192'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-165'/>
    <qualified-type-def type-id='type-id-29' restrict='yes' id='type-id-57'/>
    <qualified-type-def type-id='type-id-126' restrict='yes' id='type-id-193'/>
    <qualified-type-def type-id='type-id-111' const='yes' id='type-id-194'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-183'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-187'/>
    <qualified-type-def type-id='type-id-3' restrict='yes' id='type-id-56'/>
    <function-decl name='hmac_md5_with_nettle' filepath='/home/nmav/cvs/radcli/lib/rc-hmac.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-183'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-183'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_md5_calc' filepath='/home/nmav/cvs/radcli/lib/rc-md5.h' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-187'/>
      <parameter type-id='type-id-54'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='rc_set_netns' filepath='/home/nmav/cvs/radcli/lib/util.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_reset_netns' filepath='/home/nmav/cvs/radcli/lib/util.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_rnd' filepath='/usr/include/gnutls/crypto.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-191'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='getnameinfo' filepath='/usr/include/netdb.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-193'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='poll' filepath='/usr/include/sys/poll.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-195'/>
      <parameter type-id='type-id-192'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='setsockopt' filepath='/usr/include/sys/socket.h' line='277' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-58'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='tls.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='320' id='type-id-196'>
      <subrange length='40' type-id='type-id-22' id='type-id-197'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='32' id='type-id-198'>
      <subrange length='4' type-id='type-id-22' id='type-id-23'/>
    </array-type-def>
    <enum-decl name='gnutls_alert_description_t' naming-typedef-id='type-id-199' filepath='/usr/include/gnutls/gnutls.h' line='595' column='1' id='type-id-200'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_A_CLOSE_NOTIFY' value='0'/>
      <enumerator name='GNUTLS_A_UNEXPECTED_MESSAGE' value='10'/>
      <enumerator name='GNUTLS_A_BAD_RECORD_MAC' value='20'/>
      <enumerator name='GNUTLS_A_DECRYPTION_FAILED' value='21'/>
      <enumerator name='GNUTLS_A_RECORD_OVERFLOW' value='22'/>
      <enumerator name='GNUTLS_A_DECOMPRESSION_FAILURE' value='30'/>
      <enumerator name='GNUTLS_A_HANDSHAKE_FAILURE' value='40'/>
      <enumerator name='GNUTLS_A_SSL3_NO_CERTIFICATE' value='41'/>
      <enumerator name='GNUTLS_A_BAD_CERTIFICATE' value='42'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_CERTIFICATE' value='43'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REVOKED' value='44'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_EXPIRED' value='45'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNKNOWN' value='46'/>
      <enumerator name='GNUTLS_A_ILLEGAL_PARAMETER' value='47'/>
      <enumerator name='GNUTLS_A_UNKNOWN_CA' value='48'/>
      <enumerator name='GNUTLS_A_ACCESS_DENIED' value='49'/>
      <enumerator name='GNUTLS_A_DECODE_ERROR' value='50'/>
      <enumerator name='GNUTLS_A_DECRYPT_ERROR' value='51'/>
      <enumerator name='GNUTLS_A_EXPORT_RESTRICTION' value='60'/>
      <enumerator name='GNUTLS_A_PROTOCOL_VERSION' value='70'/>
      <enumerator name='GNUTLS_A_INSUFFICIENT_SECURITY' value='71'/>
      <enumerator name='GNUTLS_A_INTERNAL_ERROR' value='80'/>
      <enumerator name='GNUTLS_A_INAPPROPRIATE_FALLBACK' value='86'/>
      <enumerator name='GNUTLS_A_USER_CANCELED' value='90'/>
      <enumerator name='GNUTLS_A_NO_RENEGOTIATION' value='100'/>
      <enumerator name='GNUTLS_A_MISSING_EXTENSION' value='109'/>
      <enumerator name='GNUTLS_A_UNSUPPORTED_EXTENSION' value='110'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_UNOBTAINABLE' value='111'/>
      <enumerator name='GNUTLS_A_UNRECOGNIZED_NAME' value='112'/>
      <enumerator name='GNUTLS_A_UNKNOWN_PSK_IDENTITY' value='115'/>
      <enumerator name='GNUTLS_A_CERTIFICATE_REQUIRED' value='116'/>
      <enumerator name='GNUTLS_A_NO_APPLICATION_PROTOCOL' value='120'/>
      <enumerator name='GNUTLS_A_MAX' value='120'/>
    </enum-decl>
    <enum-decl name='gnutls_certificate_type_t' naming-typedef-id='type-id-201' filepath='/usr/include/gnutls/gnutls.h' line='823' column='1' id='type-id-202'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_CRT_UNKNOWN' value='0'/>
      <enumerator name='GNUTLS_CRT_X509' value='1'/>
      <enumerator name='GNUTLS_CRT_OPENPGP' value='2'/>
      <enumerator name='GNUTLS_CRT_RAWPK' value='3'/>
      <enumerator name='GNUTLS_CRT_MAX' value='3'/>
    </enum-decl>
    <enum-decl name='gnutls_credentials_type_t' naming-typedef-id='type-id-203' filepath='/usr/include/gnutls/gnutls.h' line='274' column='1' id='type-id-204'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_CRD_CERTIFICATE' value='1'/>
      <enumerator name='GNUTLS_CRD_ANON' value='2'/>
      <enumerator name='GNUTLS_CRD_SRP' value='3'/>
      <enumerator name='GNUTLS_CRD_PSK' value='4'/>
      <enumerator name='GNUTLS_CRD_IA' value='5'/>
    </enum-decl>
    <enum-decl name='gnutls_psk_key_flags' filepath='/usr/include/gnutls/gnutls.h' line='2653' column='1' id='type-id-205'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_PSK_KEY_RAW' value='0'/>
      <enumerator name='GNUTLS_PSK_KEY_HEX' value='1'/>
    </enum-decl>
    <enum-decl name='gnutls_server_name_type_t' naming-typedef-id='type-id-206' filepath='/usr/include/gnutls/gnutls.h' line='1608' column='1' id='type-id-207'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_NAME_DNS' value='1'/>
    </enum-decl>
    <enum-decl name='gnutls_x509_crt_fmt_t' naming-typedef-id='type-id-208' filepath='/usr/include/gnutls/gnutls.h' line='838' column='1' id='type-id-209'>
      <underlying-type type-id='type-id-77'/>
      <enumerator name='GNUTLS_X509_FMT_DER' value='0'/>
      <enumerator name='GNUTLS_X509_FMT_PEM' value='1'/>
    </enum-decl>
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__prev' type-id='type-id-211' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__next' type-id='type-id-211' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='54' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__lock' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='__count' type-id='type-id-48' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__owner' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='__nusers' type-id='type-id-48' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__kind' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='__spins' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <var-decl name='__elision' type-id='type-id-189' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__list' type-id='type-id-213' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='gnutls_datum_t' size-in-bits='128' is-struct='yes' naming-typedef-id='type-id-214' visibility='default' filepath='/usr/include/gnutls/gnutls.h' line='1238' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-187' visibility='default' filepath='/usr/include/gnutls/gnutls.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-48' visibility='default' filepath='/usr/include/gnutls/gnutls.h' line='1240' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__pthread_list_t' type-id='type-id-210' filepath='/usr/include/bits/thread-shared-types.h' line='55' column='1' id='type-id-213'/>
    <typedef-decl name='gnutls_alert_description_t' type-id='type-id-200' filepath='/usr/include/gnutls/gnutls.h' line='629' column='1' id='type-id-199'/>
    <typedef-decl name='gnutls_certificate_credentials_t' type-id='type-id-216' filepath='/usr/include/gnutls/gnutls.h' line='2046' column='1' id='type-id-217'/>
    <typedef-decl name='gnutls_certificate_type_t' type-id='type-id-202' filepath='/usr/include/gnutls/gnutls.h' line='829' column='1' id='type-id-201'/>
    <typedef-decl name='gnutls_certificate_verify_function' type-id='type-id-218' filepath='/usr/include/gnutls/gnutls.h' line='1857' column='1' id='type-id-219'/>
    <typedef-decl name='gnutls_credentials_type_t' type-id='type-id-204' filepath='/usr/include/gnutls/gnutls.h' line='280' column='1' id='type-id-203'/>
    <typedef-decl name='gnutls_datum_t' type-id='type-id-215' filepath='/usr/include/gnutls/gnutls.h' line='1241' column='1' id='type-id-214'/>
    <typedef-decl name='gnutls_psk_client_credentials_t' type-id='type-id-220' filepath='/usr/include/gnutls/gnutls.h' line='2644' column='1' id='type-id-221'/>
    <typedef-decl name='gnutls_psk_key_flags' type-id='type-id-205' filepath='/usr/include/gnutls/gnutls.h' line='2656' column='1' id='type-id-222'/>
    <typedef-decl name='gnutls_server_name_type_t' type-id='type-id-207' filepath='/usr/include/gnutls/gnutls.h' line='1610' column='1' id='type-id-206'/>
    <typedef-decl name='gnutls_session_t' type-id='type-id-223' filepath='/usr/include/gnutls/gnutls.h' line='1226' column='1' id='type-id-224'/>
    <typedef-decl name='gnutls_x509_crt_fmt_t' type-id='type-id-209' filepath='/usr/include/gnutls/gnutls.h' line='841' column='1' id='type-id-208'/>
    <typedef-decl name='pthread_mutex_t' type-id='type-id-225' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-226'/>
    <typedef-decl name='pthread_mutexattr_t' type-id='type-id-227' filepath='/usr/include/bits/pthreadtypes.h' line='36' column='1' id='type-id-228'/>
    <union-decl name='pthread_mutex_t' size-in-bits='320' naming-typedef-id='type-id-226' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' id='type-id-225'>
      <data-member access='public'>
        <var-decl name='__data' type-id='type-id-212' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-196' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='pthread_mutexattr_t' size-in-bits='32' naming-typedef-id='type-id-228' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='32' column='1' id='type-id-227'>
      <data-member access='public'>
        <var-decl name='__size' type-id='type-id-198' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='34' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='__align' type-id='type-id-10' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='35' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-211'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-229'/>
    <qualified-type-def type-id='type-id-214' const='yes' id='type-id-230'/>
    <pointer-type-def type-id='type-id-230' size-in-bits='64' id='type-id-231'/>
    <qualified-type-def type-id='type-id-228' const='yes' id='type-id-232'/>
    <pointer-type-def type-id='type-id-232' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-234' size-in-bits='64' id='type-id-216'/>
    <pointer-type-def type-id='type-id-217' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-219' size-in-bits='64' id='type-id-236'/>
    <pointer-type-def type-id='type-id-214' size-in-bits='64' id='type-id-237'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-221' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-240' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-224' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-226' size-in-bits='64' id='type-id-242'/>
    <class-decl name='gnutls_certificate_credentials_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-234'/>
    <class-decl name='gnutls_psk_client_credentials_st' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-238'/>
    <class-decl name='gnutls_session_int' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-240'/>
    <function-decl name='rc_tls_fd' mangled-name='rc_tls_fd' filepath='/home/nmav/cvs/radcli/lib/tls.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_tls_fd@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/tls.c' line='433' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='rc_check_tls' mangled-name='rc_check_tls' filepath='/home/nmav/cvs/radcli/lib/tls.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_check_tls@@RADCLI_5'>
      <parameter type-id='type-id-129' name='rh' filepath='/home/nmav/cvs/radcli/lib/tls.c' line='464' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_dtls_set_timeouts' filepath='/usr/include/gnutls/dtls.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_init' filepath='/usr/include/gnutls/gnutls.h' line='1263' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_deinit' filepath='/usr/include/gnutls/gnutls.h' line='1264' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_handshake' filepath='/usr/include/gnutls/gnutls.h' line='1269' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_handshake_set_timeout' filepath='/usr/include/gnutls/gnutls.h' line='1275' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_alert_get' filepath='/usr/include/gnutls/gnutls.h' line='1282' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-199'/>
    </function-decl>
    <function-decl name='gnutls_alert_get_name' filepath='/usr/include/gnutls/gnutls.h' line='1287' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-199'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_certificate_type_get' filepath='/usr/include/gnutls/gnutls.h' line='1322' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-201'/>
    </function-decl>
    <function-decl name='gnutls_error_is_fatal' filepath='/usr/include/gnutls/gnutls.h' line='1466' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_strerror' filepath='/usr/include/gnutls/gnutls.h' line='1470' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_ping' filepath='/usr/include/gnutls/gnutls.h' line='1488' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_record_send' filepath='/usr/include/gnutls/gnutls.h' line='1523' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='gnutls_record_recv' filepath='/usr/include/gnutls/gnutls.h' line='1532' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-116'/>
    </function-decl>
    <function-decl name='gnutls_server_name_set' filepath='/usr/include/gnutls/gnutls.h' line='1612' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-206'/>
      <parameter type-id='type-id-3'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_heartbeat_enable' filepath='/usr/include/gnutls/gnutls.h' line='1629' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_priority_set_direct' filepath='/usr/include/gnutls/gnutls.h' line='1789' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-229'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_set_default_priority' filepath='/usr/include/gnutls/gnutls.h' line='1817' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_credentials_set' filepath='/usr/include/gnutls/gnutls.h' line='2012' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-203'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_certificate_free_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2084' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_allocate_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2086' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-235'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_trust_file' filepath='/usr/include/gnutls/gnutls.h' line='2144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_x509_key_file' filepath='/usr/include/gnutls/gnutls.h' line='2165' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-208'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_transport_set_int2' filepath='/usr/include/gnutls/gnutls.h' line='2446' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_session_set_ptr' filepath='/usr/include/gnutls/gnutls.h' line='2481' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_session_get_ptr' filepath='/usr/include/gnutls/gnutls.h' line='2482' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='gnutls_psk_free_client_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2659' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_psk_allocate_client_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2661' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_psk_set_client_credentials' filepath='/usr/include/gnutls/gnutls.h' line='2663' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-222'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_certificate_set_verify_function' filepath='/usr/include/gnutls/gnutls.h' line='2867' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-217'/>
      <parameter type-id='type-id-236'/>
      <return type-id='type-id-4'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers2' filepath='/usr/include/gnutls/gnutls.h' line='2891' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verify_peers3' filepath='/usr/include/gnutls/gnutls.h' line='2893' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-224'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='gnutls_certificate_verification_status_print' filepath='/usr/include/gnutls/gnutls.h' line='2903' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-48'/>
      <parameter type-id='type-id-201'/>
      <parameter type-id='type-id-237'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='pthread_mutex_init' filepath='/usr/include/pthread.h' line='781' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-233'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='pthread_mutex_destroy' filepath='/usr/include/pthread.h' line='786' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='pthread_mutex_lock' filepath='/usr/include/pthread.h' line='794' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='pthread_mutex_unlock' filepath='/usr/include/pthread.h' line='835' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-242'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-218'>
      <parameter type-id='type-id-224'/>
      <return type-id='type-id-10'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='util.c' comp-dir-path='/home/nmav/cvs/radcli/lib' language='LANG_C11'>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1' id='type-id-243'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-18' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-244' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='__clockid_t' type-id='type-id-10' filepath='/usr/include/bits/types.h' line='169' column='1' id='type-id-245'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-11' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-244'/>
    <typedef-decl name='clockid_t' type-id='type-id-245' filepath='/usr/include/bits/types/clockid_t.h' line='7' column='1' id='type-id-246'/>
    <pointer-type-def type-id='type-id-243' size-in-bits='64' id='type-id-247'/>
    <function-decl name='rc_mksid' mangled-name='rc_mksid' filepath='/home/nmav/cvs/radcli/lib/util.c' line='94' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rc_mksid@@RADCLI_5'>
      <return type-id='type-id-29'/>
    </function-decl>
    <function-decl name='setns' filepath='/usr/include/bits/sched.h' line='99' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-10'/>
      <parameter type-id='type-id-10'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='open' filepath='/usr/include/fcntl.h' line='209' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-10'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='clock_gettime' filepath='/usr/include/time.h' line='288' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-246'/>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-10'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
